{"id":{"0":"qyzcht","1":"qyyc9o","2":"qyx0s8","3":"qytu4s","4":"qysmor","5":"qyql5c","6":"qyn883","7":"qymrcm","8":"qyliu3","9":"qy9g45","10":"qy8r16","11":"qy25ek","12":"qy1ube","13":"qxyt24","14":"qxy73i","15":"qxvlfx","16":"qxu2r1","17":"qxoj7f","18":"qxj725","19":"qxbuoj","20":"qx6lmf","21":"qwraka","22":"qw5uhp","23":"qw58ko","24":"qw3a1h","25":"qw2284","26":"qw1wa1","27":"qvkfzl","28":"qv6h44","29":"qus0dz","30":"qunyhy","31":"qun02l","32":"qukec7","33":"qu43n7","34":"qu3lef","35":"qtzd98","36":"qty8go","37":"qtv0wp","38":"qtb521","39":"qtatte","40":"qtamde","41":"qt9ry2","42":"qt83rw","43":"qt6vbu","44":"qswqsj","45":"qsqhvc","46":"qsmkhi","47":"qsm7zm","48":"qsm4d0","49":"qsgh8h","50":"qsbpia","51":"qs6vbf","52":"qs6v2b","53":"qs2oe6","54":"qs1t3f","55":"qrz9tl","56":"qrw6ez","57":"qrtqmp","58":"qrs8hc","59":"qrffry","60":"qrbxkv","61":"qr8ew6","62":"qqzfej","63":"qqsdw6","64":"qqosdc","65":"qqjwrm","66":"qqhb5p","67":"qqe0c2","68":"qq6vn5","69":"qpt0ri","70":"qpsgs0","71":"qprhy4","72":"qpnmri","73":"qp3afz","74":"qoyi8v","75":"qovkai","76":"qotd0c","77":"qoqx3w","78":"qoq7jv","79":"qojngx","80":"qojjjv","81":"qodk3v","82":"qobnrc","83":"qob4fk","84":"qo6ciw","85":"qo53wd","86":"qo4n0c","87":"qo2kh0","88":"qny2ap","89":"qnty5q","90":"qnmw7e","91":"qnht0l","92":"qnfrod","93":"qn3p1m","94":"qn39ko","95":"qmsdtv","96":"qmo0zc","97":"qmkxos","98":"qm07an","99":"qltkxn","100":"qlqfh5","101":"qlpv2g","102":"qlojcc","103":"qlmuuk","104":"qlfzru","105":"qlai2b","106":"ql66up","107":"ql08sv","108":"qkwebt","109":"qkulx9","110":"qktuyu","111":"qkpmef","112":"qkg6f7","113":"qkdmzk","114":"qkbofo","115":"qkaqvj","116":"qk8hs1","117":"qk8dqx","118":"qk06nx","119":"qjy9wq","120":"qjuidy","121":"qjqzyc","122":"qje3g7","123":"qj2g0n","124":"qizsom","125":"qiz4rc","126":"qiyvfs","127":"qiwf8z","128":"qisgcf","129":"qikzch","130":"qik40t","131":"qiin82","132":"qiiae1","133":"qia1qm","134":"qi63sj","135":"qho55p","136":"qhbxcl","137":"qh5zhg","138":"qgq483","139":"qgn3df","140":"qgmfcz","141":"qgkjpv","142":"qgf054","143":"qgd1r6","144":"qg963n","145":"qfwb0y","146":"qfsby3","147":"qfhvjo","148":"qfax9v","149":"qf5erh","150":"qf44c5","151":"qelhwv","152":"qehrup","153":"qee9mg","154":"qe7ai3","155":"qe4s49","156":"qe4lqu","157":"qe4el2","158":"qe2fwv","159":"qe0jno","160":"qdwq96","161":"qdrqj4","162":"qdmc9d","163":"qdf84e","164":"qdcob7","165":"qd91ud","166":"qd2g69","167":"qczpdn","168":"qc29py","169":"qc0uzw","170":"qc099x","171":"qbuibm","172":"qbtlxh","173":"qbst59","174":"qbsmj4","175":"qbrfxa","176":"qbkrok","177":"qbkljt","178":"qbg569","179":"qbehpa","180":"qb63vd","181":"qazr6n","182":"qazoln","183":"qaxp9d","184":"qaxokh","185":"qaxlhs","186":"qavlwn","187":"qaujsj","188":"qat95l","189":"qaqvwi","190":"qaqga5","191":"qant11","192":"qannll","193":"qan6m0","194":"qabt1s","195":"qaanme","196":"qa9hf8","197":"qa7bd1","198":"q9xrl7","199":"q9v9ss"},"title":{"0":"\"Get woke, go broke\" as a concept is completely flawed","1":"I have yet to hear a single definition of \"the system\"","2":"[deleted by user]","3":"Grosskreutz and Huber didn’t rush Kyle to “protect” anyone, they attacked him because they wanted revenge for him killing one of theirs","4":"The only privilege is looks and brains","5":"How us Reddit mods operate","6":"[deleted by user]","7":"The Maserati Mike situation proves that Rittenhouse was creating a dangerous situation by carrying an AR","8":"In order to be allowed to vote, white people should be required to take an oath to not be racist against Black people","9":"[deleted by user]","10":"The Rittenhouse Prosecutor didn't do a bad job. He actually did a pretty good job with what he had to work with","11":"I feel like abortion is immoral but people just choose to ignore it.","12":"[deleted by user]","13":"The 🤷‍♂️ emoji is by far the worst emoji EVER","14":"Donald Trump was a good president. Not a great one.","15":"People only hate billionaires because they feel entitled to their money","16":"There should be vigilante licenses.","17":"People under the age of 18 should have as little information or interaction with any religions, preferably none.","18":"Joe Biden was right to pull out of Afghanistan","19":"Women are so terrified of being taken advantage of for sex, and men are so terrified of being taken advantage of for money\/paying for dates, when the answer is simple:","20":"It's a shame religion now has no representation in modern entertainment.","21":"Against Videogame Remasters","22":"Brass Attack singer gives me faith in humanity","23":"Travis Scott did nothing wrong","24":"A Republic is not a form of government its a type of country so saying \"we're a republic not a democracy\" makes you sound stupid.","25":"Professional \"athletes\" in unpopular niche sports are not impressive.","26":"High school was better than college","27":"[deleted by user]","28":"Homeless people should be jailed\/ executed if they fail to be a productive member of society.","29":"Diversity isn't ruining your movies and TV shows","30":"The Democratic party should be banned from the United States for their embrace of authoritarianism and draconian policies.","31":"Kyle Rittenhouse didn't act in self-defense","32":"Germans didn't want to help the jews for their promised financial gains and not to be taunted by society — Meat eaters don't wanna help the animals in suffering for their pleasure and cause it's cheap. So what's the actual difference…","33":"[deleted by user]","34":"Sleeping is a waste of time","35":"Older music is garbage","36":"Both the incel and some of the \"woke left\" movement have something in common, they think attraction or lack of should be shamed","37":"Hunting deer is stupid","38":"Despite what people say, looks do actually matter a lot","39":"Seniority should be abolished from the workplace","40":"Real Manhood is not about foolishly standing on worthless convictions and beliefs that sound great but lack wisdom and reflection. Manhood =\/= foolishness","41":"The establishment's unintended message: Arm yourself, wear a uniform and put on a face mask if at risk of political violence","42":"People on the right have no clue how hard minorities and other immigrants work, and it shows.","43":"MuH SaTiRe","44":"Affirmative action is necessary","45":"[deleted by user]","46":"The Judge is pathetically biased in the Kyle Rittenhouse Case.","47":"Selling or possessing alcohol shouldn't be illegal, but drinking it should be illegal","48":"If you think that men should wipe the tip of their penis after peeing, you're hilariously out of touch","49":"Canadians (this is mostly about a lot of them on the internet) are really annoying.","50":"Mass immigration may lead to a breakdown of progressive society","51":"Crypto is not a scam, or a ponzi-scheme. Shitcoins, rugpulls and scams do exist within crypto, as do they in nearly every other market, but do your own research and you'll see that crypto is not just about getting rich. There's real technology behind it.","52":"Crypto isn't just a trading game or a gamble, and people who claim to hate capitalism, the government or the rich and then continue to shill for fiat are massive hypocrites.","53":"All cliche \"silver lining\" idioms\/sayings are useless and worthless.","54":"A true skeptic would not make claims about something without evidence to support their claim, even if its about China, USA or big powerhouses.","55":"[deleted by user]","56":"You can't be racist against white people.","57":"Being provocative is not a reason that you should be assaulted. If you fight back, the assaulter is in the wrong; for getting triggered over clothes or words makes you the ass","58":"Our Republic is already dead (speaking about the USA)","59":"YouTube channels getting demonetized is good","60":"Racism\/Colorism isn’t taught.","61":"If your an American you should be taking a second or even a third job. It's the patriotic thing to do.","62":"Barking at dogs isn't funny","63":"Anti-vaxxers and Pro-maskers are annoying. They demonstrate why there never will be peace in society, because people refuse to just leave others alone.","64":"[deleted by user]","65":"Europe has the most attractive woman in the world.","66":"[deleted by user]","67":"The people who died at the Astro world festival deserved what they got.","68":"We need to ban sex","69":"Luck matters less for success than people think it does","70":"I don't think Travis Scott should be cancelled","71":"I don't like the words \"gaslighting\", etc.","72":"The Hotel Transylvania trilogy is the greatest series in film, along with HT 2 being the best movie of all time","73":"Humans didn't evolve from apes, we evolved from fairies","74":"Now That Everyone Knows About Travis Scott Concerts, There's No Reason to Change Them","75":"Spanish has a better system for naming millions (and powers of millions)","76":"[deleted by user]","77":"Even though divorce laws are stupid, I think its on those in the marital contract to understand what they are signing, complaining after is just buyers remorse.","78":"We're a crowd of beta males and anytime an alpha comes and speak something different we become frightened","79":"If you - knowing the possible dangers - voluntarily choose to begin drinking alcohol, taking drugs, or smoking, then I have no sympathy whatsoever for any consequences for this","80":"Rape isn’t as bad as a lot of people make it seem","81":"[deleted by user]","82":"I like modern rap better than old school","83":"Sociopaths and those with NPD should be euthanized.","84":"[deleted by user]","85":"[deleted by user]","86":"disliking trans people is not an \"unpopular opinion\", you're just a dick","87":"Popcorn and other food have no place in a movie theater.","88":"Sex offenders are the only true \"victims\" in Anerican society: they bear the entire brunt of the political, social, economic anti-personhood machine. They have no allies or supporters. They are the only complete and utter \"others.\"","89":"[deleted by user]","90":"In a Democracy Leftists should be unstoppable considering their strategy of organizing labor and collective action.","91":"Aaron Rodgers is a hero","92":"[deleted by user]","93":"Even if a church or charity expresses political opinions openly, they still shouldn't lose their tax exempt status.","94":"Our obsession with the past and 'heritage' is pretty dumb","95":"The 1-10 Scale Is Trash Because It Assumes That 'Hot' Is Better Than Pretty\/Beautiful\/Cute","96":"[deleted by user]","97":"As stupid (and sometimes inherently dangerous) prank culture can be, unless said pranks involves serious risks of harm or physical threats\/danger, there's no need to react like a fucking self-absorbed\/entitled asshole over it. Just give the benefit of the doubt to the prankster and move the F on","98":"[deleted by user]","99":"As someone who has lived with both Metric and Imperial measuring metric actually sucks","100":"[deleted by user]","101":"\"Anti-SJWs\" are the real snowflakes","102":"What is more annoying?","103":"Calling someone a homophobe is one of the worst insults you can call someone and should be taught against","104":"The only reason the left hates Elon Musk is because he is able to relate to the common man.","105":"It is absolutely cruel and inhumane to force a gender dysphoric child to go through the wrong puberty","106":"Elon Musk is a good person and just because he made some stupid tweets doesnt make him evil","107":"I would be more than happy for handshakes to never come back","108":"One state under Israeli control is the best solution to the Israel Palestine conflict.","109":"#DefundThePolice and #ACAB are not only entirely propagandized talking points, based on anecdotal evidence. They would ruin this country (America).","110":"[deleted by user]","111":"Workplace vaccine mandates should only be implemented when necessary","112":"There's a weird stigma surrounding being into fat chicks and it needs to stop","113":"[deleted by user]","114":"There will never be enough Vegans and Vegetarians to make an actual difference.","115":"If vegans weren't allowed to tell people they're vegan no one would be vegan","116":"It is disgusting how Reddit is so hateful against Chinese people","117":"The fetishization of public transportation is not something that makes sense for Americans\/Canadians culturally and geographically speaking","118":"If you say \"Let's Go Brandon\" then you're a pussy","119":"[deleted by user]","120":"[deleted by user]","121":"Disdain for, refusing to help the weak or cognitively unskilled is ableism.","122":"Immigration is a complete fantasy issue","123":"Prosecutors should make an example out of Alec Baldwin and the producers and armorer of the movie where he murdered someone.","124":"Overly sexual women are a turn off.","125":"[deleted by user]","126":"Veganism is a perfect example of something that is morally superior but impractical in reality","127":"IMPORTANT ANNOUNCEMENT","128":"I think a lot of billionaires got to where they are by providing value to people, more than by exploiting people.","129":"I miss Donald Trump.","130":"progressive taxes arent inherently fair and regressive taxes arent inherently unfair","131":"A 15$ minimum wage would cripple the economy","132":"[deleted by user]","133":"The idea of being a conservative is illogical as every time in history, the conservatives have stopp disappeard and the new conservatives were the people who were liberals before","134":"Conservatives need to wake up and realize that most people who do work hard do not succeed in life","135":"Conservatives are the most anti family people I know . They oppose everything that would help having and maintaining a family .","136":"Us autistics should be genocided.","137":"I just fail to see how everyone bio mom\/dad should have 100% rights in raising a kid","138":"If Kyle Rittenhouse walks free, the left will have legal precedent to shoot conservatives when they riot like on Jan 6","139":"[deleted by user]","140":"[deleted by user]","141":"People who think the world and the internet was better before social media have major rose-colored glasses.","142":"[deleted by user]","143":"Airlines need to do away with the \"safety talk\" at the beginning of the flight.","144":"I prefer 'universal healthcare' but I think we need to understand people don't","145":"Just because someone has different views on sexuality doesnt make them homophobic!","146":"[deleted by user]","147":"Yes, you deserve to know about Florida's mishandling of Covid-19.","148":"there is legitimatly nothing wrong with doxxing if you're the one leaving traces of where you live","149":"Both sides are wrong when it comes to sexualization in media","150":"[deleted by user]","151":"There is just no way to fix the rise in 'incel' except for people to either give up their freedoms or to get people ton learn to accept that sometimes you can't get what you want","152":"[deleted by user]","153":"People are being way too sympathetic towards Alec Baldwin","154":"\"False accusations are a problem that is more common than people think.\" is not an unpopular opinion.","155":"Scientist Arent Doing Anything To Counteract Climate Change","156":"[deleted by user]","157":"The current labor shortage situation is proof we don't need unions anymore","158":"Accident or not Alec Baldwin should be charged and go to prison for manslaughter.","159":"[deleted by user]","160":"Alex Baldwin should be blamed for the killing, and he is a hypocrite.","161":"Tupac Shakur was and is worse than Cardi B","162":"Getting a girlfriend is not difficult. Like at all. I think if a guy can't get a girlfriend in 2021, he must have something wrong with him (unrelated to looks or superficial stuff) like serious inability to talk to people or something like that. If they fix that, they can get a girlfriend easily.","163":"I'd be willing to live under a totalitarian government if it meant ending the culture war","164":"I am not gonna make a personal medical decision because you feel like i have a \"duty\" to protect you","165":"Just because something is the status quo for a long time in a country, doesn't mean it has to continue.","166":"Here is my version of \"The Republic\" and what it means to me","167":"The US should allow trade with China, but US labor laws and regulations should allow apply","168":"I don't understand why anyone would WANT to own a gun","169":"Jen Psaki is the best White House Press Secretary America has had in a long time","170":"I don't like people that don't work out.","171":"If men aren't entitled to sex, then women aren't entitled to help from strangers.","172":"[deleted by user]","173":"I am in support of legal abortion the same way I am in support of castle doctrine type of laws","174":"Weird pizza toppings are good","175":"People with kids have no right to complain about being poor","176":"Either all public education should be privatized or all public education curriculum should be put to vote by local parents","177":"Most (Political) (gradual or not) changes will not make society collapse as societies will simply adapt.","178":"The Rock is very cringey when he says “Brother”","179":"Do we really need living wage. Crospost I didn't want to retype","180":"This sub is just a place for you to say your racist, anti-feminist, homophobic or otherwise immoral or ableist view and hide it under the facade of an unpopular opinion.","181":"Joe Biden and Donald Trump are both bullies","182":"The jab should be a personal choice, just like abortion","183":"In university, conservative students are far lazier than liberal students","184":"I don't get why so many people hate street preachers","185":"Eating food like cereal that isn’t meant to be cereal is delicious and shouldn’t be looked down upon since it’s not “cereal”","186":"Watching \"straight\" porn makes you bisexual","187":"[deleted by user]","188":"If your response to someone's post about their female loved one dying from suicide or a news report or a woman sharing their suicide attempt is \"Oh but male suicide rates are higher than women\", you're an asshole.","189":"Colin Powell should not be allowed to have a funeral","190":"[deleted by user]","191":"Sexual and speech freedoms is the height of a good civilization, and supporting one should be in support of the other","192":"Stop harassing people on here of you don't agree with their views or if they hold a different opinion","193":"Women who have a height requirement for men are acting completely reasonable","194":"Conservatives who say major in STEM in college if you don’t want to go to debt probably never studied STEM themselves","195":"bill maher is a bully and his show should be cancelled","196":"My problem with fat shaming","197":"Most of the people that are upset about wealth inequality in the US are just coddled young adults that grew up in middle to upper class households and are upset that they cant live the same lifestyle as single adults with zero working or life experience.","198":"American conservatives have a victim complex","199":"[deleted by user]"},"author":{"0":"Unsinkable_White","1":"broji04","2":null,"3":"AdEasy819","4":null,"5":"TovMod","6":null,"7":"Electrical-Ad-9797","8":null,"9":null,"10":"xredrumx5150","11":null,"12":null,"13":"Brawl-On3","14":null,"15":"bishoes","16":"Hope1995x","17":"BlueViper20","18":"Beginning_Prune_4018","19":null,"20":"broji04","21":"jessifromindia","22":"lemonmoraine","23":"DaveGary16","24":"Andalib_Odulate","25":"RollClear","26":null,"27":null,"28":null,"29":"finnjakefionnacake","30":"Believer109","31":"Vasuki44","32":"SarenSabertooth","33":null,"34":"RandomDude1483","35":"RAIdicalFetus","36":"WaterDemonPhoenix","37":"MentallyIrregular","38":"AntSilent9296","39":null,"40":"spiritofburgos","41":"Experiment_93711b","42":"Glad-Can-8290","43":"Willing-Delay9441","44":null,"45":null,"46":null,"47":null,"48":"PapaPupuPeepee","49":"Northern5","50":null,"51":"Dan6erbond","52":"Dan6erbond","53":null,"54":"donotholdyourbreath","55":null,"56":"Serious-Cucumber-54","57":"WaterDemonPhoenix","58":"freyasunshine","59":"BlockOfDiamond","60":"Glad-Can-8290","61":null,"62":"gylz","63":"kangchad","64":null,"65":"Andalib_Odulate","66":null,"67":null,"68":"Willing-Delay9441","69":"vcarp","70":null,"71":"MimiKal","72":"bricknermonfan","73":"obvioussilly","74":"frazzllerrazz","75":"Scribbles_","76":null,"77":"WaterDemonPhoenix","78":null,"79":"Ilp771","80":null,"81":null,"82":null,"83":null,"84":null,"85":null,"86":"permittheclod","87":"mickfly718","88":null,"89":null,"90":null,"91":null,"92":null,"93":"broji04","94":"WaterDemonPhoenix","95":"EverySavings","96":null,"97":"Cookiecuttermaxy","98":null,"99":"ChampionK449","100":null,"101":"Truth_Speaker_1","102":null,"103":"Optimal_Unit_2735","104":"Sw3aty-Tryhard","105":"Terpomo11","106":"elpoopenator","107":null,"108":null,"109":null,"110":null,"111":"theinspector5","112":"SNAILSLIVEONJUPITER","113":null,"114":null,"115":"digmydirtloser","116":"ComprehensiveFeed56","117":"Cookiecuttermaxy","118":"TheThotSlayer001","119":null,"120":null,"121":"filrabat","122":"AvgArtist","123":"Believer109","124":"digmydirtloser","125":null,"126":"digmydirtloser","127":"Ilp771","128":"Okmanl","129":null,"130":null,"131":"Aviator1116","132":null,"133":null,"134":"ComprehensiveFeed56","135":"FDMGROUPORNAH","136":"Kelekona","137":"WaterDemonPhoenix","138":"Magnetic__panda","139":null,"140":null,"141":"InnocentPerv93","142":null,"143":"Believer109","144":"donotholdyourbreath","145":"DevilSlxyer","146":null,"147":"ModsRCorrupt","148":"Math_denier","149":null,"150":null,"151":"WaterDemonPhoenix","152":null,"153":"CurrentMagazine1596","154":"catsinbananahats","155":"deathbypepe","156":null,"157":"MentallyIrregular","158":"Believer109","159":null,"160":"Salrit","161":"catsinbananahats","162":"xtalaphextwin","163":"TheThotSlayer001","164":null,"165":"donotholdyourbreath","166":"Collective1985","167":null,"168":"finnjakefionnacake","169":"ModsRCorrupt","170":"OhNo_StepBro","171":"ilovekittens985","172":null,"173":"WaterDemonPhoenix","174":"Confused_crustacean","175":"____DEEK____","176":"WaterDemonPhoenix","177":"WaterDemonPhoenix","178":"idkmanidk121","179":"IPodman12","180":"AydenRodriguez","181":"AvgArtist","182":null,"183":"Present_Ad2140","184":"theinspector5","185":"turtlezaregood","186":"redditafgs","187":null,"188":"BecuzMDsaid","189":"BornLearningDisabled","190":null,"191":"WaterDemonPhoenix","192":"PopRevolutionary1475","193":"MysteriousExam01","194":"Present_Ad2140","195":"herequeerandgreat","196":"vcarp","197":"idrinkapplejuice42","198":"skwhirll","199":null},"created_utc":{"0":1637514451.0,"1":1637511579.0,"2":1637507774.0,"3":1637497194.0,"4":1637492114.0,"5":1637483076.0,"6":1637469581.0,"7":1637467878.0,"8":1637463670.0,"9":1637426747.0,"10":1637424708.0,"11":1637400758.0,"12":1637399364.0,"13":1637386481.0,"14":1637384168.0,"15":1637375129.0,"16":1637370058.0,"17":1637352881.0,"18":1637337500.0,"19":1637310673.0,"20":1637290796.0,"21":1637246787.0,"22":1637174304.0,"23":1637172618.0,"24":1637167253.0,"25":1637163880.0,"26":1637163397.0,"27":1637103053.0,"28":1637064799.0,"29":1637014635.0,"30":1637003612.0,"31":1637001060.0,"32":1636994083.0,"33":1636937713.0,"34":1636936099.0,"35":1636923702.0,"36":1636920581.0,"37":1636911802.0,"38":1636840710.0,"39":1636839698.0,"40":1636839035.0,"41":1636836406.0,"42":1636831171.0,"43":1636827433.0,"44":1636791426.0,"45":1636768238.0,"46":1636756097.0,"47":1636755067.0,"48":1636754785.0,"49":1636738833.0,"50":1636725434.0,"51":1636705838.0,"52":1636705807.0,"53":1636688994.0,"54":1636686046.0,"55":1636677541.0,"56":1636668042.0,"57":1636661122.0,"58":1636657008.0,"59":1636614179.0,"60":1636601934.0,"61":1636590489.0,"62":1636565138.0,"63":1636543905.0,"64":1636528804.0,"65":1636511456.0,"66":1636503518.0,"67":1636493900.0,"68":1636473913.0,"69":1636422946.0,"70":1636421101.0,"71":1636418085.0,"72":1636406740.0,"73":1636336261.0,"74":1636321173.0,"75":1636312527.0,"76":1636306286.0,"77":1636299333.0,"78":1636297135.0,"79":1636270376.0,"80":1636269870.0,"81":1636246441.0,"82":1636240193.0,"83":1636238519.0,"84":1636223718.0,"85":1636220009.0,"86":1636218595.0,"87":1636212380.0,"88":1636196860.0,"89":1636177785.0,"90":1636153111.0,"91":1636138017.0,"92":1636132275.0,"93":1636088202.0,"94":1636086547.0,"95":1636053912.0,"96":1636042206.0,"97":1636033592.0,"98":1635962341.0,"99":1635943235.0,"100":1635930026.0,"101":1635927265.0,"102":1635921199.0,"103":1635914236.0,"104":1635892121.0,"105":1635877035.0,"106":1635865429.0,"107":1635844351.0,"108":1635827484.0,"109":1635821208.0,"110":1635818836.0,"111":1635805873.0,"112":1635779794.0,"113":1635772154.0,"114":1635765147.0,"115":1635761214.0,"116":1635750050.0,"117":1635749543.0,"118":1635718893.0,"119":1635712924.0,"120":1635701817.0,"121":1635691596.0,"122":1635639675.0,"123":1635603630.0,"124":1635594200.0,"125":1635591473.0,"126":1635590274.0,"127":1635579030.0,"128":1635562385.0,"129":1635537312.0,"130":1635534780.0,"131":1635530570.0,"132":1635529569.0,"133":1635504501.0,"134":1635487410.0,"135":1635430899.0,"136":1635385219.0,"137":1635367024.0,"138":1635315568.0,"139":1635303929.0,"140":1635301667.0,"141":1635295435.0,"142":1635278931.0,"143":1635273516.0,"144":1635262831.0,"145":1635214435.0,"146":1635201538.0,"147":1635171888.0,"148":1635144626.0,"149":1635123227.0,"150":1635118791.0,"151":1635052221.0,"152":1635037601.0,"153":1635025507.0,"154":1635003957.0,"155":1634995076.0,"156":1634994442.0,"157":1634993745.0,"158":1634985345.0,"159":1634975943.0,"160":1634959135.0,"161":1634941180.0,"162":1634925087.0,"163":1634903458.0,"164":1634892534.0,"165":1634876092.0,"166":1634853427.0,"167":1634845290.0,"168":1634740515.0,"169":1634736444.0,"170":1634734697.0,"171":1634711071.0,"172":1634707060.0,"173":1634703851.0,"174":1634703100.0,"175":1634698685.0,"176":1634677007.0,"177":1634676516.0,"178":1634663804.0,"179":1634659083.0,"180":1634627112.0,"181":1634603016.0,"182":1634602765.0,"183":1634596383.0,"184":1634596325.0,"185":1634596068.0,"186":1634589809.0,"187":1634586795.0,"188":1634583144.0,"189":1634576436.0,"190":1634575191.0,"191":1634567366.0,"192":1634566873.0,"193":1634565373.0,"194":1634518488.0,"195":1634514408.0,"196":1634510433.0,"197":1634503532.0,"198":1634473797.0,"199":1634462045.0},"score":{"0":4,"1":13,"2":1,"3":8,"4":4,"5":6,"6":0,"7":0,"8":0,"9":1,"10":11,"11":3,"12":0,"13":2,"14":12,"15":21,"16":0,"17":9,"18":3,"19":6,"20":23,"21":0,"22":2,"23":0,"24":0,"25":0,"26":0,"27":0,"28":6,"29":21,"30":0,"31":0,"32":0,"33":0,"34":2,"35":0,"36":9,"37":0,"38":8,"39":0,"40":6,"41":3,"42":1,"43":0,"44":0,"45":0,"46":0,"47":0,"48":7,"49":4,"50":8,"51":0,"52":8,"53":0,"54":0,"55":0,"56":0,"57":5,"58":6,"59":0,"60":0,"61":0,"62":3,"63":4,"64":2,"65":1,"66":0,"67":0,"68":154,"69":0,"70":0,"71":0,"72":4,"73":10,"74":0,"75":5,"76":0,"77":15,"78":0,"79":17,"80":0,"81":1,"82":7,"83":0,"84":6,"85":11,"86":158,"87":2,"88":0,"89":0,"90":0,"91":0,"92":8,"93":8,"94":8,"95":0,"96":1,"97":9,"98":5,"99":14,"100":0,"101":16,"102":4,"103":0,"104":0,"105":13,"106":4,"107":23,"108":3,"109":1,"110":2,"111":5,"112":20,"113":0,"114":7,"115":105,"116":0,"117":4,"118":0,"119":0,"120":1,"121":11,"122":11,"123":13,"124":22,"125":4,"126":5,"127":23,"128":2,"129":140,"130":2,"131":0,"132":0,"133":0,"134":15,"135":9,"136":3,"137":1,"138":0,"139":0,"140":0,"141":12,"142":0,"143":0,"144":6,"145":3,"146":16,"147":0,"148":0,"149":4,"150":0,"151":4,"152":1,"153":5,"154":10,"155":0,"156":0,"157":0,"158":12,"159":0,"160":0,"161":1,"162":3,"163":3,"164":0,"165":5,"166":2,"167":0,"168":0,"169":0,"170":10,"171":0,"172":0,"173":16,"174":0,"175":0,"176":0,"177":8,"178":5,"179":6,"180":17,"181":12,"182":5,"183":0,"184":0,"185":3,"186":0,"187":0,"188":25,"189":0,"190":1,"191":12,"192":13,"193":18,"194":1,"195":0,"196":0,"197":22,"198":18,"199":0},"upvote_ratio":{"0":0.58,"1":0.7,"2":0.55,"3":0.64,"4":0.67,"5":0.67,"6":0.5,"7":0.5,"8":0.24,"9":0.6,"10":0.66,"11":0.6,"12":0.39,"13":0.58,"14":0.63,"15":0.62,"16":0.5,"17":0.61,"18":0.56,"19":0.61,"20":0.63,"21":0.46,"22":0.56,"23":0.38,"24":0.36,"25":0.5,"26":0.41,"27":0.38,"28":0.56,"29":0.62,"30":0.5,"31":0.27,"32":0.43,"33":0.38,"34":0.55,"35":0.38,"36":0.64,"37":0.42,"38":0.64,"39":0.46,"40":0.67,"41":0.64,"42":0.52,"43":0.42,"44":0.36,"45":0.31,"46":0.25,"47":0.33,"48":0.61,"49":0.7,"50":0.64,"51":0.31,"52":0.65,"53":0.4,"54":0.44,"55":0.42,"56":0.26,"57":0.67,"58":0.64,"59":0.5,"60":0.33,"61":0.35,"62":0.61,"63":0.55,"64":0.52,"65":0.52,"66":0.29,"67":0.36,"68":0.67,"69":0.42,"70":0.47,"71":0.36,"72":0.62,"73":0.64,"74":0.38,"75":0.67,"76":0.5,"77":0.67,"78":0.44,"79":0.63,"80":0.2,"81":0.67,"82":0.69,"83":0.2,"84":0.61,"85":0.68,"86":0.6,"87":0.55,"88":0.5,"89":0.47,"90":0.4,"91":0.45,"92":0.6,"93":0.65,"94":0.61,"95":0.33,"96":0.6,"97":0.63,"98":0.54,"99":0.59,"100":0.41,"101":0.57,"102":0.7,"103":0.5,"104":0.32,"105":0.57,"106":0.55,"107":0.67,"108":0.55,"109":0.67,"110":0.56,"111":0.58,"112":0.69,"113":0.45,"114":0.6,"115":0.67,"116":0.33,"117":0.55,"118":0.47,"119":0.4,"120":0.53,"121":0.66,"122":0.6,"123":0.66,"124":0.64,"125":0.61,"126":0.55,"127":0.67,"128":0.53,"129":0.66,"130":0.58,"131":0.45,"132":0.4,"133":0.28,"134":0.58,"135":0.55,"136":0.6,"137":0.54,"138":0.25,"139":0.5,"140":0.38,"141":0.68,"142":0.48,"143":0.29,"144":0.65,"145":0.67,"146":0.68,"147":0.33,"148":0.19,"149":0.62,"150":0.44,"151":0.63,"152":0.53,"153":0.54,"154":0.64,"155":0.31,"156":0.38,"157":0.46,"158":0.61,"159":0.35,"160":0.38,"161":0.57,"162":0.53,"163":0.54,"164":0.43,"165":0.62,"166":0.63,"167":0.29,"168":0.37,"169":0.43,"170":0.68,"171":0.5,"172":0.44,"173":0.69,"174":0.5,"175":0.44,"176":0.17,"177":0.67,"178":0.67,"179":0.64,"180":0.61,"181":0.68,"182":0.56,"183":0.36,"184":0.35,"185":0.58,"186":0.22,"187":0.25,"188":0.65,"189":0.26,"190":0.52,"191":0.7,"192":0.65,"193":0.69,"194":0.51,"195":0.5,"196":0.44,"197":0.6,"198":0.58,"199":0.26},"num_comments":{"0":28,"1":48,"2":10,"3":9,"4":5,"5":5,"6":7,"7":67,"8":120,"9":5,"10":37,"11":8,"12":46,"13":8,"14":24,"15":87,"16":18,"17":48,"18":17,"19":9,"20":20,"21":18,"22":13,"23":25,"24":19,"25":20,"26":10,"27":19,"28":33,"29":125,"30":81,"31":274,"32":50,"33":5,"34":17,"35":10,"36":16,"37":9,"38":13,"39":8,"40":12,"41":8,"42":8,"43":9,"44":22,"45":14,"46":7,"47":45,"48":28,"49":8,"50":16,"51":6,"52":19,"53":5,"54":21,"55":12,"56":86,"57":22,"58":41,"59":10,"60":16,"61":17,"62":14,"63":138,"64":29,"65":7,"66":11,"67":34,"68":144,"69":18,"70":8,"71":15,"72":9,"73":12,"74":7,"75":8,"76":21,"77":9,"78":42,"79":41,"80":5,"81":8,"82":13,"83":6,"84":9,"85":6,"86":86,"87":14,"88":39,"89":20,"90":15,"91":95,"92":51,"93":22,"94":20,"95":31,"96":7,"97":8,"98":56,"99":171,"100":38,"101":46,"102":5,"103":5,"104":32,"105":97,"106":28,"107":21,"108":21,"109":5,"110":14,"111":39,"112":49,"113":15,"114":47,"115":199,"116":14,"117":38,"118":26,"119":10,"120":8,"121":22,"122":98,"123":104,"124":10,"125":43,"126":21,"127":15,"128":60,"129":299,"130":14,"131":26,"132":8,"133":13,"134":114,"135":79,"136":14,"137":5,"138":112,"139":23,"140":23,"141":14,"142":33,"143":13,"144":12,"145":10,"146":45,"147":17,"148":16,"149":39,"150":14,"151":17,"152":5,"153":33,"154":44,"155":18,"156":20,"157":18,"158":11,"159":15,"160":91,"161":22,"162":40,"163":31,"164":71,"165":9,"166":17,"167":7,"168":123,"169":14,"170":15,"171":12,"172":66,"173":29,"174":5,"175":5,"176":12,"177":29,"178":7,"179":50,"180":50,"181":24,"182":150,"183":24,"184":27,"185":15,"186":159,"187":5,"188":31,"189":15,"190":72,"191":15,"192":31,"193":17,"194":43,"195":20,"196":5,"197":83,"198":126,"199":18},"selftext":{"0":" Big Corporations, Western Governments and Governance Bodies do not care about losing money, it's about designing the society they want. Ruining \"pop culture\" is just one symptom of a larger social agenda. Furthermore, even if fans are able to \"save\" their favorite entertainment products\/IPs, it won't really matter if society at large is beyond repair.","1":"This is a less an opinion and more and observation. For how much we hear about how the system is racist and defends white supremacy. I HAVE NO IDEA WHAT THE SYSTEM IS. or for that matter how it is racist. DEFINE YOUR TERMS. Because the system seems to basically be anything you want it to be, and everything that happens is racist apparently. \n\n\n\nThis language is cultic.","2":"[removed]","3":"That narrative of “trying to stop an active shooter” is bullshit because they didn’t do anything to evacuate all the other people around them…. If Kyle really did pose a big of a threat to the area, then why would they risk a fire fight with so many innocent people around them? \n\nThis isn’t some novel concept, it’s basic common sense which literally every kid who went through the American school system had to learn. If there’s an active shooter, you run away, simple as that. \n\nHell, I am pretty sure they weren’t even expecting him to fire back given how he was running away from them…. \n\nMy guess is that once they cornered Kyle and he was forced to retaliate then Grosskreutz made up the bullshit about “trying to protect others” when he realized that now there are investigations open around what was going on and was trying to cover his own ass beyond anything else.","4":"[deleted]","5":"","6":"[removed]","7":"If you were following the Rittenhouse trial you probably saw the incident where Jesse Klein (Maserati Mike) showed up outside the courthouse with an AR and the police made him leave.  Yes I’m well aware that the legal grounds for making him leave was the 1,000 feet of a school, don’t waste your breath talking about it.  Something doesn’t have to be illegal to be creating a dangerous situation and a public nuisance.  The police identified him as a threat to public safety so they found a legal reason to make him leave, they didn’t come from the school they came from the courthouse.  They knew that Rittenhouse was instigating violence and creating a dangerous situation the night of the protest, they just didn’t care.  Rittenhouse got off because an incompetent prosecutor brought murder instead of manslaughter and because of the politics of the moment.  He will most likely lose the civil case that Huber’s family will inevitably bring and be thought off much like OJ Simpson, a bad guy that got off.","8":"","9":"[removed]","10":"First off, I know you're probably tired of Rittenhouse posts by now especially since a lot of them either aren't unpopular or even opinions. But I've had one since the trial started that fits both of those criteria. Sorry if it's already been posted.\n\nI know what you're thinking. \"You're a clown, that was the worst prosecution I've ever seen in my life, he brought up CoD, questioned his 5th amendment rights...etc\" Under normal circumstances I would agree with you, but this is probably the one exception. There was just no evidence, in a perfect world that isn't polarized and everything isn't political this case never makes it to trial. The first guy chased him and threatened to kill him, second guy assaulted him with a skateboard and the third guy was only shot AFTER he pointed his gun at Rittenhouse. That's important because the prosecution had nothing and he knew he had nothing but still had to do his job. His options were either A:Do legit nothing and just sit there, or B:Grasp at any straw he could I.E Call of duty, show the Jury how it feels to be on the other end of an AR15...etc. And I think he did a great job at grasping at straws, I mean the jury actually deliberated on it for more than a day, when I honestly thought it would take less than an hour at first. \n\nEveryone I've talked to either already knew Rittenhouse would be cleared of charges or realized it was self defense once they looked into the evidence themselves, and while most think he made some stupid fucking choices they all acknowledge that it was clearly self defense. Anyone who looks at the evidence can see it was self defense yet the Prosecutor still had to argue that it wasn't, it was unwinnable from day 1.\n\nI honestly believe that if you gave this case to any Prosecutor in America they wouldn't win it. This man was given an impossible task with a case that should have never made it to trial and he did a good job when you consider that he had next to nothing to work with.","11":"Throwaway for obvious reasons.\n\n   I want to start this by saying I understand my bias. I've been living in Texas for as long as I can remember. I was raised a Christian and I still am a Christian. My family is all Christian and I've gone to church 95% of all the Sundays I've lived, although my faith still waivers every now and then so I guess I'm not super dedicated. I've tried to separate myself from my bias as well as I can but no one's perfect. I've also considered myself a right leaning centrist If that means anything.\n\n   So on to my point. I believe that if the mothers life is not in danger then abortion should not be legal. However, abortion can be considered in cases of rape. Abortion should not be considered in cases of incest unless it wasn't consensual. Abortion should be a last resort. Those are my thoughts.\n\n   I understand where people are coming from when they say that it's the mothers choice because; \"my body, my choice\". However I disagree. That lump of cells\/embryo\/first trimester\/fetus\/baby etc., Is a separate organism with its own DNA. And not just any organism. A HUMAN. No matter what you believe about a baby's consciousness, that baby will eventually become a person. So it's not \"your body\". \n\n   I feel like people are choosing to ignore this fact and are throwing aside their morals in pursuit of \"personal freedom\". Are we so bored that we're willing to kill people to find something to do?\n  \n   I feel like there's a solution we're all forgetting here. Talk. To. Some. One. That's it. Talk about your problem. If your not ready to have a baby and your condom broke or your birth control failed. Discuss it with your partner. If you can't agree on something go to a professional who can help. A doctor, Marriage\/relationship counselor, fucking gynecologist idk, dont just kill babies because it's inconvenient to you. If you can't talk to your partner because they took off or something discuss with a doctor or someone close to you that you trust. Like a parent or sibling or close friend.\n\n   If you were raped and don't think you can handle a child then discuss with a doctor, legal team, etc. Maybe you can have the child and put them up for adoption. Being in the shitty foster care system is better than not being given a chance at all.\n\n   In cases of incest that isn't rape then the proper punishment should be given to the parents of the child but abortion should still be a last resort. Custody can be given to grandparents or other family members. Adoption is still an option here too.\n\nThere are obviously an infinite amount of different circumstances that the mother of the child could be in so I'm willing to discuss in the comments, in fact I encourage it. I think we can all learn something when we stop and think instead of jumping to conclusions.\n\nI'm terrible at getting my thoughts across so I hope you understood me. Things sound great in my head and then I vomit words and hope they make sense.","12":"[removed]","13":"OMFG this is by far the worst emoji in all of history. No other one is even comparable whatsoever. Why do i think such a thing? Well, have you ever read a comment section before? You ever notice some dumb shit like a post asking \"why can't conventually attractive women stop themselves from sucking my cock?!?!?!?! And you'll see some guy in the comments be like \"ahahah OMG Yass queen i known i know right?!!! I guess we are just attractive or somethin?!?!?!🤷‍♂️🤷‍♂️🤷‍♂️🤷‍♂️🤷‍♂️🤷‍♂️🤷‍♂️ IDK😂😂😂 but it gets SO annoying!1!1!1!!\" AND THIS SHIT PISSES ME OFF. I cant even really describe it, it just seems like a douche thing to do. FUCK this emoji.","14":"He got a lot of stuff done, and I read a lot of good news about what he achieved. The list of what he did is quite long.\n\nBut he didn't finish building the wall. That was his biggest promise. So for that, I can say he was a good president, but he stops short of being great.","15":"\"If I was Elon Musk I would donate to charity\" \"if I was Jeff Bezos I wouldn't go to space, I'd hand out $1000 to everyone I saw for a day and I'd still be filthy rich\". Notice a pattern here? People hate billionaires because they think they could do better things with *their* money. They want *their* money. \n\nEven the argument about whether we should tax them more is about people wanting to control where *their* money goes.\n\nStop being bitter and envious and maybe show a little appreciation for all the times they genuinely help people through charity and donations. Who cares if it's only 0.1% of their net worth, they still just donated $10 million dollars and its more than you could ever do.","16":"I'm inspired by the trial's (Rittenhouse Edit: Not guilty) outcome to write my elected officials to create laws that will make this happen.\n\nThink of it as a volunteer law enforcement officer. You get the same training and have to complete an Academy course with a military structure.\n\nAfter successfully completing Vigilante Academy, you're allowed to stop crime and lock up scum that burns your town down. Of course, you do this within the scope of your training.","17":"There are no indications that any religion has any basis in fact or reality.  We should not be indoctrinating literal toddlers and children into believing insane fairy tales.  \n\nTeach children religious stories or of heaven and hell and what you must do to get there is wrong.   \n\nPeople should be adults and have good well formed reasoning and critical thinkings skills before being exposed to religion.","18":"Are involvements was fueling the conflict more then it was helping . In a vacuum scenario the dominant force should be the city states . So I ask how are these goat herders capable of dominating the million plus city of Kabul ? The answer Foreign power were providing weapons and money to this force. Why were foreign powers giving these weapons and money because the USA was their . Once we left the economy collapsed because both the USA and the foreign powers stoped handing out money . The government the USA had set up was incredibly corrupt. I believe now with status quo restored the city states can once again be the dominant economic force . The Taliban say they are more liberal this go around .This time maybe a democracy can spring up that is more palpable to the ruling masses , women won’t vote but maybe land owning man can . The USA goal of feminist equality was unrealistic .Unfortunately the taliban is likely here to stay because they want to rule Afghanistan Something the former Afghanistan didn’t want to do .","19":"Just, like, don't do the thing till you've gotten yours. \n\nWomen: don't have sex until you've gotten the commitment\/marriage\/a goat sacrifice that you want to be tied to sex \n\nMen: don't pay one red cent for a woman you haven't had sex with... unless you are putting the money in an envelope and sticking it on a dresser in exchange for guaranteed sex with a hotter girl\n\nTruth is that what people often call being taken advantage of is in reality a covert contract that didn't pay out, the sniveling beggardom of the weak and spineless.\n\nNo one's going to protect your interests but you. So protect them.","20":"I say this as a devout catholic, I would MUCH prefer to watch a show where I know from the outset that  main protagonist is a Muslim then watch one where they never adress the protagonist's beliefs.\n\n Our beliefs play a MASSIVE ROLE in our character and the fact that the religion of characters are now ignored to steer clear of controversy is a massive detriment to the state of modern art. It sucks that we can't have discussions on faith or religion in fiction. It's why all our modern protagonists have such generic traits of \"determination\" or \"introspective\", their values are always just \"I like freedom\" and even that is always vague as possible so we don't have to worry about our beliefs *gasp* being challenged. \n\n\nI don't care if you want your character to be agnostic Jewish Muslim Christian or atheist, tell me what they are and explore it. That's actually interesting","21":"People should just play older games as they are; with all the original graphics, controller schemes, music mix, bugs, glitches, and hiccups that were there in the first place. This way you experience the game just as everyone else did back in the day. \n\nModifying it for a new audience is a cope out for lazy audiences. Older graphics could be nostalgic for many and with the rise of the indie industry, people should be OKAY with inferior graphics. But no, we need disasters like GTA to relive 'old  memories'.\n\nTL;DR Just play the real thing.","22":"Why is nobody standing up for Sophia Urista, the singer for the cover band Brass Attack, who urinated on a fan onstage during the show closer? When I saw that video I thought \"there's hope for the young people yet.\" I am an old punk rocker and I worry that too many artists are playing it safe, conforming to the norm. I don't understand how everything I read about this event just condemns it outright. Am I the only one who finds hope and joy here?\n\nEdit: The name of the band is Brass Against. Thanks for the correction!","23":"[removed]","24":"There are 2 types of countries on earth. Monarchies and Republics.\n\nA Republic is a country without a form of monarchy.\n\nA Democracy is a form of government.\n\nYou can have a Democratic Republic like the US.\n\nYou can have a Democratic Monarchy like the UK\n\nYou can have an Authoritarian Republic like China\n\nYou can have an authoritarian Monarchy like Saudi Arabia.","25":"I'm talking about sports like tennis, golf, diving, water polo and many sports most people have never heard of. \n                                  \nFor example Tiger Woods is said to be best golfer in the world, why is that supposed to be a big deal? No one plays golf, except rich retired old men. If kids world wide grew up playing golf then Tiger Woods would not even be top 10,000 golf players.\n                             \nThey have no real competition, these sports are very expensive and it's like an ultra-luxury, that's why most of the participants are unathletic because they were bad at more popular sports so their parents enrolled them sports with a high barrier of entry. \n                                     \nIt's annoying how a lot of people in unpopular sports can be so arrogant and full of themselves such as Serena Walliams (reddit cofounder's wife) thinking she's some amazing athlete when really if she had proper competition she wouldn't even make it pro. People in these sports need to be more humble.","26":"[deleted]","27":"[removed]","28":"[removed]","29":"Seems to be a pretty unpopular opinion around here, but...\n\nhaving or including a diverse group of characters in a TV show or movie does not make it worse.\n\nWhen it comes to adapting source material, I think there is a legitimate argument to be had about changing a character's background, regardless of the reason. There is, at least, a lot of nuance when it comes to that issue. But outside of that situation, too often it seems like people talk about characters being shoehorned\/forced in, pandering, being overly PC, etc, and none of these things really track. Nor does it make a property bad (i.e., just because something isn't what you personally want to see doesn't mean it's bad). And it also implies that there is a default \"setting\" that entertainment should adhere to, although it's fiction, and personal to the creator(s).\n\nWith that said, there are plenty of movies and shows that are pretty diverse\/inclusive that are shit shows -- but that's just because they're shit movies and shows.","30":"After seeing how authoritarian the Democrat party has become it is clear they should be banned from holding elected office.\n\nAfter the midterms Congress should impeach Biden and Harris and then pass legislation banning the Democratic party. Make them start a new party instead.\n\nThis way everyone would need to re-register. Also, it would send a message that overreaching authoritarian and draconian policies that attempt to assault citizens by turning them into experimental test subjects will not go unpunished.\n\nThey can easily use the Nuremberg trials as precedent. This is not illegal, either, Congress can ban political parties.\n\nThat is my opinion. I am sure it is unpopular","31":"Now, I don't think either answer to the Rittenhouse debate is unpopular, it seems half the country is on one side, and half on the other.\n\nHowever, it's certainly quite unpopular to argue this here, so I think it nicely fits the sub, especially since I've seen the opposite cited. \n\nTo begin, one of the rules of self-defense requires a lack of inducement. Namely, that one doesn't induce the situation they're trying to claim they acted in self-defense. There's been a slew of caselaw on that topic, but the one that sticks in my mind is the case of The People v Crosbie and Meehan, where a group of youths, having had one of the group beaten up earlier, wandered the street with weapons, specifically going to the area where the violence had taken place and where those they wanted to do violence against were. This provoked the other group as they intended, a fight started, and two were killed. The Court found, quickly enough, that actively putting yourself in a situation like that, especially where one has the intent to do violence, was self-inducement, and thus, the same defense couldn't be used here.\n\nIt's not hard to see that's what happened here. We have footage of Kyle Rittenhouse only a week or two before, proclaiming how he wished he had his gun as two law-breakers fled, as he'd love to shoot them. Then, Kyle Rittenhouse would later arm himself... and head to an area like this, with what the video evidence shows is a clear intent and desire to use that weapon. \n\nIt's this fact that confirms for us that this wasn't self-defense. Nothing forced Rittenhouse to kill, he actively sought out the opportunity to do so, and thus, regardless of the lengthy debate over the footage, it can't have been self-defense.","32":"**Disclaimer:** Of course this was not popular on unpopularopinions, and I don't expect it here either, since whenever it comes to people's comfort, ethics get the ass end of the deal…\n\nMost germans didn't want to help jews during WW2 as to not make their lives more difficult and also they were promised their own financial situations would better if gotten rid of the jews. The jews suffering physically and emotionally. Your cheap KFC - animals suffer physically emotionally and you don't wanna give it up just because you don't wanna be seen as a weirdo vegan or esoteric or weak or give up your own financial gains by committing to a more expensive diet and also not give up on a comfortable situation (the torture and often stressful\/painful killings of animals for cheap delicious meat full of antibiotics and other shit that will cause you health conditions and a shorter life guaranteed). So what's the difference? Somehow if they were jewish cows, it would be less painful to have your utters bred to be overly large and full of tumors and get them milked until they are full of puss and inflamed?!\n\nThe same could be said for plant-based produce, but as far as we know plants don't suffer... so for that, it's just the Monsanto poison in your organs.All that being said, I only eat organic and I am an opportunistic vegan, meaning I don't drink cow's milk, I rarely eat (goats) cheese, and still eat fish\/meat\/eggs at times. And it doesn't make me proud, to the contrary… more so shame towards not doing better. Being fructose intolerant, it's easy to fall back on the popular conventional diet, because it offers more food options for me. I can't eat vegan processed foods… Bascially I wish people would at least admit to the reality of it all as a first step. Then be at least a little more cautious while buying and doing more for these other living beings…","33":"[removed]","34":"I never feel sleepy and there's so much I could do with an extra 8 hours of free time.\nWhy do I even force myself to do this? I have to roll around under the covers for an hour before I sleep but in the rare occasions where I don't sleep I never regret it. \n\nIt's 0.30am","35":"Music today is way better than it ever has been. \nAnd what I mean by newer music I mean by 2010s + \n\n\neverything before that to me sounds like low quality garbage. Yeah sure there's some good old songs but they just can't compare to the auto tune and robotic sound of modern music. \n\nAnd yes I love the generic common lyrics of modern music (sex money drugs etc) I just find modern music to have a much better vibe than old music.","36":"The incel community shames people for not liking them. They think that society finding them desire able is something owed to them. The woke left thinks that everyone must like them, regardless if their genitals and if you don't like their genitals, you are a bigot. It doesn't matter if its superficial. \n\nIf I say I like blondes, then that's it. I fail to see the difference between genitals and hair color honestly. Yes, hair can be dyed, so what? If someone wants to break up over hair color or changing genitals, I don't think they need to be shamed for it. \n\nSame thing with eye size, nose size. I know this is unpopular because if you say you don't like people with large noses or small eyes, I bet people will hate you. like no need to air out your preferences, but if someone finds out you aren't what you look like in your profile, they are allowed to leave. \n\nWhen certain demographics, ie Asian men or black women complain how people find them ugly, yeah, I'm sorry, but you can't change attraction. For the record, i like people in general. But its the attitude that needs changing. \n\nIts just so bizarre people think shaming will make people like you.","37":"Deer should be hunted out and only raised captive like Buffalo etc by now. All they do is get splattered on the road either way. If you don't hunt them, more get hit and fuck up cars. Old heavy cars didn't take much damage, but try hitting a deer with a smart car. The deer might walk away, but the car will be fucking totaled! I just don't see the need for it anymore. People that like deer meat should be able to pick it up at the butcher shop like other things.  \n\nHunting regulations in general are fucking stupid. You're allowed ONE buck and one doe. Shouldn't matter if you find them with a spotlight. Shouldn't matter if you shoot them with a fucking howitzer. Plain and simple.","38":"You see so many people online say looks don't matter, it is just that people only care about your personality or whatever nonsense. The reality is that looks matter a lot in the real world. People bend backwards for an attractive blonde women while ugly guys get told to eat sh*t whenever they ask or need help. Looks are everything in this world.","39":"I think the system of seniority is rather a bullshit concept to practice in lots of jobs. Just think of it, you're freshly hired and everyone you work with have one to maybe twenty years of experience than you. They're all suddenly your bosses on top of the bosses you mainly have to be concerned about.\n\nIt's nothing but a trickle down power trip between several other people and a workplace should not operate like that.","40":"I cringe whenever boys are taught that manhood is about standing on your convictions no matter what. \n\nWhat the hell happened to learning and acquiring wisdom? Do we actually believe than manhood is about being an unreasonable idiot? \n\nNow don't get me wrong: I'm leaning towards the traditional way of manhood. I believe that men should learn emotional mastery and self-control, be at top physical shape, master logical thinking, have courage, honor, valor, and accountability, have outstandingly strong mental, emotional, and spiritual strengths, have good social circles and social skills, provides discipline, leadership and inspiration, and can fight and kill when he has to. \n\nBut I also believe that a man must be enlightened and wise. A real man that has only darkness in his mind is a bull who charges everything because its eyes are completely blind. \n\nWe got to stop teaching boys that manhood is equivalent to respectable foolishness.","41":"They tell you to arm yourself by ordering law enforcement to stand down and refusing to prosecute the few rioters who get arrested or identified. And they tell you to remain anonymous by persecuting you publicly, judicially and any other way they can, even if you're the victim.\n\nRemember this when you see an increase in armed, uniformed and masked men, and the resulting violence when they're confronted by left-wing extremists.\n\nI am not advoctating this at all. It is simply an entirely predictable consequence.","42":"To give a bit of context, maybe two years ago I could consider myself right leaning as I watched people like crowder and tim pool daily - for the most part until now I agreed with a lot of what they were saying about the immigrants crossing the border and black people having to take charge of there own communities, CRT etc.\n\nBut then I realized that their opinions about these immigrants, minority groups and what the normal left was trying to do with CRT weren't based in reality, at all. They act as if combating generational poverty is as easy as snapping your fingers, that things like slavery and segregation weren't as horrible as they were and that saving up money and leaving your family behind for better opportunities is as easy as pie.\n\nHonestly I'm starting to understand why many on the left dislike conservatives the way they do - because they love to talk about issues they don't understand, and believe that everything the left is doing today is just an effort to attack white people, capitalism and destroy America (yes I've seen the instances in which they took it to far such as with the riots [you guys two with January 6th]) but that's really not the case.\n\nFor instance alot of people on the right reject the new terms that the left is using to describe discrimination like \"colorism\" because they believe that it's unesscary or just another way to control them.\n\nBut what they don't understand is that the left made the term colorism to differentiate from the term racism. Because \"racism\" is when you hate someones racial background regardless of color, while colorism is how people treat people of darker skin tone poorly regardless of race.\n\nI do think it's a bit far with the neo pronouns but not everything the left is doing is to attack you. They're assigning names to these concepts so that people can understand them and recognize it when they are doing it and when they see it. \n \n(If you’re wondering why I’m not responding to your to your comment it’s because for some reason in this subreddit I’m not allowed to reply to stuff so i’m actually not able to have a conversation with you to talk about this - Also I can’t even see some of your comments so I can’t respond to what I can’t see","43":"[removed]","44":"Without it, white people would dominate universities and jobs due to their privilege.\n\nA common argument against affirmative action is that it is essentially racist against white people. However, this argument fails to account for the fact that the playing field is *already* skewed in their favor, and the \"racism\" against them is actually just to make it fair.\n\nAffirmative action is necessary in order to achieve racial equity.","45":"[removed]","46":"[deleted]","47":"[deleted]","48":"I've seen this exact argument on Reddit at least 3 times now. Women are DUMBFOUNDED that there are men out there who just shake their dick to get the last couple drops out. And let me tell you they are vitriolic. If you shake the piss off instead of dabbing it with TP you might as well be taking a hot diarrhea shower every morning you're so disgusting.\n\nWell I've got news for you ladies, only fucking weirdos wipe the tip of their dick with TP. I've been around the block and such behavior is so aberrant that any man caught wiping his dick would be BULLIED. Not an exaggeration. It's not typical male behavior.\n\n\"That's why men are disgusting and unhygienic!\" Nah fam. You're just confused because you clearly don't understand the different cultures between the sexes. \"Well you're not the one putting it in your mouth!\" If you think my piss is what's making my dick un hygienic then wait till I tell you about the fermented gallon of sweat thats been stewing in my trousers since work. Because I can promise you that's all I smell when I take off my undies at the end of the day. Underwear get dirty. Dirty underwear are gross. Plus, I would never expect someone who isn't a degenerate to put my dirty genitals in their mouth. Are you just expecting your man's dick to be farm fresh and table ready at a moment's notice? I gotta deep clean that shit twice a day and I'll even clean it AGAIN if I know I'm gonna have sex.\n\nI've had a fair share of serious relationships, and if you guys think that a drop of piss is disgusting then how do you explain the the dumpster slop of fluids that just fall out of vaginas. You can act all high and mighty about how \"hygienic\" you are but I promise you 95% and possibly even more men than that, wouldn't waste their time, look and feel like a weirdo, and waste tp to get .05 mL of piss out of their dick.","49":"[removed]","50":"I'd like to think of myself as a progressive. I love LGBT people and can't stand homophobes, I think women's safety is very important, I think people should be able to wear whatever they want in public, etc. Of course, you might say that those aren't necessarily progressive views in the Western world, but in many parts of the world they would be considered progressive and even blasphemous.\n\nNow here's where I reach out to my fellow progressives - after all, we are generally the ones more in favour of higher rates of immigration. \n\nMany people will arrive from parts of the world where such progressive views are not tolerated. I recently saw a video of a woman in my country (the UK) getting told to cover up by an Arabic man as it offends his culture, while shopping in a supermarket (link posted below).\n\nhttps:\/\/www.google.com\/amp\/s\/www.mirror.co.uk\/news\/uk-news\/asda-worker-tried-kick-woman-25430343.amp\n\nNow my point is, I've noticed many progressives happily calling out such behaviour from homegrown citizens, but seem to turn a blind eye to behaviour from those originating from other parts of the world. I'm not saying we should be calling those people out specifically, I'm saying that if we don't recognise that such a culture clash can occur, we may see ourselves losing our relatively progressive society.\n\nI don't have a specific solution, but the first step is surely recognising the problem (and this isn't a swipe at immigrants, it's simply an observation of such culture clashes which of course may well happen when different cultures mix).","51":"Okay, so this thread is going to be full of technical facts, and it will be my attempt to educate some people in the mainstream space why they shouldn't *completely* dismiss crypto as a scam, or a ponzi-scheme.\n\nI firmly believe that the technology behind crypto, and many popular projects have already built infrastructure and systems that have significant value, the same way the internet has value or gaming items do. You may or may not believe that the entire world can change its ways and move to crypto, but at the very least after this you hopefully will agree that crypto has its place in creating a more open alternative to some systems.\n\nSince I'm invested in crypto myself, I want to make it very clear that if I mention any specific crypto projects, it isn't financial advice, nor are positive or negative mentions a reason to invest in them. Do your own research if you do want to invest into crypto, but any coins or tokens that get mentioned will simply be in this thread with the purpose of providing an example.\n\nMy goal here is to educate on the premise of how blockchains and crypto work, so that people understand, besides the millions of scams that do exist, there are great projects working on great things, and maybe some of you might be inclined to try out some projects without even expecting any gains!\n\n**So first of all, what are blockchains?**\n\nBlockchains are simply distributed ledgers and computing systems. Now those are two fancy words that essentially mean they are systems, spread across the globe, running on many computers and servers, that track data, as well as allow their users to perform any tasks defined within their specifications. This can be as simple as adding two numbers, or handling a *smart contract* that only pays out insurance money if certain requirements are met. We'll get back to these later.\n\nThe benefit of having all the data, and code, running on a distributed system, is that everything is transparent. This doesn't always mean that I can read how much of a certain crypto got sent or received from each wallet, but the code can verify that you're allowed to perform certain transactions, and this is done by multiple people to ensure that trust doesn't need to really exist, since a large portion of people running and validating the network need to agree. This makes blockchains trustless.\n\n**How does crypto play into this?**\n\nCryptocurrencies are coins or tokens built on top of blockchains. It's very important to understand the difference between a cryptocoin, and a cryptotoken.\n\nEach blockchain needs a way to incentivize those distributed computers and servers I mentioned. Since they're running the computational tasks, and storing all the data on the ledger, they get paid in a cryptocoin. For the Bitcoin network this is BTC, for Ethereum it's ETH, etc. Those fees are usually paid when a transaction is ran on the network, so i.e. if I send from my wallet to yours some ETH, then a transaction fee must be paid and a part of which gets paid to the miners that enabled this transaction to go through, the rest of the transaction fee is destroyed, making ETH deflationary in this case.\n\nThere's a lot more that can go into the economics of a cryptocoin, or token. Some of it I might bring up later. In any case, now to the tokens.\n\nTokens are representations of real-world assets, or completely digital assets, built on top of a blockchain. As they aren't used to pay transaction fees, and aren't built natively on the blockchain they reside on, we call them tokens instead of coins. This could even be something like a house deed, or the ownership certificate of a vehicle, etc. These tokens don't even need to only exist on one blockchain. They can be coded to exist on multiple, such as Solana, Ethereum and Cardano.\n\nNow, not all blockchains make it possible to create a token on their network. Each blockchain has its own approach, often giving the creator of a token a reason to pick one or the other blockchain for their project.\n\n**How can tokens help us?**\n\nWell, a big use-case I see in blockchain technology right now is the use of tokens, which is why it's getting a dedicated section. As I mentioned, tokens are just assets, either representing something in the real-world, or entirely digital. I can tokenize my house deed, as I mentioned, or generate a bunch of even tickets with the right blockchain. Then sell the whole thing digitally, in a trustless and low-fee manner compared to traditional centralized systems.\n\nThose are just some examples I wanted to quickly mention on how tokens can actually have real-world use. On top of that, think about the games we play. LoL accounts, among others, can be sold for thousands of dollars because of the items they possess. Now, some might call it a bubble, or simply dumb, but it shows, that we humans are capable of attributing arbitrary value, to the oddest of things. The same can be seen in certain artwork (IMO, but those buying the art probably see it in a very different light) and playing cards for soccer\/football or Pokémon.\n\nAll those, more playful, systems, can be tokenized and gamified on blockchain as well. I can write a smart contract that generates a very specific set of cards, which are used in a PvP game, and the better a card's attributes are, the higher likelihood it has in winning a tournament. That's a very basic, and general example of what I'm trying to explain, but hopefully it makes sense.\n\n**What are smart contracts?**\n\nSmart contracts are what really make blockchains as capable as they are today, IMHO. A very straightforward explanation is that a smart contract is some code, that only does something when certain parameters are met. That's why it's called a smart contract, because it only executes its main task, after the contract is signed so to speak. Depending on the blockchain you're working on, smart contracts will have different capabilities, but there are some crazy use-cases for them that I bet some of you will find interesting.\n\nThis is where we get a bit more technical. To really understand how great a smart contract can be, you need to know that this code gets deployed on a blockchain by whoever created it, and gets a wallet address of its own just like you or I would on which it can accept transactions or even send them. This means smart contracts can interact with the crptocoins and tokens I mentioned earlier. A smart contract can also keep track of data, kind of like an Excel sheet on the blockchain, that is fully transparent and open. It's trustless, like I said, because you can view the code before interacting with it, to ensure that it truly will do what its creator claims it should.\n\nBecause smart contracts have the capabilities I mentioned above, they can be used to validate the authenticity of certain assets. As I mentioned above, those gaming cards would be created by a smart contract, and since the smart contract only does exactly what it's told to do, people can verify that the card is real, by checking if its original creator was the smart contract that runs the game.\n\nOn top of that, smart contracts can be used for more than just games. They can be used for voting, open and publicly ran insurances, decentralized autonomous organizations (DAOs), liquidity and swapping protocols, lending protocols, etc.\n\nAll those get even more technical. A decentralized autonomous organization, is exactly what it sounds like. A company that doesn't have a CEO, or anyone running its operations. Everything that happens in that company is executed via code. If the smart contract is supposed to change, to e.g. support new features or use-cases, then people would first have to vote on it. The voting systems are always different as well, but a popular example is MakerDAO, which created its own token that people can hold to get voting rights. So essentially anyone can make business decisions by holding the token. This is a popular approach in crypto governance in general.\n\nLiquidity, swapping and lending protocols have to do with DeFi. DeFi stands for decentralized finance, and is a whole new world of taking over the tasks from traditional banks, and putting them on the blockchain. Instead of earning interest through the middleman, who takes a cut, you add your liquidity to a liquidity pool on the blockchain, and make far higher returns. This can even be done with stablecoins, which are essentially coins or tokens pegged to a fiat currency value, so you don't have to worry about the volatility of crypto.\n\nSwapping protocols allow people to trade between currencies without a middleman as well. Instead of a centralized exchange buying millions of crypto so that they have the liquidity when you want to buy it, a DEX (decentralized exchange) will use smart contracts to have the community pool this liquidity, and anyone that adds liquidity, just like with the above mentioned lending protocols, makes a good amount of fees for the risk and effort. I must add that the risk is usually extremely low with well-established DEXes.\n\nI could go on about crypto all day. But the last two things I want to mention, is that crypto really could help some third-world countries, but even first-world countries in a meaningful way. The Cardano developers have been partnering with African nations to introduce better ways in tracking education data, voting turnouts, etc. using blockchain. These systems will be somewhat closed, as they probably will be ran by the government, but they will be leveraging the same blockchain technology we see here in the public system.\n\nOn top of that, there are blockchain projects working on early implementations of UBI. If we can ensure that everyone only signs up to said blockchain once, then we can pay out a certain basic income rate which is something some first-world countries direly need in this time of automation.\n\n**Touching on the Metaverse.**\n\nI just want to make a quick note on the Metaverse, as recently it has been a controversial topic with Facebook's rebranding and the parabolic price action of related cryptocurrencies. I think it's interesting, and again, just like traditional games are able to put certain value on items, the Metaverse wants to build a decentralized digital world. So whether you like it or not is up to you, but it's kind of like playing VRChat on steroids. Along with the financial incentives, people are just going to do what they can to get in early. So maybe it's something for you!\n\n**Wrapping up.**\n\nI will admit, blockchain tech, and crypto, still has a long ways to go as of right now. There are some great projects out there building on some awesome ideas, but it's worth nothing that Ethereum still runs on PoW, which uses a fair bit of energy. Luckily, most modern blockchains use PoS, which doesn't, and Ethereum 2.0 will be migrating to it. There are other concerns, such as interoperability, and centralization, that will need to be addressed by projects, to bring crypto into the mainstream. But I think it's worth keeping this technology on your radar, as it might just have the same effect that the internet did to bring knowledge, media and many more opportunities to a wider mass.\n\nThat's all for my explanation on cryptocurrencies. I've written a previous thread going over some of the [myths about blockchain technology and crypto](https:\/\/www.reddit.com\/r\/TrueUnpopularOpinion\/comments\/qs6v2b\/crypto_isnt_just_a_trading_game_or_a_gamble_and\/), if you guys are interested. My approach has always been to try and educate people. I don't want to change your minds, if everything I wrote here still has you convinced that crypto isn't for you, that's okay. But I hope everyone makes an informed decision, instead of following influencers and politicians, since they always have a stake, that will go against most of us here.","52":"This post is definitely inspired by a recent argument on Reddit. But as a software engineer with an interest in crypto and where it's headed, I'm just incredibly bothered by the misinformation being spread by people that seem to just be throwing a tantrum that they couldn't invest into BTC when it wasn't worth anything. Then there's also people who like to talk about shit that they don't know jack about. It really is the embodiment of the \"I don't know shit about fuck,\" meme combined with some \"If those kids could read they would be very angry.\"\n\nTo address some of the points made by people against crypto.\n\n***\"Oh but crypto just puts power and control into a different hand, instead of the government.\"***\n\nYes, **you**. Literally you control crypto, its value and the fluctuations, market circulation by using it. Crypto is entirely open. You can go read the code that you run on your own computer to join the blockchain network to make sure that no foul code has been added to break the system. Literally thousands of people do so on a daily basis which is what makes it so secure.\n\nGovernments have no safeguards or checks to ensure that they actually operate in our interests. [Inflation during the pandemic was five percent because governments care more about short-term economic revival than long-term sustainability.](https:\/\/www.rochester.edu\/newscenter\/what-is-inflation-is-there-economic-crisis-485642\/)\n\nBlockchains for larger cryptocurrencies such as the Bitcoin network run on millions of machines already. For a hacker to steal or add money they would need to affect at least 50% of every node in this setup. With traditional banks and currencies we're giving institutions and governments a ton of say in our own holdings and essentially providing them with ownership unless you're holding a physical asset like gold or an estate.\n\n***\"Crypto will make it easier for rich people to get even richer, and conduct shady business.\"***\n\nAs I alluded to earlier, cryptocurrencies run on blockchains that are held by millions of people on the world. Joining the network is easy, and you can take a look at the ledger of BTC, SOL, XMR, ETH, etc. easily to see what the movements look like.\n\nDuring the COVID-19 pandemic a lot of millionaires and billionaires made their riches by transferring their assets to safer investments knowing that the economy would be hit hard during this time. In a world running on crypto it would be impossible to hide such large movements, and one could even create bots to use this transparency to monitor the global financial market in a way that evens the playing field for people that aren't connected to those circles.\n\nNot to mention, while crypto can be anonymous, most of them aren't and it isn't hidden behind any locked doors. It's incredibly easy to find out who the owner of most crypto-wallets are. There are only a few exceptions of privacy oriented wallets such as XMR but those have a different use-case that is by far less shady than what we currently have with financial institutions such as banks and investment firms.\n\n***\"Crypto is a scam! I've seen countless breaches and ponzi schemes.\"***\n\nScams exist right now, too. All it takes is a shitty website disguised as a bank or online retailer to get your account information and steal thousands of dollars. This happens pretty much every minute to thousands of people across the globe. Crypto is no different. In fact, I'd argue that people who take crypto seriously, inform themselves before getting into it also get better at IT security and protecting their passwords, accounts, and files, due to the slightly steeper learning curve for getting into crypto compared to other assets and its technical nature.\n\n***\"Crypto will enable the rich to get richer and further increase the wealth gap.\"***\n\nThe rich are already way ahead of us. But crypto doesn't make this worse, and if anything this sounds like an argument to invest IMHO. I'm not saying anyone should buy crypto, that's not the point of this post at all. But it's just not an issue that crypto is creating or making worse, even. It's a different asset to invest in, and thanks to its transparency at least we can monitor large wallets to understand what the wealthy people are doing if we're so convinced that they know something we don't. With traditional assets you have no idea whatsoever about what's going on and who is preparing for the next doomsday.\n\n***\"Crypto is bad for the environment, and takes away clean energy that could be used elsewhere.\"***\n\nThis would have been true at the start of the crypto and in particular, Bitcoin, mining phase. People were spending insane amounts of money on mining farms, GPUs, wasting energy and such, but things have changed.\n\nFirst of all, [Bitcoin mining, while still a thing, is running on nearly 60% green energy, a number that's only increasing.](https:\/\/www.livemint.com\/market\/cryptocurrency\/use-of-green-energy-in-bitcoin-mining-jumped-to-56-in-june-quarter-report-11625212165534.html) That makes it one of the main industries that primarily relies on clean power sources and is on a trajectory of becoming carbon neutral, while many other applications that waste a lot more power are still stuck on coal and nuclear energy. Not only that, Bitcoin mining actually gets most of its energy from excess produced in countries such as Iceland which means no one is being denied renewable energy since no one actually seems to care to use it except miners.\n\nSecond point. Bitcoin mining is one of the few wasteful consensus strategies still being used at a larger scale. Other, more modern currencies, such as SOL, XMR, ETH, DOT, etc. use proof of stake mechanisms to validate transactions, which can be ran with very little energy and actually still are profitable for retail investors. Bitcoin mining is only profitable if you run ASICS in a large server farm and have cheap energy and infrastructure fees.\n\nThere are cryptos that still run on proof of work validation mechanisms, or even some more exotic file-based ones that ruin hard drives. But as someone that invests into crypto with the future in mind, I doubt that people will be taking those seriously for the long-term when they're already released with a disadvantage to their core systems.\n\n***\"Crypto is only used for investing and trading, it will never be a real currency.\"***\n\nThat's literally your fault, though. If you buy crypto just to hodl it for a year and leave, then you're part of the problem. There's evidence that wallets made within the previous 90 days will quickly sell when the crypto market starts dipping. Any wallets that exist longer than that seem to hold on to their assets for ages because they genuinely believe in crypto being the next big thing.\n\nI know of far more people that see crypto as a currency they want to use in the future as a proper replacement for fiat. Stores online already offer incentives for using BTC, Tesla even accepts it as a payment method, while Twitter is adding it for their rewards scheme. Even Reddit now has a token on the Ethereum network to handle their premium memberships and community rewards. Check out the Reddit vault if you haven't yet. For mobile users it's in the side menu below your settings and profile menu options. The underlying blockchain technology used by crypto can be used for even more decentralized apps, such as content sharing networks, Solana already has dapps designed for artists, while DAAG is working on their decentralized stock exchange network on Solana as well, and the potential is nearly limitless.\n\nSo yeah, as I said. I don't want anyone to use this post as an incentive to buy crypto. I'm not saying you should. But please, inform yourself if you are going to criticize it, and use valid point. Crypto is a polarizing topic, so a lot of misinformation is spread on a daily basis and headlines are designed to infuriate some while exciting others. That's just how the news works. But crypto has a technical nature, which makes it easy to examine with an objective point of view. Make use of that and start making informed decisions about your finances instead of getting angry at the system and not doing anything about it. This is your chance to be independent from some of the biggest and most unethical institutions out there.","53":"[deleted]","54":"Everyone hates China. I get it. I can absolutely be on board with saying China should have told is about the outbreak. China has done many shady things. But to say 'it was made in a lab' with zero evidence, that is not being a smart person applying critical thinking. \n\nI honestly don't care to hear about claims about concentration camps until I have evidence. All i see is camps. I don't know who is in there, I don't know why. The pictures aren't very clear. And yeah, I wouldn't put it past China to do shady things, but until I have evidence, clear pictures, the reality is, I don't know. \n\nSkepticism means believe a claim when there is evidence to support it. What evidence do you have of the claims of USA being behind all the turmoil in the middle east? People keep saying USA is meddling in the ME. Show me evidence. \nYes, USA created isis, but everything after, there is no evidence the USA is there. People talk about US presence and all that. Yet there is no evidence. Not saying USA is one hundred present out of influence, just saying a lot of various claims have no evidence.","55":"[removed]","56":"[removed]","57":"It's victim blaming. I don't care what laws say, I disagree. If a woman wore a mini skirt and got raped, I don't think the woman is in the wrong if she decides to pull a gun on someone and shoot the rapist dead. Again, if the law says she should be arrested, I would very much like the law changed.\n\nYou are the piece of shit if you let words lead you to punch someone.\n\nI am a woman, and I think it's disgusting to call women cunts. But if someone called a woman a cunt, the woman still must refrain from punching people.  \n\n\nEdit: also Rittenhouse. It doesn't matter why he was there. He did nothing wrong. Yes, even morally. Even those that said it wasn't legally wrong he was morally wrong. Nope. Don't care if he was screaming trashy words, as long as they indicate no violence, assaulters can fuck off","58":"Liberalism is dying and is already mostly dead\n\nBy liberalism I don't mean the incorrect colloquial term of everything left of the Overton window, but the actual philosophy of liberalism of valuing the individual and individual liberty\n\nAmerica is currently in a 5th generation civil War\n\nOur hegemony over the world is buckling, and if our hegemony collapses we'll see the rise of multiple regional hegemonies all armed with nuclear weapons\n\nThe last time we had two competing hegemonic powers we almost had nuclear annihilation\n\n2020 is not just a bad year, it's the start to a bad decade and likely to a bad century\n\nEnjoy the waning years of liberalism while you can, because our children will not\n\nThis might seem like a black pill take, but I'm quite hopeful for the future.\n\nThe near future will be terrible, but I think after we're done destroying ourselves between global warming and nuclear annihilation the resulting civilizations that will form in the ashes will be far better than the civilizations we have today\n\n(Even if you don't believe in global warming, we are still facing future resource shortages in the form of peak productions of natural gas oil and coal looming over us like the sword of Damocles, and we might have already reach peak production for rare Earths)","59":"Apparently demonetized = BAD to everyone else but demonetized = NO ADS = GOOD\n\nScrew ads","60":"[removed]","61":"I just got a part time job stocking shelves at the local supermarket, something I haven't done since my teen years. Even though I currently run my own business grossing $10MM annually. Even though I work 100+ hours a week already. Why?\n\nWhat society, the government, and our culture are allowing to happen now ISN'T WORKING. EVERYONE is SEVERELY understaffed, NO ONE wants to work. I love my country and it's killing me to see it go down the shitter like this. That's why I'm doing my part by taking a second job to help ease the labor shortage, so the economy doesn't come to a screeching halt. We'll ALL be sorry if we allow that to happen. So if you're a proud American like me and want to save our country from the coming ruin, I encourage you to join me in taking whatever job you can find, wages be damned. Let's build a culture of PRO-WORK, of ANTI-LAZINESS, a society that takes pride in GETTING THINGS DONE. Let's save our beautiful land before it's too late.","62":"Don't know if people here are just dumb, but almost every time I walk my dogs during the day some random grown ass adults bark at my dogs.\n\nIt was one thing when it was just kids, but these are grown ass people literally going'bark bark' as we walk by and laughing as if it's peak comedy.\n\nIt isn't. It's dumb. Luckily my dogs are always on their leashes and don't go crazy, but my pit mix is strong enough to seriously throw out my shoulder if he wanted to, even if he's under 30 lbs. I will totally stop and let folks pet him if they ask, he loves pets, but just barking is dumb.","63":"Don't get why these groups have to go out of their way to \"save\" people. If someone wants to wear a mask, take jab or not, it's their business. There is no reason for you to go out of your way to try to force them for \"the better good\". \n\nFor the better or worse, just leave people to their \"fate\" from their choices. If someone does not want to listen to your \"warnings\", there is nothing else you can do.","64":"[removed]","65":"European's are way more attractive then their white American counterparts. African's are better looking then African Americans. East\/South East Asian's are more attractive then their American born counterparts and same goes for every other group.\n\nMy personal preferences is why I rate Europe as number one. As for why I think Americans are less attractive (I'm American) it's the lack of artificial ingredients and sugar in foods that keeps them healthier and more \"natural\" vs our larger BMI.","66":"[removed]","67":"[removed]","68":"The sexual revolution has destroyed this country. All kinds of degenerate behavior is everywhere now. Paraphilia’s are being normalized. And much much worse. Just look at generation Z. The stuff they do say and wear. Morality has been destroyed in the name of “PrOgReSsIvEnEsS”. We are turning into sodom. If we aren’t already there. The only way to change this is to ban all sex and sexuality. All of it. No marriage no porn no sexual intercourse. Nothing. We will reproduce through artificial insemination.","69":"I feel nowadays many people just think it is luck, or give very few acknowledgement to other parameters.\n\nBut something got me thinking recently, that luck plays a smaller role than people claim.\n\nSometimes I find a Youtuber or a youtube channel, and even though it has few subs, it has something captivating that makes me an instant fan, and maraton all their vids.\nIt turns out that many other people usually share the same opinion, and the channel ends up exploding. I usually get it right.\n\nI beleive it is because they have the x-factor. Something about the concept is different and special. When they have the x-factor it is almost inevitable that luck will find its way. You can just feel it.\n\nSo the lesson here is that if you have a strong enough concept, or are really good at something, eventually luck will find you. I beleive that.\n\nAnd think it is a great mentality to have. It puts more responsability on you, instead of feeling helpless.\n\nI used the YouTube example, but you can apply it to other things.","70":"Posting this on a throwaway account because I don't want this tied in to my main one.\n\nBut seriously, the amount of people calling for travis to be cancelled as well as charged has gotten me concerned. Now don't get me wrong, travis does need to be held accounted for to a certain extent, but travis had no way of telling if the people were passed out or dead, and he may have been forced to continue by the producer and workers, or else he would've \"faced consequences\". As someone who's a fan of travis, this incident has left a bad taste in my liking of him, but I'll still listen to him regardless. Please don't jump into conclusions, and just look at the facts.","71":"For example: \"Gaslighting\", \"Signposting\"  \n  \nOver the past few years these words have become very popular in semi-official writing. I don't like the sound of them. I don't even know what \"gaslighting\" means and I intend to continue to refrain from searching it up. Either one of you enlightens me in the replies or I will live in ignorance for a while longer. Even though as far as I'm aware they don't have any specific meaning that I might find annoying, whenever they come up somewhere I cringe.","72":"what the title says, i’ve watched a lot of movies, and none i’ve found to be more enjoyable as HT. everything about this series i love, the characters especially. although, in my opinion, the third movie was a little disappointing and didn’t live up to the glory that HT & HT 2 does. \n\ni don’t care what the “movie watchers”, (aka film majors 🤮) say. this the is best movie ever.\n\ni’m a firm believer in the fact that favorite = best, which is probably pretty clear.","73":"[removed]","74":"Apparently Travis Scott has a history of violent concerts, though I didn't know this before it hit the news. It must have been terrifying for people who expected to attend an ordinary concert and found themselves in an anarchy herd. Now that it's become national news, nobody can make that mistake again. \n\nI've been to events that had an undercurrent of violence, though I knew what to expect going in. It's a bit like attending the running of the bulls or spectating a riot; the danger is part of the appeal. Unlike riots or bull running, concerts are held at private venues that shelter people outside the event from risk of injury or property damage. Travis Scott and his act pose very little danger to anyone who doesn't want to be in danger. If you don't want to expose yourself to that risk, don't go.","75":"For those unaware:\n\n\nNumber (thousands)|Number (millions)| English | Spanish (trans.)\n---|---|---|----\n1000 |1M^0.5| Thousand| Mil (Thousand)\n1000^2|1M| Million | Millón (Million)\n1000^3 |1M^1.5| Billion | Mil Millones (Thousand Million)\n1000^4 |1M^2| Trillion | Billón (Billion)\n1000^5 |1M^2.5| Quadrillion | Mill Billones (Thousand Billion)\n1000^6 |1M^3| Quintillion | Trillón (Trillion)\n\nEtc.\n\nWhy is this better? The Spanish system makes logarithmic sense.\n\nMillions are named with a system with a Latin ordinal prefix (bi-,tri-,quadri-,quinti-) and -illion. (with million being the unit and having no prefix)\n\nThat makes a million a 1-illion, a billion a 2-illion, and so on.\n\nNow in English, each -illion represents an increase in an order of one thousand. But this makes 1000 be 0-illion. That means that an -illion is defined as the order of thousands minus 1. That is, a quintillion (5-illion) is 1000^6 .\n\nIn Spanish, each -illion  represents an order of one million exactly. This makes 1000 to be 0.5-illion (and say, a thousand million is 1.5-illion). A quintillion (5-illion) is 1M^5 . A thousand billion (2.5-illion) is 1M^2.5 .\n\nThis means the Spanish system has a more parsimonious naming rule and is a better representation of the numbers it describes. While odd-numbered powers of a thousand will have longer names, you need half the amount of words to describe powers of a thousand beyond a billion.","76":"[removed]","77":"if I was a millionaire and married someone for a year, divorcing after might make me lose half of it. I knew what I signed up for. Complaining that its unfair has an easy solution. Don't get married. \nPeople complain that without signing the marriage certificate they can't get a lot of things, such as tax breaks and shared insurance. Yes and that's the risk you take. I feel sorry for you, but you are still a sad and pathetic idiot for signing onto something and then blaming others for it. Its one thing to complain its another to say 'well its my spouses fault I lost money'. No, you agreed to it. Honor it. Breaking a contract means you bare at fault too. Breaking a contract still means you must honor the termination clause. I can't just quit my job and leave the company to pay to train my replacement if we agreed I'd give two weeks notice in the mean time I train someone","78":"[deleted]","79":"You made an absolutely braindead, idiotic decision. I would have no more sympathy for you than for someone who jumped off a cliff.","80":"[removed]","81":"[removed]","82":"I'm not actually sure if this is unpopular or not so I'm going off of experience, I hear a lot of people talking about how modern rap is just \"mumble\" garbage but I heavily disagree, we have good rappers like Kendrick, J cole, JID, Denzel Curry, Isaiah Rashad, Tyler the creator, Travis Scott, Polo G, Lil baby, Freddie Gibbs (modern ish), Joey Bada$$, Joyner Lucas, D Smoke and I'm 50\/50 on logic (unintended biracial joke) I love old school rap too but I just like modern better right now, obviously you don't have to agree.","83":"[removed]","84":"[removed]","85":"[removed]","86":"title\n\ni've seen posts on subs like this that basically boil down to thinly veiled (or not veiled at all) transphobia. transphobia is not an unpopular opinion, you're just a bitch.\n\ntreat others how you want to be treated. this includes trans people. we're simply trying to live our lives.","87":"The argument is always that it’s part of the experience or whatever, but it is unnecessary NOISE.  I don’t care how quiet you think you are being - I can hear it.  The crunching, the crinkling, the chewing, it’s thunderous when nothing else is making a sound within 50 feet but you.  So do your big butt a favor and go a whole two hours without eating something.","88":"[removed]","89":"[removed]","90":"In any given election in the United States only a small percentage of the electorate actually votes.  This means that elections are susceptible to efficient organization.  If Leftists really believe in their \"project\" then they should have no problem organizing their allies against selfish, individualist, capitalists and simply out-voting them.  \n\nBut, at the end of the day, Leftists want to be rich, just like everybody else.  They only want to be Leftists to the extent that it fuels their own self-interest.  In other words, prominent Leftists are professional Leftists.  They earn their living by exploiting the discontent with the capitalist system.  They are literally the bourgeoisie parasites that Marx and Engles Wrote about-- people who contribute nothing, but suck wealth out of the system by exploiting the proletariat. \n\nYou know who I'm talking about.","91":"[deleted]","92":"[removed]","93":"We forget that most churches are tax exempt because they're legally charities, feel free to debate if the money different sects give out is enough to actually qualify them as charities, that's not the issue. Let's just assume we have a charity that actually gives their funds towards the poor or sick or for research or for any positive good... I could care less if said charity expresses a political agenda, they shouldn't lose their tax exempt status. Even if they set aside a very small amount of funds to hold a small rally or buy their workers some shirts with political messaging on it... so long as their upfront about this I have no issue with it. \n\nObviously is they're setting aside so much funds that they basically become a tax exempt advertising campaign then yeah that's an issue. But I don't know why this is such a taboo in America at least, churches are allowed to express their opinions on a political level.","94":"[removed]","95":"[removed]","96":"[removed]","97":"**I am not defending pranksters entirely here, however one could also argue to be made that there is a difference between pranksters and practical jokers(although the semantics don't mean much when it comes to public pranks), but I understand when you perform a public prank you get what's coming your way, I will just leave it at that**\n\n\nSo I been indulging in some prank content lately and you know is kinda real funny, it says a lot about people's social stimuli. Like I literally see people being more callous towards a prank than say, literal commited crimes. The only 3 circumstances where I will say you're allowed to react as violently and as hard you want are theft pranks, pranks that involve constantly harassing the person or pranks that involve a very serious pnysical\/death threat. With all that outta the way, if a prank is physically harmless and\/or mild, there's no fucking need to get all up and arms about it, just let the prank be, don't forgive the prankster if it really hurt that much and move the fuck on. Like, unless said criteria applies in the prank, when you react very hostile, you're kinda making the prankster look like the innocent one in their moment and turnint the situation from a personal to a very serious one in public. That's all I got to say for this post.","98":"[removed]","99":"Okay so most people are about like 5 foot to 6 foot you slap 5 foot and add whatever inches super easy very basic. Pretty much nobody is 2 meters too so you've gotta use centimeters and usually it comes out to anywhere between 150-190 which is dumb and a waste of time. I can easily visualize 6 feet I had no clue how many 180 centimeters is. I also have no clue how many 180 inches is but that's why we don't count them. \n\n24 degrees is nice. 25 is too hot. 23 is chilly. You can't run Air conditioning properly. Also kg is just weird. It's too big. A lose of around 10 pounds only comes out to 3 kg. \n\nYes, I understand mathematically metric makes more sense. But I enjoy having measurements that are sized to measure the stuff we actually see every day. \n\nFeet to yards to miles though is quite wacky I admit that.","100":"[removed]","101":"They complain that SJW's want to take there freedom of speech away but they will just try to shut you down by labeling you an SJW. Even if there are legitimate problems that need to be discussed you can't even get a word in edgewise because they just shout you down.\n\nIf they are so insecure that's actually the definition of being a snowflake. I believe with so-called SJW's, their heart is in the right place 99% of the time. They want the world to be a better place. A place without hate. But anti-SJW's are so offended by this prospect that they are afraid that if they can't hate people they are somehow having there right's taken away.","102":"[deleted]\n\n[View Poll](https:\/\/www.reddit.com\/poll\/qlojcc)","103":"[removed]","104":"Instead of spewing Marxist social justice nonsense like other billionaires, he is actually able to relate to the working class through gaming and dank meme culture. These subcultures have always been safe havens for males who have no where else to go without being persecuted by the SJW horde for being white and masculine. For such a powerful man to not only recognize those who have been downtrodden by woke mob,  it to be fully invested in the war against cultural Marxism as well must trigger the socialist media hive mind to its core.","105":"Some people object to minors receiving treatment for gender dysphoria. This seems as absurd to me as objecting to them receiving treatment for any other medical condition- that's what gender dysphoria is, a medical condition. Especially because if they genuinely do have gender dysphoria, then forcing them to go through the wrong puberty leaves them with irreversible changes to their body that will worsen their dysphoria and make it harder for them to ever pass as their identified gender.","106":"Every fucking time he is mentioned outside of crypto subreddits people complain that \"ohhh hes a billonaire, he must be evil\" and other stupid things. He is clearly trying to work for the better of humanity, and like 99% of people that complain about him won't even be close to doing a tenth of what Elon achieved. Adding on, he owns Tesla and SpaceX - they both advance electric cars (which save environment) and space travel (which allows humanity to progress)","107":"Handshakes are disgusting and unhygienic. Too often, we don't really have a choice. You are pressured to smoosh your hands with some stranger without consenting to it. You can refuse, but that would be difficult for most people and can be hard to get out of. Like what if it's a job interview? Do you refuse?\n\nPeople should not be PRESSURED into doing things they don't want to do. Ever since coronavirus, handshakes have been finally eliminated, for now, and I hope they never bring them back.","108":"[removed]","109":"This doesn’t mean I don’t think there’s bad\/awful police officers that need firing, or that the training necessary to become one doesn’t need improvement, or even that there’s systemic corruption of power at the top. With that being said, the idea that there’s police who act as gangs, using their authority to “hunt colored people” is such a myth. You could even call it a conspiracy theory, it’s propped up on evidence that is easily disproven from more extensive, comprehensive and non-partisan studies.\n\nThe most ironic part of the movements IMO is that most supporters want guns gone through passing authoritative legislation to ban guns. So you:\n\n1: Want to arm more criminals per capita (since laws only apply to law-abiding citizens, and gun legislation to disarm criminals is inherently an oxymoron)\n\n2: Want officers less capable of handling firearm situations in real time (with or without more gun legislation), since less funding = less officer capability and quantity.\n\n3: Let’s say scenario 1 doesn’t happen for the sake of argument, and we get all guns from the citizenry, legal or illegal: Want to take guns from regular people, so that police have even more leverage in real-time scenarios? When supposedly ACAB? That’s entirely backwards logic.\n\nI see no way these scenarios play out well. It seems (at least to me) that people’s real issue is with how the police budget is spent, and the discipline of bad apples.","110":"[removed]","111":"I just saw an article about how the FDNY has had to temporarily close 26 firehouses over a staffing shortage after the vaccine mandate resulted in a wave of dismissals. And I've seen some media figures on Twitter frame this as a case of selfishness on the part of unvaccinated firemen. This is horseshit.\n\nTo be clear, I personally have received both doses and think it's a good idea to do so. And while I think it should be a personal choice whenever possible, I do concede that there are some professions where a mandate is appropriate. But firefighting isn't one of them.\n\nIf there's a fire emergency, I dont see why anyone would even think about the vaccination status of the fire crew responding. The important thing is that there are enough on call to actually respond in the first place. It gets even stupider when you consider that a lot of the time firemen wear helmets or smoke hoods anyway.","112":"Every time I say some fat chick is sexy I get made fun of and honestly it kind of makes me mad. I can't control what I am into, so what's the problem?\n\nFortunately for me, I am just as into fat chicks as small ones, but there are some people in the world who prefer fat chicks but are too ashamed to go out with one thus making them have less dating opportunities.\n\nAnd yes, I know there are reasons that there is stigma around it, some people take it too far and overfeed their wives to an unhealthy extent, but that doesn't mean everyone who's into fat chicks is going to be like that.\n\nI don't think it's healthy to be into chicks that are fat to the point where it is unhealthy for them, but people can still be some what overweight and healthy if they make the right choices, so I don't think it should be a bad thing to be into chicks that are kind of chubby.","113":"[removed]","114":"[deleted]","115":"[removed]","116":"Seriously, it feels like everyone here thinks anyone of Chinese descent is a spy and enjoys eating dogs and bats for breakfast. Yet, people unironically believe these as fact. You see people saying Chinese students in universities are rich snobs who just want to party even though literally most parties in universities are filled with white people, even in schools with a ton of Asians. You always see people here say the Chinese government is evil, not the people, but make all sorts of assumptions that is disgusting about the people.","117":"Geographically because both countries are huge landmasses of still incorporated terrain(broadly speaking)\n\nCulturally because we're a culture of self sufficiency, hard work and determination and owning a car is seen as a sign of not only financial success, but also just being an overall responsible and financially secure adult.\n\nSure Europe's mass connected infrastructure can support the use for it better than North Americans can, but we North Americans can barely even afford to have our railroad systems maintained, what makes you think the government in the slightest gives a shit about making \"public transportation\" more accessible to the general public?","118":"\"Let's Go Brandon\" is absolute cringe. If you don't like Biden then just say \"Fuck Joe Biden\". What the fuck is with this clever insult bullshit? If someone has to do homework to understand an insult, then it's not insulting. It just looks embarrassing to see people jerking themselves off for thinking that they're so clever for something so stupid.","119":"[removed]","120":"[removed]","121":"People have this attitude not because these traits signal a deliberate effort to non-defensively hurt others, but simply because they're deemed irritating, annoying or otherwise inconvenient traits. The sentiment penalizes someone for matters very difficult, and in the short term practically impossible, to manage. It's akin to blaming somebody with a broken leg (or not a natural sprinter) for being unable to run well, if at all.  This remains true even if they do not choose to \"wallow\" in it, or even \"wallow\" in it due to discouragement at ever finding the 'magic forumla' for self-repair.\n\nEven if it's not due to a cognitive disability of some sort, they may also have certain deeply-held, even unconscious, ideas that spin the way they take and interpret outside information.  All the scorn and ridicule in the world is not going to eliminate that way of thinking.  The better approaches are to either have a respectful back-and-forth conversation with them while not disdaining any answers they give to why they think or react the way they do, no matter how off-the-wall or disgraceful, or suggest they see a cognitive psychologist about the matter.\n\nFurthermore, seeing such people as \"not worth the trouble\" actually perpetuates the very problem so many people disdain. Thus, throwing such people under the bus can (ironically) cost society high quality talent. Their deficits don't negate their actual in-born talents in other areas, even if bad experiences inhibit development of those talents. This is especially true if they already show at least job-quality competence or praiseworthiness in certain areas society values highly (economic, cultural, humanitarian).\n\nIn summary, disdaining and especially refusing to help (i.e. so-called \"coddling the person\") is like somebody slamming a sledgehammer into a stalled-out car's engine because that person's irritated that the car won't run, even though expensive but still worthwhile repairs might make the car driveable.","122":"There are so many more pressing pressing issues than other people coming into the country, yet a huge portion of right wingers seem hyperfixated on it and when you question them on why they give the same weak reasons.\n\n\"Different values\" okay? Everyone has different values\n\n\"Crime\" Is there? There is alot of data that says otherwise.\n\n\"Loss of culture\" You are free to practice whatever your culture is. The unfunny part of this argument is that when they bring up their culture they just bring up an amalgamation of all of Europe's culture instead of their individual culture.\n\n\"They need to assimilate\" Why? To what? \n\n\"Biological reasons\" Whenever I question this talking point further the discussion fizzles out or goes someplace else just admit your racism and we can continue the discussion. Are you trying to tell me you're racist for no reason? \n\nImmigration is a completely foolish fantasy issue with stupid talking points, it's just an idiotic thing the mainstream media and politics focus on.","123":"There's plenty of blame to go around. The producers should be held accountable for conditions on set. The armorer should be held accountable for live rounds making it to the set. And Alec Baldwin should be held accountable (involuntary manslaughter) for not checking to see if a firearm he was handling was loaded, and prancing around pulling the trigger while pointing the firearm at real people like the dickbag he is.\n\nAll three can share blame. All three should probably spend time in prison. None should ever be permitted to work in Hollyweird again if there is any Justice.","124":"Call me old fashioned but I am mostly interested in a woman's personality. She can be hot as fuck but not worth dating. \n\nWomen who are obsessed with showing off their body online, whether it be social media, onlyfans etc are lower value when it comes to dating. You'd have to be a fucking simp to be okay with your wife selling nudes for a monthly payment. Sorry, but I don't support sex work or pornstars, they are low value in my eyes when it comes to dating.\n\nPromiscuous women, exhibitionist or overly sexual women are a major red flag to me. Sex isn't my #1 priority in a relationship. I'd rather a woman I can go see a funny movie with, one that shares my sense of humour, one that I can talk to and actually have a productive conversation with. Sorry hoes but you aren't for me. No one can satisfy a hoe, they demand attention from as many men as possible, there is no point marrying a hoe because your attention will never be enough, they need validation from as many men as possible. \n\nHoes are abundant and low value. Give me a woman with a brain and a hoodie, not a skank with a short skirt and no panties.","125":"[removed]","126":"Yes, we (first world countries) are advanced enough as a society to survive on vegan foods. We don't *need* to eat animal products. If we were to make the ethical choice we would stop eating animal products, its the right thing to do, it's just not pragmatic. We, as a species are designed by nature to be omnivores. We eat plants and meat. It's the most beneficial diet for our species. \n\nYes, we CAN survive on a vegan diet, but it would require us all to do extensive research on what and how much we eat, we can die if we don't know the exact details of our diet, we can develop diseases and deficiencies. \n\nTo deny an omnivorous species of meat is impractical. There are ways to reduce animal cruelty and still eat meat, we don't need to change our diets to fight animal cruelty.","127":"","128":"I'll just use Amazon CEO as an example. I'm not saying the CEO is a saint, but I think overall the good that he did by creating and leading Amazon overweighs the negatives.\n\nSome positives:\n\n* Pioneered cloud computing almost a decade before any of the other tech giants (Google, Microsoft)... Which has allowed other companies (Reddit) to grow and scale to where they are today.\n* Reduced the total carbon foot print of the US. It’s a lot cheaper for a neighborhood to order online rather than each person drive a 2-ton vehicle across the earth every-time they need to buy a carton of milk. It's cheaper for Reddit to rely on AWS than build their own data-centers. Amazon is also on track to run entirely on clean energy by 2025.\n* Has given people a lot of their time back that they would’ve had to spend running errands like grocery shopping. That extra 3-4 hours saved every week and reinvested wisely can compound into something life changing for a lot of people.\n* Has employed over 1.5 million people with a company-wide minimum wage of $18\/hr and good health benefits. Amazon’s net profits in 2020 was around 21 billion dollars. They pay their employees 90 billion dollars in wages and other benefits.\n* Yeah Amazon’s CEO has 180bn net worth. But by founding and spearheading Amazon, he also created \\~1.6 trillion dollars worth of wealth for other people (Amazon’s total market cap is at 1.8 trillion dollars). A large portion of that wealth are in pension funds, 401Ks, and Universities.\n\nYes the guy didn't do everything by himself. But the thing is is that he was the one who created the company, invested the most into the company. And was there at the beginning when every action, decision and dollar invested was the most impactful.\n\nThe workers who were there at the beginning or *anyone on the planet* also had the option to become shareholders of the company as well. For every $10,000 that they had invested it would've been worth $2-3 billion today.\n\nIf they had chosen to do that, who did they exploit exactly?\n\nYou can extend this argument to all of the companies whose products that you use or rely on everyday... Apple, Microsoft, Google, Netflix etc... The founders are or were all billionaires. But their companies have helped provide value to people more than they have harmed people.\n\nThe average US citizen still enjoys a lifestyle that is far better than the majority of people on the planet today.\n\nWhen China adopted the same capitalist system that we use, thousands of people became billionaires. But at the same time billions of people were lifted from poverty into middle-class lifestyles.","129":"[deleted]","130":"My opinion is that the fairest tax would tax you based on how much government services you used (obviously that cant always be calculated accurately but the point stands). It doesnt really make sense to me why we care about progressive vs regressive. Your income rarely determines how much you pay in other areas of life. I dont hear about people splitting rent with roommates based on income, or splitting a dinner bill based on income. Mcdonalds doesnt look at my w2 before deciding how much to charge for my burger. So why do we thing government services should be charged based on income? Why should the engineer who makes 200k but drives 5 miles\/day pay more for roads than the retail worker who makes 30k\/year and drives 20 miles\/day?","131":"Here is how economics works. A federal minimum wage of 15$ an hour is instated. Companies don’t have money for that especially smaller businesses. So people are laid off and there is now a job shortage. In turn people aren’t spending money anymore and no one pays taxes anymore. Now nobody is employed because no one is spending. It’s extremely simple day 1 economics.","132":"[removed]","133":"[removed]","134":"At this point, you have to be high on cocaine to seriously believe hard work leads to success. 99.99% of people who work hard are stuck at the bottom. Many people in the elite or have power are lazy. It gets so annoying when people say Walmart or McDonalds are just jobs for teenagers when most adults can’t find a non minimum wage job. The current economy is terrible for the vast majority of Americans, and the fact that people still try to defend this broken system are insane.","135":"They oppose universal healthcare so that A parent doesn’t have to worry about spending thousands of dollars just to give birth, or lose their healthcare if they get laid off.\n\n\nThey oppose workers rights , affordable childcare , mandatory paid time off, maternity and paternity leave . Anything that makes it so a worker can spend more time with their family as well as making it affordable to take care of them.\n\n\n\nBasically anything that makes having kids easier and accessible they oppose ! \n\nIn America with a non existent welfare state. if shut goes south you’re fucked, so why would I have kids  unless i’m very well off ?\n\n\nAdditionally  conservatives , especially white , are often the types to kick their kids out at 18 yo because of some twisted boomer idea of forcing rugged independence on your kid .","136":"[removed]","137":"So there are many parts to it. A bio mom that puts the new born into the foster care system shouldn't be allowed to take the kid back. The kid should quickly be given to a family that want the kid for life. It's not good for kids to keep switching environments. We should do what's best for the kid, and I don't think the mom\/dad getting the kid back is good for them. Yet everyone says that because of biology that these bio parents should have legal claim to the kid. \n\nPeople also say preventing people from having kids, whether through social pressure or other means is a bad thing. I don't feel sorry confining a serial killer in prison alone where he cannot reproduce. Similarly, I wouldn't see a problem if we had laws or policies that prevent unfit parents from having kids. For example, one child policy, or taxing people for every kid they have over the second. \n\nIf we argue people should be able to decide our own life, I would agree. But the mentality isn't consistent. If people want the government to layoff how many kids we can have, then they should layoff on how kids are raised? It's either it's moral to let the government control your kids life, ie mandatory education (yes even homeschooled kids need to show they are progress) or the government is immoral for control. \n\nAlso, lets say in a futuristic world we have a pill that makes you infertile. No side effect, nothing. The only way to go back to being fertile is an antidote that the government gives you an antidote so you can have kids. The unpopular opinion is people think it's creepy for the government to control your sex life. It's no different than sex work being regulated, and also I just don't see how it's creepy to prevent the harm that a child may face. \n\nI also don't see why it's so 'wrong' to say poor people shouldn't have kids. I'm broke, I'm not gonna have kids. It's as simple as that. If I were 16 and unable to raise a child, I should not consciously and knowingly have sex to have a kid just because I 'want' one. I know people say a lot of kids in poverty are because of lack of education and contraception. If you are so dumb you don't know that having sex could lead to a child, then I can agree. But if you know that, then it's on you that your kid is suffering, and you disgust me. Lack of contraception isn't an excuse from adults. \n\nHonestly, my biggest issue, and I've tried on changing my view subs and stuff, but I just fail to see why raising a kid is a right. People want kids isn't a good reason for it to be a 'right'. And people want makeup and jewelry and whatever. A kid isn't something that should be seen as 'I want, therefore I should get'. Don't get why everyone 'should' be allowed a kid.","138":"[removed]","139":"[removed]","140":"[removed]","141":"Social media has shed so much light on so many issues we’re facing in the world right now and in the past, it’s fantastic. It has connected us all in such a fantastic way where everyone can find someone with a similar interest no matter what. As someone who grew up in a small town, the internet and social media both have been a godsend.\n\nPeople severely overstate and overestimate the negative effects from social media, and are purely biased by mob mentality.","142":"[removed]","143":"First off, nobody pays attention to it. Look around the next time you're on a plane and literally nobody pays attention or cares about the demonstration. \n\nSecond, it is pointless. In the event of an emergency everyone is going to panic and forget everything they were told even if they were engaged and listening. They're going to go into flight or fight mode. \n\nThird, it's silly.....use your seat cushion as a floatation device? Come on. If we crash into the water we're all fucking dead so stop putting on airs like we are going to be saved by our seat cushions. \n\nFourth, airline travel is so statistically safe that the demonstration and instructions are just a waste of time. The chances of any of it becoming relevant in any given flight is so small and negligible that it literally doesn't make sense anymore to have it as an FAA requirement.","144":"Everything has pros and cons. I can understand some people's sentiment as relayed by those who don't want universal healthcare. It's just hard for me to understand why people think everything is black and white and if you don't want universal health care you should die or something. \n\nThe hypocrisy shows when people say that anti vaxxers shouldn't receive treatment. Can you not see this feeling might apply to others such as smokers, obese people etc? Obesity is high in USA. Private healthcare (insurance) could theoretically have people paying different rates. If you got hospitalized once for lung failure because you smoke for example, your cost goes up.\n\nIf you had any diseases that was linked to lifestyle, it goes up. Or at least, I think if the doctor prescribes you something, exercise once a week at least (show proof, such as video) your rates stay the same. \n\nI'm just saying, for me it's a necessary sacrifice, but doesn't mean I have to be happy paying for people's poor choices. In before, but some people have conditions that can't be helped. Yes, and it could be me, that's why I say I prefer universal health care, it's not a risk I'm willing to take, but it's not hard to say some don't want to give out their pay check for a risk they might not get. Whatever their decisions, it's their choice whether they like it or not.\n\nPersonally, I think 'universal' healthcare should at the very least be state by state (or province)","145":"[removed]","146":"[removed]","147":"[As Covid-19 spread, Florida Gov. Ron DeSantis opted for an open economy, opposed mask mandates, and took a hands-off approach to vaccination distribution. American Oversight is investigating Florida officials’ mishandling of the coronavirus crisis, which has cost more than 30,000 lives in the state.](https:\/\/www.americanoversight.org\/investigation\/the-pandemics-spread-in-florida)\n\n[They arrested a data scientist that refused to false manipulate data.](https:\/\/www.npr.org\/sections\/coronavirus-live-updates\/2021\/01\/18\/957914495\/data-scientist-rebekah-jones-facing-arrest-turns-herself-in-to-florida-authoriti)\n\n[They’ll try to scapegoat whoever they can, regardless of how little sense it makes.](https:\/\/amp.miamiherald.com\/news\/local\/news-columns-blogs\/fabiola-santiago\/article253269883.html)\n\nAnd DeSantis is pretty much only concerned about publicity and running for president. [Early in Florida’s vaccine rollout, during a period marked by confusion and images of seniors in long lines desperate for a shot, Gov. Ron DeSantis’ office devised a pitch to air a more flattering view. In mid-January, his staff took the idea to Fox News.](https:\/\/www.tampabay.com\/news\/florida-politics\/2021\/08\/13\/inside-fox-news-desantis-is-the-future-of-the-party-and-hes-taking-advantage\/?utm_source=newsletter&utm_medium=email&utm_campaign=newsletter_axiosam&stream=top)\n\nMy heart goes out to all the Florida dying needlessly because of incompetent leadership that couldn’t care any less about them :(","148":"[removed]","149":"[removed]","150":"[removed]","151":"People, both men and women, talk about how there is a rise in single people. Some say its a bad thing. To those that do think so, nothing can be proposed except for something that violates the freedom of someone, it would decrease our societies trend towards more individual freedom.\n\nThere wasn't a lot of incels of yesteryear because women couldn't work. Thus the incels negatively correlated to the amount of freedom women have right now. So now what about people today? Men and women are free to pick whomever they want. If they turn their nose up in disapproval and stay single, it is their choice. To shame them for being single is in away sort of going against the idea of let people do whatever so long as it doesn't hurt others. \n\nMy point isn't necessarily bad or good that incels are rising or not, but simply that if you value 'my freedoms' then that is the consequence of it. In my opinion, I don't see a problem with a rising amount of singles. now you must be thinking, more singles means more incels and possibly more violent people. \n\nBut I think even if it were true that lots of incels turn violent, I think that can be fixed with you should go to jail if you hurt someone. Being lonely sucks, but I think (and I think this is the key unpopular part) no society needs to ensure you get the partner you want. Those incels either need to live with it and understand it or I don't feel sorry for them going to jail. Its not jail time for lonely people, its jail for those that act on it.","152":"[removed]","153":"In case you haven't heard, Baldwin accidently killed a woman on the set of a movie.\n\nIt's bizarre how quickly people have come out to comfort Baldwin. Yes, I'm certain he feels terrible. But someone died; the victim should be the primary focus of people's sympathies. People are tripping over each other to circlejerk about the remorse the actor must feel, who is soon going to overcome this and return to being a millionaire celebrity. \n\nIt's also worth noting that \n\na) when you're handed a weapon, it's your responsibility to make certain it's safe, and \n\nb) the amount of negligence required for something like this to occur is immense, and that falls on everyone on set, including Baldwin. Most jurisdictions would have no issues charging a \"normal\" person in an accident like this.\n\nI do think this is a tragic accident and that no one should be charged. But some of the comments online regarding this incident are making it sound like Baldwin is somehow a victim, which is completely untrue.","154":"These posts always get hundrends and even thousands of karma and awards and comments agreeing with them because literally thousands of people share that same opinion. Yet it pops up again and again every year  on subreddits like this one because people use unpopular to mean hot take.\n\nIt'd be more of an unpopular opinion to agree with the 2% statistic.","155":"As with the propaganda campaign of Big Oil in i believe the 70s, where they tried to shift responsibility of recycling onto consumers.\n\nModern scientist are attempting to shift responsibility of climate change onto our dumb asses, you will note that being a simpleton means that  i have no idea how to fix climate change.\n\nI would think that having a degree in *honk- honk* Chemistry and Physics would mean that they could do a better job then me.\n\n&#x200B;\n\nStop asking *fucking* Homer Simpson to fix your Nuclear Reactor.\n\nIt didnt take a year for scientist to come up with vaccines for Covid 19.\n\nHow well has the message of recycling gone after 50 years?\n\nHmm.. Im beginning to think they may have lied to us...D'oh!","156":"[removed]","157":"Look what's happening and where. All these places hurting for help were non-union anyway and people are standing up for themselves. Hell, there's probably a ton of people who want to talk out on their jobs and join the \"revolution\" but can't because of their fucking unions being in control. All teachers do is whine they're underpaid etc. Don't see them on fucking strike with the rest of the country though. Unions are archaic, money grabbing organizations that are no longer relevant in the 21st century. People are finally standing up for themselves now.","158":"First of all, no actor should be handed a gun on set without proper firearms training. Every time a gun is handed to you you're supposed to check the action and ensure the gun isn't loaded. This is basic firearm safety. I learned this before I started school. You don't just \"believe\" whatever the person handing you the gun says, and even when you've checked the action and ensured the gun is safe you **never point it at anyone for any reason, let alone do so and pull the trigger**. On a movie set *maybe* you point a safe weapon at another actor, but you certainly aren't wildly pointing it around at cinematographers and directors and pulling the trigger like it's a game.\n\nThere's really no excuse for Baldwin. This is a textbook example of manslaughter and he belongs in prison for his negligence.","159":"[removed]","160":"Alec Baldwin just killed a woman with a prop gun. Alec Baldwin is a notoriously anti-gun celebrity, who has been against the idea of responsible civilians owning firearms. \n\nNow it turns out he was being incredibly irresponsible, firing a gun at someone without even knowing the guns condition, resulting in the death of a woman. It's also incredibly hypocritical just to use a gun when he has been so much against people using guns. \n\nI hope he feels terrible for having killed this woman.","161":"[removed]","162":"Like you need to realize that most people meet at their work, most people meet naturally through mutual friends, etc. etc. It isn't some big thing that happens. It develops naturally. It isn't something you have to try and do\/a girl isn't something that you go out and try to get. \n\nNow you have these guys these days who  make it into this massive big deal (not just talking about INCELS here, but hopeless romantics, too) but it isn't. It fucking isn't a big deal. A relationship almost always develops naturally over time, starts with friendship. And it naturally progresses, this is 99% of relationships that ever happened or will happen in the future. It isn't a big deal and it isn't dramatic. And you don't have to try to get with someone it just happens. It just fucking happens. Can you understand what I'm saying?\n\nIt just happens naturally. \n\nNow as far as the whole idea that ugly people or average people can't get  a date, I call bullshit. I've seen it happen many times, average dude with a great personality gets a pretty girlfriend. Unattractive\/not typically attractive guy attracts others through other ways, like having a great skill or intelligence, etc. etc. \n\nYou know, one thing those guys don't do? Go around whining about how they can't get a date. You know how boring that is to listen to someone whining about that stuff? Considering they could be doing something about it instead? Who wants to put up with that?\n\nI am willing to acknowledge someone with social anxiety and other issues, but they should be doing the best they can despite those issues. Because what the fuck else are they going to do, wallow in pity? Again, women don't like that, and neither do men btw.\n\nSo yeah, that's about it really. I put this as 'unpopular on reddit' not because there's a big INCEL population here (there isn't - not anymore as far as I know) but I read shit on here all the time on dating subs, and other subreddits like foreveralone where they just wallow in self-pity and it isn't even real what they believe. Like if they really had zero chance of ever getting a date, I'd think that'd be sad and they could be sad about it, but that isn't reality and it never will be. Nobody has zero chance besides people who aren't even trying. \n\nAnd here's one more thing, you really should be focusing on yourself since you clearly have issues unrelated to other people and women, like being socially awkward is one thing but having no self-esteem is a whole other deal and that's your thing to work on nobody elses. Stop with the doom and gloom bullshit and join the human race. It isn't that difficult.","163":"I mean, fucking hell, enough is enough. I just want people to shut up about their niche petty culture war bullshit, and having a totalitarian government would be a great way to make them do that. It would be much less easy to say that America sucks or that almond milk and math is racist or whatever the hell if you had a government that would crack down on idiots who step out of line. I just want peace and order, and the only way to get that is to shut people up. At this point, I'm pretty flexible as to how that gets accomplished.","164":"[removed]","165":"I hear a lot of 'Canada is a Christian country'. Lets say I grant that Canada first started with laws based on the 'Christian' view. Ok, so what? Lets say I want to change some laws. Lets say the bill is passed and you are bitchin and saying 'but in the past all our laws are based on the bible'. Now, although I don't agree, if you had said 'Canada is majority Christians and they want laws based on the bible' that's a more reasonable argument. \n\nSecondly, people keep saying 'well your ancestors were immigrants, therefore, you must accept immigrants'. Why? Just because the country started that way, doesn't mean it has to continue. \n\n'Canada' started with a lot of warfare etc, doesn't mean we should use that as a way to decide how to get shit done. \n\nThese are the most common arguments, but not limited to.","166":"The Republic is a hypothetical nation where sovereignty rests with the *people* and not corrupted representatives, monarchs, and other rulers who are in it for power.\n\nAlso, the inhabitants do not let tyrants run their lives and take away their freedoms and fight for their freedom to say and do whatever they want. \n\n\nIn the Republic, the government is a true democracy and not a bunch of lobbying politicians people who do not care about the people.\n\nThis kind of government will never exist in this world and there is so much rhetoric about how much a nation is free under the title republic.\n\nIn truth, it's easier said than done many leaders are corrupted and people are oppressed by every government institution within the very nations that claim to be the Republic.","167":"[removed]","168":"Let me be clear -- I understand the various reasons people feel they *need* guns, and also (in the US) why it became a right granted to the people via amendment centuries ago, as obviously it was top of mind for the founders of our nation.\n\nI cannot understand the concept of *wanting* to own a gun. A gun's sole purpose is to kill. (Or, you could say injure, but essentially kill). That is its purpose. At the very least, it is used for destruction. The reason I struggle with understanding \"gun enthusiasts\" is because essentially, you're collecting\/obsessing over a tool used to kill others. Though you hopefully will not have to kill anyone with it yourself, that is what it does.\n\nI look at it as some twisted eventuality of us being granted the right to have them (in other words, of course at some point, having access to them, this was bound to happen), but at the end of the day, the idea that someone is so gung-ho about owning something with such a purpose is what feels off. This may be more of an American perspective, as I don't think the love for guns is so prevalent in most other nations, but is has obviously shaped our culture greatly.","169":"Not only is she intelligent and well-spoken, she turns a lot of loaded questions right back on the trolls asking them. The amount of times I’ve seen her absolutely dunk on a Fake News talking head is ridiculous and I can’t get enough of it. I wish more people would stop treating those trolls as if they were doing their jobs in good faith. \n\nI think what also makes her look better is her being appointed on the heels of several of the worst press secretaries in recent memory. Trump’s many secretaries never really bothered to get informed on the actions of the White House and would instead make stuff up on the spot and attack the journalists. It was very uncomfortable watching obvious propaganda mouthpieces act childish and then smile as if they weren’t human garbage. \n\nLet’s hope this starts a trend of putting competent people with a quick wit in positions where they can shut down Fake News.","170":"What the title says. I don't get why people don't workout. You don't have to be a body builder or some sport competitor, but exercise is essential in living a fulfilling and long life. \n\nEvery person I've came across who does not have some form of daily exercise are really toxic people and have so much anger. Idc if you are fat or injured. If you are pursuing this basic form of self betterment as best as you can, you set yourself apart from people who just sit on the couch all day. \n\nI use to really hate fat people, but it was misguided. I don't hate them, especially if they are trying to better themselves. I just severely dislike and don't trust anyone that can't do something basic as at least trying to move for an extended amount of time. \n\nThere is no excuse besides illness. Dont have enough time? Manage your time better to allow 30 minutes for yourself. You can hold off on watching YouTube or Netflix. Don't want to break into your relaxing time? Knock out a few push-ups during loading screens or in-between episodes. Just try.","171":"You know, I get it. Women have a right to choose what to do with their own bodies. But men also have this right. As a man, I don't want to put my body in possible danger to save a woman who is being assaulted, if the woman isn't a friend or family.\n\nIt's fascinating to see how so many feminists on this website are shaming men for doing nothing to help a stranger.","172":"[removed]","173":"The way I see it is, if you are in my castle or my body and I don't want you there. Out you go.\n\nI have no idea what the person breaking in wants, not my problem. I'd like a quick way to get him out. In Canada, as I know, even warning shots are illegal. \n\nWith my body, especially if it'd against my consent, its not my problem, even if I was pro life. It doesn't matter if you put a magically shrunken Einstein in there. It was there without my consent, not my problem. If an action occurred and reversing it would let someone die, I still think it should be legal. Same way if I reverse my decision to donate blood. \n\nThe unpopular part is that oddly, people who support making abortion legal aren't s big fan of guns. And vice versa. I'm not sure why but here it is","174":"Okay here me out, pineapple and peanut butter are good together on top pizza. As are olives and garlic and pickles. Those two different combinations, as well as others not listed, are great on pizza and make for some of the best pizzas I’ve ever had. They really bring out different flavors and combine in good ways.","175":"[removed]","176":"[removed]","177":"Yes, even with something as dramatic as COVID did not make 'society' disappear. I find people who see any change as a drama that will 'collapse' society hard to understand. I think the whole 'get mad because someone said something racist' are stupid, but they are not 'collapsing' our society. If we suddenly had a dictator, 'society' would still exist. Not the society you like, but society nonetheless. It's funny how people are like 'soy boy feminists will kill America' or others say 'evangelicals will bring USA down to its knees with it's extremism' or 'social media is killing us'. \n\nIn the great depression, society was shit, but still existed. I think it will take a lot more to kill societies.","178":"Every time he says the word “Brother” I want to rip my ears off. Haha brother haha stay hungry hahaha stfu. I know that’s like his thing but it’s just so weird and annoying. Another reason why I say this is because there are too many opinions like “here is why women are evil” or “here is why you should be gay” or something and I wanted to shake things up a bit. Anyways yeah lol","179":"","180":"Ever wonder why your opinion is considered truly unpopular? it’s because it’s a shitty, mean, gross, and objectively wrong opinion. \n\nYou aren’t some genius free thinker who isn’t afraid to state the truth, are an asshole who is wrong. You’re not a revolutionary thinker, you just lack common sense and common decency. \n\nYes, it IS unpopular, but it’s because you’re being an asshole, and you are objectively wrong. It’s like me posting “Antarctica is actually very warm.” Your opinion isn’t unpopular because the majority is blind, it’s unpopular because it’s wrong and you’re an idiot who lacks basic logic and critical thinking. \n\nHalf the posts on here are some alt-right take on why people are too soft or some bullshit like that, which makes sense because most people on this site know that you are wrong.","181":"If someone treats the people weaker than themselves like shit it shows that they're a bully and it a poor reflection of their moral character. Let's look at how Joe Biden treats the people weaker than him \n\nhttps:\/\/youtu.be\/yrh6ExrmIoY\n\nIn this video a reporter asks Joe Biden a question, Joe responds by calling this guy a \"damn liar\", he calls him fat, tells him that he's \"too old to vote, and basically humiliates him in front of everyone. What kind of person is Joe Biden? There are also videos of him sniffing and touching children inappropriately(which were unfortunately taken off of YouTube). \n\nNow let's look at Trump\n\nhttps:\/\/youtu.be\/ASOTct1woo8\n\nA female reporter was picked for an interview the reported said \"thank you Mr president\" and Donald Trump responded with \"you're not thinking you never do\" embarrassing the woman in front of everyone. \n\nThis woman is not a billionaire, politician or a celebrity. She is not on the same level as Trump, this behavior was uncalled for and rude.\n\nWhat kind of wretched scumbags are these people? Did their parents teach them any manners? Did their fathers ever spank them?","182":"[deleted]","183":"[removed]","184":"I really don't understand why so many people find street preachers so infuriating.\n\nYou're not entitled to peace and quiet in a public area, and if you're not interested you can just walk by and get on with your day.\n\nThere's other people such as charity canvassers and salesmen that use similar tactics to reach out to the public but nobody seems to have with them.\n\nI suspect that some of it's motivated by anti-Christian bigotry.","185":"I love to make “cereal” out of random foods\/snacks, which to some is a crime. I  personally love to just drown some snacks\/food in milk and eat it like cereal. It’s even better when it’s a super crunchy food and it gets super soggy and milk absorbed. It’s just so tasty and enjoyable to me because of the texture the food gets throughout eating it. My favorite foods to do this too are crunchy ones since it goes from super crunchy to super soggy as it’s absorbed the milk. \n\nI write about this as it’s always seen as weird or just disgusting because it not defined as cereal. To me, it doesn’t matter all that matters is that you enjoy it and find it tasty or just pleasing. Just because you don’t like it doesn’t mean other people should t be allowed to like what they like.\n\nSome of my favorites to do this with are baked chips( bbq is the best), chicken flavored soup mix, certain pretzels, rice cakes, popcorn, crackers, cheezits, crispy cheese hot pockets, pizza crusts(and cheese pizza since meat isn’t the best soaked), gold fish, waffles\/pancakes, hot fries, (O)reos, EL Fudge, donuts and pretty much any crunchy snack I can fit in a bowl usually is a pretty good choice too.","186":"If you have a *need or desire* to watch \"straight\" porn instead of solo sexy\/naked women to get and stay sexually aroused, you are not heterosexual.\n\nDuring a heterosexual act, your focus is the woman, and the vast majority of time you don't even see your own penis, you see (and touch) her - a woman.\n\nWhen you watch \"straight\" porn you have 50\/50 man and woman stimuli. And see a penis 100% of time.\n\nIf you were truly heterosexual, seeing a man would make you *less* aroused.\n\nI've also heard the argument that people watch it to \"imagine they are the guy\" but that makes no sense. There is no situation in which you need to see another person for your imagination to work. If you imagine you're skiing or skating or driving or washing dishes or whatever you don't need to see\/imagine another guy doing it. Or see your hands\/legs doing it.","187":"[removed]","188":"Seriously when did this kind of behavior become okay? I see this all the time, no matter where I am or what website,  I scroll down, I  see these comments \n\nAnd they seem to be increasing in numbers. \n\nAnd the amount of times I see people on here defending these kinds of comments...just piss me off. Suicide isn't a competition. \n\nThere is a time and a place to discuss something like this but under these kinds of videos, posts, etc. is not one of them. \n\nAnd to the person who is going to say \"Well, feminists do this all the time to men and no one says anything\", no one should be doing this...ever!","189":"Colin Powell is the reason you can't have 3oz of water on an airplane. Colin Powell must now take responsibility for not having more than 6 socially distanced people at a gathering.\n\nI believe in the law of reciprocity. If you're against guns, you're not allowed to have bodyguards, that sort of thing. It is the only way to keep people honest. Colin Powell made a lot of people suffer. The best we can do as a society is to honor his legacy in kind.","190":"[removed]","191":"Its weird how feminists are correlated to anti free speech people. Its also funny that the people who call themselves for free speech are against people with sexual freedom. \n\nI support both. Sticks and stones and all. Just because you can't get laid doesn't mean you start pressuring people to fuck you. \n\nThe unpopular opinion is both people will be mad when i say its a good thing people can fuck whoever they want and as many as they want with consent of course. I just don't see this as a societal problem. People say things like 'men\/women, you shouldnt sleep around, I'm begging you to stay monogamous'. The question is why? There's no incentive for either. If men want sex but the woman they are with don't wanna, its his choice to leave. Most men I know don't want commitment. That's fine. Its their choice. I just don't see a reason or way to incentivize them to stay, and I don't care. \nThe second part is you should be allowed to say a lot of things without getting arrested, and people should grow thicker skin.","192":"Look if you hate someone so much that you have have to ban them online for holding a different opinion, it is you with the problem.\n\nLike why do you take your time to harass a stranger? That's really sick. Its not that serious to be fighting over a comment.\n\nThen the downvoting barrage starts, with endless insults\n\nAll it shows how obsessed you are with them, and it makes you look bad.\n\nWhy not just block and mute?","193":"It's no secret that attraction is one of the key factors when looking for a partner. Men and women are no different in this aspect. But for some reason, I've seen men think they have some moral high ground over women's ideas of an attractive man. If a woman states that she wants a tall partner, she must be a shallow bitch and a terrible person.\n\nSo what if some women want a tall man. The same way weight is an indication of attraction for men, height is an indication of attraction for many women. Yet I’ve had heard men call women shallow bitchs and argue with them about wanting a tall guy and then turn around and claim that they don’t date fat women? Their argument was always that being fat shows your lifestyle and lack of restraint. As if that somehow made them more righteous.\n\nNow I know what you're going to say \"It's unfair, a woman can lose weight, short men can't just grow some inches!\" No it's not unfair, both are physical standards. Do you honestly think attraction is determined by which traits can be changed?\n\nAnd even if I were to agree, what do you want women to do? As far as I know, women can't simply change who they're attracted to. Should some women just pair up with men they don't feel attracted to, so things are fair?\n\nShort men what do you expect women to do?","194":"[removed]","195":"so, i just got done watching bill maher\\`s rant about stan lee and, i know i\\`m going to sound ridiculous for saying this, but i\\`m offended. i am utterly offended.\n\ni used to be a huge bill maher fan. i loved religulous and i loved his stand up. however, as a nerd, what maher said in his rant hit a little close to home with me because i am a nerd myself. i love comic books and i love to read and analyze them. i betcha that maher has never picked up a comic book in his life because if he had, he would be able to see the amount of effort and creativity that goes into a comic book. and he can just fuck right off with that bit about how comic books can\\`t be deep. seriously. there are many examples of deep comic books. watchmen, the sandman, kingdom come, etc. it\\`s perfectly fine for him to not care for the medium but that doesn\\`t give him the right to disparage people who do and to say that they should die(his words, not mine. \"i\\`m not happy stan lee is dead. i\\`m sad you\\`re alive\"). not only that he got super defensive in regards to kevin smith, his followers, and marvel(rightfully) calling him out for his disrespectful attitude. bill maher may not have disrespected stan lee but he did disrespect HIS ENTIRE BODY OF WORK. i know this sounds stupid but i can\\`t help but feel that maher was personally attacking me just because i don\\`t fight his idea of what an adult should be. yes i like comics and anime but i don\\`t let it interfere with living my life. i act my age, i work a job, i go out with friends. i am a perfectly normal person who just so happens to like comics. but according to maher, i\\`m a immature child and i deserve to die. i don\\`t know what was worse. the fact that he was looking for validation for his asshole attitude...or that he was FUCKING GETTING IT! if you watch the clip, the audience is rolling in the isle and even applauding at times. APPLAUDING!!!! shit like that just reminds me of how many assholes exist in the world.\n\nnot gonna lie. after i watched the clip, i got quite teary eyed. i rarely get my feelings hurt nowadays but that got me right in the heart. this has shown me who bill maher truly is. he is not a hilarious comedian and social commentator. he is a bully. plain and fucking simple. he is a bully. if someone doesn\\`t conform to his idea of a person, then he rips those people to shreds. he uses tragedies as an excuse to promote his own agendas. he is an asshole. quite frankly, i\\`m surprised that his show didn\\`t get cancelled after he wished DEATH on comic book fans. if i were the head of HBO, i would have forced him to apologize, after which i would have ended his show and removed all traces of it from HBO.\n\nbill maher, congratulations. you just lost a fan. i hope your little rant was worth it. may you never breed sir. god forbid your children become nerds.\n\nEDIT: ok, so it\\`s the day after i posted this and i\\`ve calmed down significantly. i am still kinda mad but my emotions were fresh when i posted this. you guys did make some very good points about how me wanting to cancel just because he has a different opinion then me is wrong. i do admit that what i said was wrong and it actually goes against my own principals.\n\ni am still angry and offended by maher and i do intend to never support him again but i no longer want to cancel him. instead, i\\`m just going to live my life the way I want to. i\\`m going to continue to read comics and just be geeky because that\\`s who i truly am at heart. and i don\\`t give a shit if bill maher doesn\\`t like me. i have lots of people in my life who DO like me for who i am.\n\nthey say the best revenge is a life well lived. well, i intend to live my life and i will live it well.","196":"My problem with these movements is not that I believe people should be mean with fat people. A person with respect will not do that.\n\nThe problem for me is that it is just focused on 1 characteristic.\n\nWhy not call it characteristic shaming? Why not apply it to age, bald men, short men, small penis, etc.?\n\nIf you make fun of a girl being fat you get crucified, however you can make small dick jokes all you want and shame guys for having a small danger, and no one will care.\n\nWhy the double Standards? That is what I do not agree. They act like fat women suffer more than x. But who are you to say that?\n\nIf you are going to apply to one group of people, why not apply the concept to all groups?\n\nThe moral should be: you should not shame people for their physical appearance. Not \"you should not shame exlusively fat women\". We should apply the concept, NOT the example.\n\nIt reminds of a South park episode, where Cartman got AIDS because it was the cool disease. But then it stopped being and cancer became the new cool disease and he lost all attention.\n\nWe should focus on the concept not on the example.\n\nIf you think shaming fat people is wrong, then you should apply to any other characteristics, and not just follow the new twitter #hashtag, to whatever one is trending.","197":"People are comparing their experience as a single person with no work experience to what their parents took decades to provide for them. Its entitlement. Yeah no shit you cant afford to buy a 4 bedroom 2k sq ft house in the suburbs that you grew up in being a single adult right out of college. Your parents couldnt have afforded that either. But they saved money, gained more skills and work experience so they could increase their income, built a stable marriage etc. Young people are naively expecting to be able to jump into the exact same living conditions as their parents that are 20-30 yrs older.","198":"Every time Disney has an LGBT character or YouTube bans a racist person, Conservatives lose their shit. They always claim that companies like Disney, Amazon, Google, etc have a “liberal bias.” That makes no sense - these companies openly exploit their workers, pay almost no taxes, and are extremely anti-union. They’re huge, multinational conglomerates - the kind that the entire left side is based on dismantling.\n\nI feel like Conservatives want to feel like they’re somehow the victim, despite having basically controlled US politics since the start. I figure this is because they realize they’re the side of racism and hate (their last leader was literally endorsed by the KKK), but that’s just my best guess.\n\nMaybe some of you guys can help me understand their claim?","199":"[removed]"},"comments":{"0":"<praw.models.comment_forest.CommentForest object at 0x0000017711515C88>","1":"<praw.models.comment_forest.CommentForest object at 0x00000177135BD748>","2":"<praw.models.comment_forest.CommentForest object at 0x00000177135BBCC0>","3":"<praw.models.comment_forest.CommentForest object at 0x000001770DBF3AC8>","4":"<praw.models.comment_forest.CommentForest object at 0x0000017713A3F7F0>","5":"<praw.models.comment_forest.CommentForest object at 0x000001770FD180F0>","6":"<praw.models.comment_forest.CommentForest object at 0x0000017714AF9C50>","7":"<praw.models.comment_forest.CommentForest object at 0x0000017714AD9320>","8":"<praw.models.comment_forest.CommentForest object at 0x00000177133C76D8>","9":"<praw.models.comment_forest.CommentForest object at 0x000001770FD1CE48>","10":"<praw.models.comment_forest.CommentForest object at 0x00000177135A01D0>","11":"<praw.models.comment_forest.CommentForest object at 0x0000017711956BE0>","12":"<praw.models.comment_forest.CommentForest object at 0x0000017714AF1B00>","13":"<praw.models.comment_forest.CommentForest object at 0x00000177133C0A58>","14":"<praw.models.comment_forest.CommentForest object at 0x0000017713371160>","15":"<praw.models.comment_forest.CommentForest object at 0x000001771687F080>","16":"<praw.models.comment_forest.CommentForest object at 0x000001771663CA20>","17":"<praw.models.comment_forest.CommentForest object at 0x0000017716633F60>","18":"<praw.models.comment_forest.CommentForest object at 0x00000177166EFFD0>","19":"<praw.models.comment_forest.CommentForest object at 0x000001771674B9B0>","20":"<praw.models.comment_forest.CommentForest object at 0x000001771674B710>","21":"<praw.models.comment_forest.CommentForest object at 0x000001771664E8D0>","22":"<praw.models.comment_forest.CommentForest object at 0x0000017716650E48>","23":"<praw.models.comment_forest.CommentForest object at 0x000001771665F7B8>","24":"<praw.models.comment_forest.CommentForest object at 0x000001771676B5C0>","25":"<praw.models.comment_forest.CommentForest object at 0x0000017716692518>","26":"<praw.models.comment_forest.CommentForest object at 0x000001771677E128>","27":"<praw.models.comment_forest.CommentForest object at 0x00000177169019E8>","28":"<praw.models.comment_forest.CommentForest object at 0x00000177169B0BA8>","29":"<praw.models.comment_forest.CommentForest object at 0x00000177169DEAC8>","30":"<praw.models.comment_forest.CommentForest object at 0x0000017716A1BF28>","31":"<praw.models.comment_forest.CommentForest object at 0x0000017716AD0438>","32":"<praw.models.comment_forest.CommentForest object at 0x0000017716B018D0>","33":"<praw.models.comment_forest.CommentForest object at 0x0000017716B5EA58>","34":"<praw.models.comment_forest.CommentForest object at 0x0000017716B75B00>","35":"<praw.models.comment_forest.CommentForest object at 0x0000017716B75160>","36":"<praw.models.comment_forest.CommentForest object at 0x0000017716BB85C0>","37":"<praw.models.comment_forest.CommentForest object at 0x0000017716BB0668>","38":"<praw.models.comment_forest.CommentForest object at 0x0000017716C7B748>","39":"<praw.models.comment_forest.CommentForest object at 0x0000017716B61EB8>","40":"<praw.models.comment_forest.CommentForest object at 0x0000017716C76E10>","41":"<praw.models.comment_forest.CommentForest object at 0x0000017716B5E2B0>","42":"<praw.models.comment_forest.CommentForest object at 0x0000017716CBB6D8>","43":"<praw.models.comment_forest.CommentForest object at 0x0000017716CCE588>","44":"<praw.models.comment_forest.CommentForest object at 0x0000017716C22208>","45":"<praw.models.comment_forest.CommentForest object at 0x0000017716C92358>","46":"<praw.models.comment_forest.CommentForest object at 0x0000017716CE5E48>","47":"<praw.models.comment_forest.CommentForest object at 0x0000017716D9B940>","48":"<praw.models.comment_forest.CommentForest object at 0x0000017716E13A20>","49":"<praw.models.comment_forest.CommentForest object at 0x0000017716C95240>","50":"<praw.models.comment_forest.CommentForest object at 0x0000017716CA9080>","51":"<praw.models.comment_forest.CommentForest object at 0x0000017716C7BEF0>","52":"<praw.models.comment_forest.CommentForest object at 0x0000017716B755C0>","53":"<praw.models.comment_forest.CommentForest object at 0x0000017716BF49B0>","54":"<praw.models.comment_forest.CommentForest object at 0x0000017716E1F7B8>","55":"<praw.models.comment_forest.CommentForest object at 0x0000017716DA9D68>","56":"<praw.models.comment_forest.CommentForest object at 0x0000017716E58828>","57":"<praw.models.comment_forest.CommentForest object at 0x0000017716E64BE0>","58":"<praw.models.comment_forest.CommentForest object at 0x0000017716E37BA8>","59":"<praw.models.comment_forest.CommentForest object at 0x0000017716E89550>","60":"<praw.models.comment_forest.CommentForest object at 0x0000017716E144A8>","61":"<praw.models.comment_forest.CommentForest object at 0x0000017716E938D0>","62":"<praw.models.comment_forest.CommentForest object at 0x0000017717070160>","63":"<praw.models.comment_forest.CommentForest object at 0x0000017716FE6AC8>","64":"<praw.models.comment_forest.CommentForest object at 0x0000017716FFAD68>","65":"<praw.models.comment_forest.CommentForest object at 0x0000017716FC1D30>","66":"<praw.models.comment_forest.CommentForest object at 0x00000177170247F0>","67":"<praw.models.comment_forest.CommentForest object at 0x000001771716A2E8>","68":"<praw.models.comment_forest.CommentForest object at 0x00000177171A94E0>","69":"<praw.models.comment_forest.CommentForest object at 0x0000017716DDDC50>","70":"<praw.models.comment_forest.CommentForest object at 0x0000017716E685F8>","71":"<praw.models.comment_forest.CommentForest object at 0x000001771717FEB8>","72":"<praw.models.comment_forest.CommentForest object at 0x00000177171D8080>","73":"<praw.models.comment_forest.CommentForest object at 0x00000177172E5588>","74":"<praw.models.comment_forest.CommentForest object at 0x00000177172D65C0>","75":"<praw.models.comment_forest.CommentForest object at 0x00000177172E5B70>","76":"<praw.models.comment_forest.CommentForest object at 0x0000017717096630>","77":"<praw.models.comment_forest.CommentForest object at 0x000001771717FDD8>","78":"<praw.models.comment_forest.CommentForest object at 0x00000177171C95F8>","79":"<praw.models.comment_forest.CommentForest object at 0x00000177171D8198>","80":"<praw.models.comment_forest.CommentForest object at 0x0000017717193978>","81":"<praw.models.comment_forest.CommentForest object at 0x00000177171E9710>","82":"<praw.models.comment_forest.CommentForest object at 0x00000177173C24A8>","83":"<praw.models.comment_forest.CommentForest object at 0x00000177171DC7B8>","84":"<praw.models.comment_forest.CommentForest object at 0x000001771719A7F0>","85":"<praw.models.comment_forest.CommentForest object at 0x000001771719A630>","86":"<praw.models.comment_forest.CommentForest object at 0x0000017717059978>","87":"<praw.models.comment_forest.CommentForest object at 0x00000177173FC908>","88":"<praw.models.comment_forest.CommentForest object at 0x00000177173A16D8>","89":"<praw.models.comment_forest.CommentForest object at 0x0000017717384908>","90":"<praw.models.comment_forest.CommentForest object at 0x00000177174AA048>","91":"<praw.models.comment_forest.CommentForest object at 0x0000017717509A58>","92":"<praw.models.comment_forest.CommentForest object at 0x00000177175689E8>","93":"<praw.models.comment_forest.CommentForest object at 0x00000177175D0860>","94":"<praw.models.comment_forest.CommentForest object at 0x00000177175DB898>","95":"<praw.models.comment_forest.CommentForest object at 0x00000177175274A8>","96":"<praw.models.comment_forest.CommentForest object at 0x00000177174B3C50>","97":"<praw.models.comment_forest.CommentForest object at 0x00000177186D4EF0>","98":"<praw.models.comment_forest.CommentForest object at 0x00000177187DC7B8>","99":"<praw.models.comment_forest.CommentForest object at 0x00000177186DA6D8>","100":"<praw.models.comment_forest.CommentForest object at 0x00000177187449E8>","101":"<praw.models.comment_forest.CommentForest object at 0x0000017717021438>","102":"<praw.models.comment_forest.CommentForest object at 0x0000017718823160>","103":"<praw.models.comment_forest.CommentForest object at 0x00000177188236A0>","104":"<praw.models.comment_forest.CommentForest object at 0x00000177188A0320>","105":"<praw.models.comment_forest.CommentForest object at 0x000001771888DD68>","106":"<praw.models.comment_forest.CommentForest object at 0x00000177188C5160>","107":"<praw.models.comment_forest.CommentForest object at 0x0000017718922438>","108":"<praw.models.comment_forest.CommentForest object at 0x0000017718936400>","109":"<praw.models.comment_forest.CommentForest object at 0x0000017718922EF0>","110":"<praw.models.comment_forest.CommentForest object at 0x0000017718948A58>","111":"<praw.models.comment_forest.CommentForest object at 0x00000177189C66A0>","112":"<praw.models.comment_forest.CommentForest object at 0x00000177189DA828>","113":"<praw.models.comment_forest.CommentForest object at 0x0000017718A4EC50>","114":"<praw.models.comment_forest.CommentForest object at 0x0000017718A69F60>","115":"<praw.models.comment_forest.CommentForest object at 0x0000017718AAFC50>","116":"<praw.models.comment_forest.CommentForest object at 0x0000017718A7B128>","117":"<praw.models.comment_forest.CommentForest object at 0x0000017718AED668>","118":"<praw.models.comment_forest.CommentForest object at 0x0000017718AD0828>","119":"<praw.models.comment_forest.CommentForest object at 0x0000017718B0C470>","120":"<praw.models.comment_forest.CommentForest object at 0x0000017718A18828>","121":"<praw.models.comment_forest.CommentForest object at 0x00000177189EB470>","122":"<praw.models.comment_forest.CommentForest object at 0x0000017718C15668>","123":"<praw.models.comment_forest.CommentForest object at 0x0000017718C557F0>","124":"<praw.models.comment_forest.CommentForest object at 0x0000017718C8CA90>","125":"<praw.models.comment_forest.CommentForest object at 0x0000017718C83A90>","126":"<praw.models.comment_forest.CommentForest object at 0x0000017718C9F048>","127":"<praw.models.comment_forest.CommentForest object at 0x0000017718C5FEB8>","128":"<praw.models.comment_forest.CommentForest object at 0x0000017718D656D8>","129":"<praw.models.comment_forest.CommentForest object at 0x0000017718C280B8>","130":"<praw.models.comment_forest.CommentForest object at 0x0000017718D10F60>","131":"<praw.models.comment_forest.CommentForest object at 0x0000017718D4D898>","132":"<praw.models.comment_forest.CommentForest object at 0x0000017718D41898>","133":"<praw.models.comment_forest.CommentForest object at 0x0000017718DD1748>","134":"<praw.models.comment_forest.CommentForest object at 0x0000017718E76278>","135":"<praw.models.comment_forest.CommentForest object at 0x0000017718F0D7F0>","136":"<praw.models.comment_forest.CommentForest object at 0x0000017718E9F4E0>","137":"<praw.models.comment_forest.CommentForest object at 0x0000017718F307B8>","138":"<praw.models.comment_forest.CommentForest object at 0x0000017718F9CBE0>","139":"<praw.models.comment_forest.CommentForest object at 0x0000017718FC9B00>","140":"<praw.models.comment_forest.CommentForest object at 0x0000017718E3C7F0>","141":"<praw.models.comment_forest.CommentForest object at 0x00000177190293C8>","142":"<praw.models.comment_forest.CommentForest object at 0x0000017719022E80>","143":"<praw.models.comment_forest.CommentForest object at 0x0000017719042DA0>","144":"<praw.models.comment_forest.CommentForest object at 0x0000017718CE0BE0>","145":"<praw.models.comment_forest.CommentForest object at 0x00000177190EEAC8>","146":"<praw.models.comment_forest.CommentForest object at 0x0000017718E415C0>","147":"<praw.models.comment_forest.CommentForest object at 0x0000017719054550>","148":"<praw.models.comment_forest.CommentForest object at 0x0000017718EB9668>","149":"<praw.models.comment_forest.CommentForest object at 0x0000017718E30438>","150":"<praw.models.comment_forest.CommentForest object at 0x0000017718EA1518>","151":"<praw.models.comment_forest.CommentForest object at 0x000001771A1E8198>","152":"<praw.models.comment_forest.CommentForest object at 0x000001771A231978>","153":"<praw.models.comment_forest.CommentForest object at 0x000001771A196D68>","154":"<praw.models.comment_forest.CommentForest object at 0x0000017718E1E208>","155":"<praw.models.comment_forest.CommentForest object at 0x000001771A27DDA0>","156":"<praw.models.comment_forest.CommentForest object at 0x000001771A1B6438>","157":"<praw.models.comment_forest.CommentForest object at 0x000001771A2D0898>","158":"<praw.models.comment_forest.CommentForest object at 0x000001771A2CE048>","159":"<praw.models.comment_forest.CommentForest object at 0x000001771A33B7F0>","160":"<praw.models.comment_forest.CommentForest object at 0x000001771A32C518>","161":"<praw.models.comment_forest.CommentForest object at 0x000001771A229E48>","162":"<praw.models.comment_forest.CommentForest object at 0x000001771A196E80>","163":"<praw.models.comment_forest.CommentForest object at 0x000001771A3BE9B0>","164":"<praw.models.comment_forest.CommentForest object at 0x000001771A44B6A0>","165":"<praw.models.comment_forest.CommentForest object at 0x000001771A42F6A0>","166":"<praw.models.comment_forest.CommentForest object at 0x000001771A41F828>","167":"<praw.models.comment_forest.CommentForest object at 0x000001771A42FB00>","168":"<praw.models.comment_forest.CommentForest object at 0x000001771A4ADE10>","169":"<praw.models.comment_forest.CommentForest object at 0x000001771A478DD8>","170":"<praw.models.comment_forest.CommentForest object at 0x000001771A4A2C88>","171":"<praw.models.comment_forest.CommentForest object at 0x000001771A48D518>","172":"<praw.models.comment_forest.CommentForest object at 0x000001771A5F9828>","173":"<praw.models.comment_forest.CommentForest object at 0x000001771A60AA58>","174":"<praw.models.comment_forest.CommentForest object at 0x000001771A5D8588>","175":"<praw.models.comment_forest.CommentForest object at 0x000001771A605400>","176":"<praw.models.comment_forest.CommentForest object at 0x000001771A60E2E8>","177":"<praw.models.comment_forest.CommentForest object at 0x000001771A62E048>","178":"<praw.models.comment_forest.CommentForest object at 0x000001771A6207F0>","179":"<praw.models.comment_forest.CommentForest object at 0x000001771A632B70>","180":"<praw.models.comment_forest.CommentForest object at 0x000001771A6F09E8>","181":"<praw.models.comment_forest.CommentForest object at 0x000001771A708A90>","182":"<praw.models.comment_forest.CommentForest object at 0x000001771A75E048>","183":"<praw.models.comment_forest.CommentForest object at 0x000001771A6F4DD8>","184":"<praw.models.comment_forest.CommentForest object at 0x000001771A782550>","185":"<praw.models.comment_forest.CommentForest object at 0x000001771A6B85C0>","186":"<praw.models.comment_forest.CommentForest object at 0x000001771A798B70>","187":"<praw.models.comment_forest.CommentForest object at 0x000001771A6920F0>","188":"<praw.models.comment_forest.CommentForest object at 0x000001771A68FA58>","189":"<praw.models.comment_forest.CommentForest object at 0x000001771A67FA58>","190":"<praw.models.comment_forest.CommentForest object at 0x000001771A7C3E80>","191":"<praw.models.comment_forest.CommentForest object at 0x000001771A7DB128>","192":"<praw.models.comment_forest.CommentForest object at 0x000001771A7E9860>","193":"<praw.models.comment_forest.CommentForest object at 0x000001771A7F4518>","194":"<praw.models.comment_forest.CommentForest object at 0x000001771A859A58>","195":"<praw.models.comment_forest.CommentForest object at 0x000001771A883F60>","196":"<praw.models.comment_forest.CommentForest object at 0x000001771A85E860>","197":"<praw.models.comment_forest.CommentForest object at 0x000001771A8C1668>","198":"<praw.models.comment_forest.CommentForest object at 0x000001771A95B2E8>","199":"<praw.models.comment_forest.CommentForest object at 0x000001771A981048>"}}