{"id":{"0":"q9sbqo","1":"q9l3im","2":"q9gnuy","3":"q9g9so","4":"q9dw85","5":"q9cntz","6":"q9b7ft","7":"q960a3","8":"q953xr","9":"q8vzh5","10":"q8v3b8","11":"q8ty8n","12":"q8q0f6","13":"q8lkun","14":"q8fam4","15":"q8etw7","16":"q8e0ba","17":"q8dh9n","18":"q8c468","19":"q86v1v","20":"q84vah","21":"q83ifr","22":"q82cps","23":"q80lsm","24":"q80d33","25":"q7sw4j","26":"q7r4o1","27":"q7glou","28":"q7fk9p","29":"q7ewrn","30":"q7e6hl","31":"q7ci5r","32":"q76pzo","33":"q765tx","34":"q74ggx","35":"q73a2r","36":"q7073z","37":"q6xqm0","38":"q6xck2","39":"q6uom3","40":"q6u3d3","41":"q6oyo0","42":"q6nrp0","43":"q6joaf","44":"q6jiqs","45":"q6dwh9","46":"q6dp79","47":"q67umv","48":"q66tbc","49":"q66kar","50":"q64xw4","51":"q5zljg","52":"q5z5x0","53":"q5yx8y","54":"q5ywb7","55":"q5wyo4","56":"q5sv5a","57":"q5p74n","58":"q5mrmb","59":"q5k1hp","60":"q5h62o","61":"q5af2x","62":"q54nyt","63":"q53s3l","64":"q4zmlq","65":"q4x0l7","66":"q4u9v7","67":"q4qlkx","68":"q4nwjn","69":"q4mw62","70":"q4md3g","71":"q4jgvo","72":"q4fzp4","73":"q4c4ru","74":"q4auf4","75":"q489ee","76":"q405x9","77":"q405g0","78":"q3tdw1","79":"q3s4q7","80":"q3mbfb","81":"q3jnhy","82":"q3j7b5","83":"q3fp90","84":"q3e26k","85":"q37xew","86":"q33nop","87":"q2w1dn","88":"q2v5sd","89":"q2or04","90":"q2oh0i","91":"q2odg5","92":"q2nlzo","93":"q278ze","94":"q22joe","95":"q1wlyc","96":"q1rnlq","97":"q1kykw","98":"q1hyu4","99":"q1fbo7","100":"q1cibc","101":"q163w8","102":"q15vw9","103":"q14uwm","104":"q0vjaa","105":"q0ub5k","106":"q0u0wn","107":"q0t2aw","108":"q0r79s","109":"q0r5jm","110":"q0qeop","111":"q0oxoa","112":"q0l2a4","113":"q0i98n","114":"q0ckxs","115":"q0b12p","116":"q04chi","117":"q01b0n","118":"q00nxq","119":"pzz4lt","120":"pzypvr","121":"pzxrds","122":"pzxmz3","123":"pzwz7v","124":"pzwjsn","125":"pzpiie","126":"pz8t2r","127":"pz8g9j","128":"pz81nx","129":"pz5u8x","130":"pz57s7","131":"pz130e","132":"pyyzqc","133":"pywd6v","134":"pywd2a","135":"pyvn5u","136":"pysnd4","137":"pyqx8u","138":"pyqla7","139":"pyn8eq","140":"py9jlq","141":"py83er","142":"pxvie8","143":"pxv1sd","144":"pxrz6p","145":"pxlztm","146":"pxledw","147":"pxglfd","148":"pxea7h","149":"pxbsne","150":"px5m7z","151":"px5lt2","152":"px53pc","153":"px406y","154":"px3oel","155":"px3kly","156":"pwv867","157":"pwt0e0","158":"pwiel8","159":"pwfj0a","160":"pw9ixq","161":"pw5uza","162":"pw0kei","163":"pvze0s","164":"pvv50j","165":"pvup0c","166":"pvtca2","167":"pvqf6n","168":"pvfxy3","169":"pvecoa","170":"pvecfc","171":"pv9wnz","172":"pv42ha","173":"pv2wab","174":"pv1hsq","175":"pv0f84","176":"pv05v3","177":"puy0uy","178":"puwumf","179":"putp8u","180":"puthzp","181":"puszgm","182":"pusyeu","183":"pur3vl","184":"puqrsw","185":"puoell","186":"puna7f","187":"pul000","188":"puhzzy","189":"pub7ks","190":"puaw69","191":"pu6k06","192":"pu6161","193":"ptzinu","194":"pty1ng","195":"ptxhp9","196":"ptwzbf","197":"ptv9de","198":"pttlsp","199":"pts58h","200":"ptq6po","201":"ptnjyb","202":"ptmfdb","203":"ptkep2","204":"ptb7lb","205":"pt6u1t","206":"pt62co","207":"pt52fs","208":"pt0450","209":"pszh2s","210":"psqqmu","211":"psqchu","212":"pspmvs","213":"psoyjn","214":"psmg20","215":"psi0ye","216":"pshe5t","217":"psfjb3","218":"psceqg","219":"psa4xk","220":"ps8nh3","221":"ps7qqv","222":"ps7n7o","223":"ps6a9r","224":"ps67kn","225":"ps2c5g","226":"ps0bg2","227":"prwgcr","228":"prwfqo","229":"prw8sf","230":"pruzgf","231":"pruqn8","232":"prs5e8","233":"prr5iw","234":"projue","235":"prlud0","236":"prioh4","237":"pr6aey","238":"pr64f9","239":"pr3nrm","240":"pr1n22","241":"pqzu27","242":"pqum81","243":"pqqi7s","244":"pqkhnz","245":"pqbz8l","246":"pq7hgy","247":"pq507t","248":"pq0iua","249":"pq0a9g","250":"pq02ev","251":"ppsr63","252":"ppp6zu","253":"ppowwr","254":"ppo6we","255":"ppl5gd","256":"ppkmhz","257":"ppi327","258":"pphmr3","259":"ppe2c4","260":"ppd7va","261":"ppc00d","262":"pp7csh","263":"pp76tr","264":"pp71ec","265":"pp5bdm","266":"pp2u3z","267":"pp0val","268":"pp0lsm","269":"poyt1t","270":"poy8q0","271":"poxny7","272":"pow7ha","273":"pohf82","274":"pof1uk","275":"podbhw","276":"poc9bj","277":"po92yj","278":"po4zkj","279":"pnx2qe","280":"pnvtja","281":"pnvq86","282":"pnvhyi","283":"pnv28u","284":"pnuug8","285":"pnr5mz","286":"pnhs1w","287":"pngk5q","288":"pndysy","289":"pndh8f","290":"pnbhz5","291":"pn857m","292":"pn718m","293":"pmyhy7","294":"pmx2xc","295":"pmu023","296":"pmsbi7","297":"pmriq2","298":"pmrc85","299":"pmppv7","300":"pmobxs","301":"pmju6n","302":"pmgqro","303":"pmg3ee","304":"pme498","305":"pmaaew"},"title":{"0":"[deleted by user]","1":"No one cares that you got banned from a subreddit because of your shitty opinion .","2":"If there is really a 'new world order', the new world is not 'liberalism'","3":"The unvaccinated should have to wear a yellow star on clothing.","4":"Long term relationships aren’t worth it.","5":"I hate games that takes place over several separate locations","6":"[deleted by user]","7":"[deleted by user]","8":"People who still think that the United States is a prudish country(at least in context of the Western world) need to get a fucking grip","9":"[deleted by user]","10":"[deleted by user]","11":"Nudity does equate to sex","12":"[deleted by user]","13":"If you're a Christian, abortion is a definite net good","14":"[deleted by user]","15":"[deleted by user]","16":"[deleted by user]","17":"[deleted by user]","18":"[deleted by user]","19":"[deleted by user]","20":"Trump is a Russian agent","21":"If you still think Trump beat Biden in the previous election, you shouldn’t be able to have a gun.","22":"It should be legal to sell children","23":"People who care about others wearing masks while driving alone in the car are as dumb as bricks.","24":"[deleted by user]","25":"My views on cancel culture","26":"Males who are in favor of traditional gender roles don’t deserve custody of their kids","27":"[deleted by user]","28":"[deleted by user]","29":"No one cares about westerns have to say about countries they have never been to","30":"People who lose on Price is Right are terminally stupid.","31":"[deleted by user]","32":"Flat butts > muscular butts obtained through squatting","33":"Can we please leave divisive issues out of r\/confidentlyincorrect?","34":"[deleted by user]","35":"[deleted by user]","36":"Leftist “progressives” don’t care about LGBTQ+ people, disabled people and people of color, they just want our votes.","37":"Right wingers have no idea what the left really is.","38":"[deleted by user]","39":"Relatively speaking in terms of wealth, this century in the western world (for most) is the best century, and things aren't getting worse","40":"Suicide should be considered a viable option for young people's futures just like college or the military are.","41":"[deleted by user]","42":"[deleted by user]","43":"Christopher Columbus did nothing wrong. He was a great explorer who dared to do what no one else had the guts to do.","44":"Doubting the existence of Jesus and James is anti-intellectual and bad history","45":"People who complain about the Texas abortion ban, why not just not have sex?","46":"[deleted by user]","47":"There is no clear answer to the issue of financial abortions","48":"[deleted by user]","49":"Fanny packs should be worn the other way around!","50":"Right wing racists are less hypocritical about their racism than left wing racists","51":"Weed (THC) is not a pain killer, I don't care how much you smoke or eat.","52":"\"Play stupid games win stupid prizes.\" is not nearly as clever or as funny as 99% of the people on reddit think it is.","53":"If men should be allowed to “financially abort” their responsibilities as a father, the women should be able to, too.","54":"This sub is just a cesspool for fake-conservatives and bigots","55":"There should be a mobile application that allows a man and a woman to sign abortion (physical and financial) BEFORE consummation of sexual act.","56":"It's time to permanently end all air travel except for emergencies.","57":"Rights and right and wrong are just opinions, and I think its important to acknowledge that.","58":"I think it is odd that interracial marriage is becoming less popular among younger Asian Americans","59":"I hate reddit.","60":"People who were victims of toxic or negative relationships (such as abuse or cheating) are in NO way shape or form to blame for their situation, and if you think they do, you're either ignorant or selfish.","61":"[deleted by user]","62":"There are too many guys here.","63":"The Michigan Militia is the most powerful faction in USA 🇺🇸 and the Michigan Militia can overthrow the government whenever they want.","64":"I like that people are refusing the vaccine mandates and losing their jobs.","65":"Google is as responsible for the Big Lie as Trump is.","66":"[deleted by user]","67":"I don't see a problem with people testing others in a relationship","68":"2016 was a great year for pop music","69":"Vigilante Justice is the best, most satisfying form of Justice.","70":"Justin Bieber is an overrated artist, and his music is just annoying.","71":"The world should go back to the British Pound or bet on Japaneese Yen as world reserve currency","72":"[deleted by user]","73":"Lightheartedly saying \"no luck!\" when a man has several daughters and not a son isn't misogyny.","74":"If the world was actually equal by gender, men would hate it","75":"Eating is a cruel and barbaric practice!","76":"[deleted by user]","77":"Joe Biden is the President of the United States.","78":"[deleted by user]","79":"People should ask for consent before kissing another person","80":"9\/11 wasn't that bad","81":"Facebook Is a Force For Good","82":"The Confederate States were part of the USA.","83":"[deleted by user]","84":"[deleted by user]","85":"[deleted by user]","86":"Dave Chappelle isn’t that funny anymore","87":"It's fine to be a landlord to pay your mortgages, but it shows lack of planning to rely heavily on renters","88":"I never met an atheist with a satisfying life.","89":"Capitalism isn't broken.","90":"You should be allowed to take up more than one seat on the train.","91":"The 2nd Amendment is important. Armed citizens are powerful even against the US military.","92":"All people who pick fruits carefully while shopping for grocery are eugenicists.","93":"Donald Trump and Joe Biden will be considered the most consequential presidents in the history of American politics","94":"So you’re opposed to abortion, no problem, I have a solution.","95":"This sub is boring because its full of MAGAtards and NPC liberals and little else.","96":"The western ''right'' is not right-wing at all, they are total cucks who can do nothing, but cave to the left on every single issue","97":"Sakurai, I don't like him, creator of Smash Bros, why is he glorified, I think he's a Bad Game director.","98":"If China's economy collapses, everyone that currently attributes its success to capitalism will say \"see? Socialism failed again\"","99":"Men forget women have to pay for things they don’t want all the time.","100":"I refuse to buy into the EV and electric lawn equipment hype. I'll stick with my gasoline engines.","101":"Rap music is bad and harmful to society","102":"If you’re buying a new car and it’s not all-electric, you’re an idiot at best, evil at worst.","103":"India in its current state should not be a partner for the US against China","104":"Pro-choice people on here sorta ignore me.","105":"[deleted by user]","106":"Ruth Bader Ginsberg spent her life on SCOTUS trying to promote equality for women. However, she insisted on staying on the bench til she died at 87, providing the Right with the needed seat to chip away at our rights, especially women's rights.","107":"France isn't really mad about the submarine deal, they're mad we're sharing vital technical secrets with Australia and not them","108":"People who don’t wear masks that work (Respirators, N95, K95) should be mocked relentlessly for demanding other people wear masks, when their own mask does nothing.","109":"Canadian servers don't have a reason to complain about not being tipped","110":"A weight-pass would do more to mitigate covid rates than a vaccine-pass","111":"We should cease all funding for AIDS research & treatment.","112":"[deleted by user]","113":"Anti-Vax\/Anti-Mask people dying of COVID is really funny to me","114":"[deleted by user]","115":"Shooting guns does not relieve stress or make me feel powerful","116":"[deleted by user]","117":"[deleted by user]","118":"[deleted by user]","119":"\"Restore patriarchy\" as a political party would poll at least 33% support","120":"Moms that raised the younger millennials & gen z boys weren’t good at raising men","121":"Funeral processions should be outlawed","122":"Scientists Are Overrated","123":"I'll watch movies even if it's bad or terrible or is leftist \"Propaganda\".","124":"As long as safety and finances isn't a concern, ultimatums in relationships are shitty, but that's about it, not controlling","125":"Taxation is theft","126":"America's only contribution to the world is media and spending an absurd amount of taxes on military to defend us developed nations","127":"Democracy in traditional meaning was never existed, because people doesn't have free will.","128":"There needs to be more support for pedophiles, especially for those who haven’t yet acted on their urges.","129":"Going to school is worse than working","130":"The democrats are the real racists","131":"[deleted by user]","132":"[deleted by user]","133":"PCM does a right wing problem","134":"I should be allowed to own an Abrams tank or F-22 Raptor","135":"Being religious is a form of degeneracy","136":"[deleted by user]","137":"[deleted by user]","138":"I'm convinced that the reason so many vaxxed people are pushy about other people getting it is that deep down they fear they made a big mistake.","139":"Free speech advocates should be in an uproar about CRT legislation.","140":"[deleted by user]","141":"I should be allowed to die.","142":"There really is no argument to be had about vegans. They’re right.","143":"You can't support both globalism AND global climate health.","144":"Old people (60+) shouldn't have the right to vote.","145":"Longing for a White Picket Fence Lifestyle is totally punk rock now","146":"[deleted by user]","147":"[deleted by user]","148":"[deleted by user]","149":"Coke, Pepsi, and most other soft drinks are awful","150":"The right is running out of reasonable people, because they keep canceling them all.","151":"I strongly dislike hip hop and rap music. (Except Nicki)","152":"[deleted by user]","153":"To kill or not to kill an unborn shouldn't be a matter of ''choice''- protecting his life should be a matter of basic human decency","154":"Hot girls who like horrorscopes makes my dick go placid.","155":"[deleted by user]","156":"[deleted by user]","157":"King Kong should get a female reboot called Queen Kong. The lead role should go to Elliott Page. The Gentleman in distress can be a Hemsworth.","158":"[deleted by user]","159":"Star Wars Visions should be canon!","160":"[deleted by user]","161":"You should require a license in order to vote","162":"The media is being arbitrarily harsh to litterers.","163":"Comparing lolicon to actual child porn is fucking disgusting and disrespectful","164":"Vegas should NOT be known as \"Sin City\" anymore","165":"A lot of peoples blaming the privileged class 'oppressing' the others is wrong, their problems wouldn't have existed if parents were smarter in their birthing choice","166":"HermanCainAward shouldn’t be a sub","167":"Inconvenient Fact: America, with all its problems, is still better than any other country out there. And a shills jealousy is obvious. Seethe bitches.","168":"I feel like people over react way to much to rape and pedophilia","169":"This pandemic proves that Americans don’t deserve democracy","170":"High school was way more fun and better than college","171":"People need to stop complaining about \"censorship on Reddit\"","172":"99.9% of the time you can find the truth in the first page of Google search results","173":"People who are anti vaccination and posting it on this sub are narcissistic, egocentric people who have this delusion that they're way too important to just reply to all the other anti vax posts here.","174":"Covid-19 was a good thing","175":"There is nothing wrong with using online medical advice when people can’t afford to see a real doctor","176":"If you don't have a job it's probably mostly your fault","177":"There's nothing wrong about being in a relationship and not actually loving your partner.","178":"As a wh*te m*le I’m skipping college","179":"Corporal punishment should be brought back in the Military","180":"[deleted by user]","181":"I don’t want robots to rule us","182":"Society isnt sexist, women just suck.","183":"If your in an abusive relationship, that’s on you","184":"Porn should be banned and ‘porn stars’ should be punished.","185":"[deleted by user]","186":"Cyprus is a Middle Eastern nation, their speaking Greek does not change this.","187":"Being pro corporal punishment is as anti-science as being anti-vax","188":"If you think women shouldn’t be pressured into a unwanted relationship with a man, but you also tell women to “just be gay huh huh!”, you are a hypocrite.","189":"Society has a very toxic rape culture that we just ignore","190":"The Solution To Global Warming Is Too Inconvenient","191":"r\/genzedong is a good subreddit.","192":"Politicians should be held accountable when police murder citizens.","193":"[deleted by user]","194":"[deleted by user]","195":"r\/HermanCainAward DOES NOT violate the Reddit ToS","196":"If you lose on Price is Right, I have news for you.","197":"Fortnite is a good fuckin game","198":"People complain about vegans because they feel insecure in their own diet choices","199":"[deleted by user]","200":"They always have an excuse ready","201":"[deleted by user]","202":"\"The Left\" doesn't want to cancel jokes","203":"Boyfriend country is good. It's not very musically impressive but it's a thousand times more likable then bro country. I'm saying this as a guy","204":"People quitting their job because they don’t want a vaccine is going to result in a more intelligent workforce","205":"The Asian century is a good thing","206":"[deleted by user]","207":"[deleted by user]","208":"It's morally acceptable for a politician in a representative democracy to act against the desires of their voters.","209":"[deleted by user]","210":"There will be a one world government soon.","211":"Discrimination by nationality is as bas as racism","212":"It’s unfortunate that the lessons we used to teach children are being ignored by adults.","213":"Those that are pro-vaccine mandates have become the side that is anti-science. Oh how the tables have turned","214":"[deleted by user]","215":"[deleted by user]","216":"Living in New Zealand seems like hell on earth. I'd rather live in Afghanistan.","217":"American conservatives have no core beliefs outside of just being the opposite of liberals","218":"\"Toughen Up!\", \"Don't Be So Stupid!\", Similar Phrases, is Victim-Blaming","219":"[deleted by user]","220":"[deleted by user]","221":"The Gabby incident is showing male privilege at it's finest.","222":"[deleted by user]","223":"Deflecting blame for being unvaccinated onto immigrants is bs as most of them came from Chile with higher vaccine rate than USA","224":"[deleted by user]","225":"Some people on social media can't stand the fact that others can feel happy about their own body\/personality. And it feels soo good to make them mad","226":"[deleted by user]","227":"People are too hateful towards China","228":"the MCU is underrated and they are actually really good movies","229":"Celebrity worship culture does not affect anyone in any way unless they let it","230":"Socialism never needed to be tied to authoritarianism","231":"I'd love to be involved in one of those sudden\/unplanned store looting scenarios.","232":"[deleted by user]","233":"[deleted by user]","234":"George St. Pierre was never a good mixed martial artist","235":"People who choose not to get vaccinated should get access to healthcare, however they should be at the end of the queue should they need hospitalization from Covid.","236":"Do you 2ant to know how stupid reddit is? Do you? Look at my post history.","237":"I support making abortion legal, but the logic that adults abstaining is a silly notion","238":"Majority of humans are unethical, bad parents, and 'shouldn't' be parents.","239":"Leftists and communists utilize a loophole in the worldview of the freeworld.","240":"The Texas abortion law is absolutely bonkers.","241":"Social Media on it's own isn't what's toxic - it's been the people who inhabit it","242":"Drinking out of a glass jar looks trashy.","243":"[deleted by user]","244":"[deleted by user]","245":"If society is in a great divide and you look around and see that you're standing on the side of the majority, history proves that you will be on the wrong side of history.","246":"Just because someone has a vastly different opinion than you that you find \"bad or immoral\" it doesnt mean you should downvote, insult, or call them a troll.","247":"Calling something toxic doesn’t make it a bad thing.","248":"There is no such thing as the Left, the Right, Democrats, Conservatives, etc. The sides was a ploy to get us divided.","249":"[deleted by user]","250":"You shouldn’t be force to be vaxxed, but then Hospitals should totally have a right to deny or deprioritize unvaxxed people","251":"[deleted by user]","252":"Degenerate and degeneracy are only used when you are against something but have no logical explanation as to why it’s wrong","253":"Natural immunity should be allowed as an exception to COVID vaccine mandates per new research.","254":"You are not supposed to \"do your own research\" on the vaccine. Professionals already did the research. The advice to DYOR, even coming from fully vaccinated people, is stupid and dangerous.","255":"[deleted by user]","256":"If you are healthy, especially if you are vaccinated and worried about getting covid you are a pussy. Also to anyone who isn't vaccinated but can get it quit being a little bitch and just get the shot. I don't give a shit about \"muh individual freedoms and rights\".","257":"Can we not post about america every 5 fucking seconds","258":"Body Positivity is super necessary for fat people","259":"There should be universal tax rates with the same rate for everyone at any income and there should be a max amount of money individual's are allowed to own and make (in let's say a year and I have no idea what that number should be like a million or something)","260":"We should pay people who don't want to get vaccinated so they accept to get the vaccine.","261":"Arranged marriage should become more popular in America and some other countries.","262":"this sub could be a lot better if political posts weren't allowed","263":"Eating food isn't enjoyable and is in fact a chore.","264":"[deleted by user]","265":"[deleted by user]","266":"Men aren't privileged. Women are!","267":"Rye chips are the worst part of Chex Mix.","268":"America should ignore China","269":"[deleted by user]","270":"If you use steroids, you have no right to judge someone who is fat","271":"Woman are uglier than men on average, to their respective opposite gender.","272":"America's education system is not more lazy or easy than anywhere else. Universities in America are infamous for being hell.","273":"Every \"breakthrough\" covid case has the same story with \"i wear a mask everywhere, social distance etc.\" If only these people could connect their 2 brain cells together.","274":"[deleted by user]","275":"Labour camps and human experimentation should be used as punishments for crimes.","276":"Men who are afraid of being accused of SA are anxious of their own problematic behaviour.","277":"Wokeness Isn't Ruining Movies","278":"[deleted by user]","279":"Stop acting like the environment is person.","280":"You can't claim to want voter ID to fight fraud if you are against automatic registration and sending everyone the ID free.","281":"Losers aren't bullied nearly enough","282":"I think it's funny how feminists are angry at transwomen taking over","283":"It makes me so angry that conservatives dismiss college as liberal indoctrination or adult daycare","284":"[deleted by user]","285":"Childless power-couples over the age of 35 need to pay substantially more taxes, because these people more than any other group are driving housing inflation","286":"\"Failure leads to success\" is stupid and wrong","287":"The idea to segregate based on gender (women's safe space) is as ridiculous as segregating based on ethnicity and goes against the idea of equality","288":"The downfall of this subreddit seems to be exclusively due to the actions of one controlling power mod...","289":"Anime is fucking cool","290":"Death in general isn’t funny, but some deaths are outright hilarious!","291":"Democrats would love trumps personality if he agreed with them.","292":"Financial Abortions Should Be Allowed For Men, But ONLY If They Agree To A Vasectomy","293":"Guys pls can we stop making posts about race and shit like boohoo we are most oppressed or boohoo these people aren't oppressed ect?","294":"This Subreddit Apparently Cares Less About Some Life-Changing\/Life-Threatening Issues Than Other, More Popular Ones","295":"[deleted by user]","296":"The Left justifies abortion based on a \"right to privacy\". Since when dies the Left care about privacy?","297":"“Mansplaining” is not a thing except in very rare and isolated instances","298":"Universal healthcare isn't feasible in the United States","299":"[deleted by user]","300":"Wedding's sound awful and I refuse to ever have one.","301":"[deleted by user]","302":"I’m ok with a vaccine mandate","303":"America seriously needs to move on from 9\/11.","304":"People who hate Wall Street are people who don't know how to invest.","305":"I didn't give a fuck 20 years ago, and I don't give a fuck today"},"author":{"0":null,"1":"kizi221","2":"WaterDemonPhoenix","3":"Vagina-Fertilizer","4":"HailOurPeople","5":"Salrit","6":null,"7":null,"8":"Cookiecuttermaxy","9":null,"10":null,"11":"PopRevolutionary1475","12":null,"13":"Caelus9","14":null,"15":null,"16":null,"17":null,"18":null,"19":null,"20":"dward_45","21":"ModsRCorrupt","22":null,"23":"ModsRCorrupt","24":null,"25":"Unsinkable_White","26":"wigsnatcher42","27":null,"28":null,"29":"undetectedwolverine","30":null,"31":null,"32":"ChildOfMah","33":"Arbiturr","34":null,"35":null,"36":"LoudTraining8485","37":"power_relay11","38":null,"39":"WaterDemonPhoenix","40":"ManliusMannusMaximus","41":null,"42":null,"43":"Believer109","44":"IanArcad","45":null,"46":null,"47":null,"48":null,"49":"gaudog","50":"WaterDemonPhoenix","51":null,"52":null,"53":"ModsRCorrupt","54":"NotSoFlugratte","55":"Noob_master_slayer","56":"Believer109","57":"donotholdyourbreath","58":null,"59":null,"60":"Mammoth_Western_2381","61":null,"62":"SlightlyStalkerish","63":null,"64":"TunaLurch","65":"Electrical-Ad-9797","66":null,"67":"WaterDemonPhoenix","68":"Iyzuku","69":"Believer109","70":"Sw3aty-Tryhard","71":"StargateRush","72":null,"73":"theinspector5","74":null,"75":"gaudog","76":null,"77":"ModsRCorrupt","78":null,"79":"catsinbananahats","80":"femboy_chungus","81":"Experiment_93711b","82":"Vagina-Fertilizer","83":null,"84":null,"85":null,"86":"sailor_reina","87":"WaterDemonPhoenix","88":"manohman420","89":"Connect-Zebra7173","90":"YoungQuahogMoney","91":null,"92":"Snoo68113","93":"Rahidoo","94":"bakingisscience","95":"UnpopularOpinionKing","96":"fyrylpot","97":"Glitch-Hex","98":"KingKronx","99":"bakingisscience","100":"Believer109","101":"Cowboysfan18","102":"ModsRCorrupt","103":"LordSaumya","104":"Icy_Consequence3200","105":null,"106":"DublinCheezie","107":"TriggurWarning","108":"ISOlatedLens","109":"donotholdyourbreath","110":null,"111":"fuckprecalc","112":null,"113":"squirrel7232","114":null,"115":"IronJackk","116":null,"117":null,"118":null,"119":null,"120":"candyapple_valentine","121":"MentallyIrregular","122":"deathbypepe","123":"angbhong342626","124":"WaterDemonPhoenix","125":"tossaway1145","126":"OnlyWLMx","127":"FrancescoVisconti","128":"Arkady2009","129":"Raxsodk","130":"kangchad","131":null,"132":null,"133":"Obnoxiousnessbot","134":"chair0147","135":"chair0147","136":null,"137":null,"138":"Believer109","139":"CheckYourCorners","140":null,"141":"Suicide_Omnicide","142":"sadatwalmart","143":"SchmulyWormberg","144":"69_-PussySlayer-_69","145":"IronJackk","146":null,"147":null,"148":null,"149":"Elevator_Operators","150":"ModsRCorrupt","151":null,"152":null,"153":"fyrylpot","154":null,"155":null,"156":null,"157":"Believer109","158":null,"159":"StargateRush","160":null,"161":"Impressive_Candy789","162":null,"163":"jvjtsetorp","164":"MentallyIrregular","165":"WaterDemonPhoenix","166":"u5ernam31234512345","167":"Doppler-Gaydar","168":"Brolylomaniac","169":"AdEasy819","170":"odd-ironball","171":"Truth_Speaker_1","172":"4thColour","173":"PeeFGee","174":"kangchad","175":"ja79732723","176":"Truth_Speaker_5","177":null,"178":"Obnoxiousnessbot","179":"decipiat","180":null,"181":"Obnoxiousnessbot","182":"Th3_sl33py_4rtist","183":"Shroomhunter93","184":null,"185":null,"186":"OddGuidance907","187":null,"188":"AcanthocephalaNo9441","189":"Throwawaytown33333","190":"Yarus43","191":"Luckyboy947","192":null,"193":null,"194":null,"195":null,"196":null,"197":"OnlyWLMx","198":"Caelus9","199":null,"200":"Unsinkable_White","201":null,"202":null,"203":"Iyzuku","204":"ModsRCorrupt","205":null,"206":null,"207":null,"208":"broji04","209":null,"210":"yunglegendd","211":"Caelus9","212":"unpopopinx","213":"cw9241","214":null,"215":null,"216":"Believer109","217":"4thColour","218":"filrabat","219":null,"220":null,"221":"Andalib_Odulate","222":null,"223":"Electrical-Ad-9797","224":null,"225":null,"226":null,"227":"Obnoxiousnessbot","228":"MotuPatlu34","229":"donotholdyourbreath","230":"Ok_Cupcake8963","231":"Believer109","232":null,"233":null,"234":null,"235":"dada_georges360","236":null,"237":"donotholdyourbreath","238":"WaterDemonPhoenix","239":null,"240":"dward_45","241":null,"242":"gaudog","243":null,"244":null,"245":"cw9241","246":"zmasterv","247":"unpopopinx","248":null,"249":null,"250":null,"251":null,"252":null,"253":"cw9241","254":"darwinlovestrees","255":null,"256":"Psychological-Sign71","257":"kizi221","258":"Caelus9","259":"pistasojka","260":null,"261":"Germain3986","262":"_henjin","263":"laidlyworm","264":null,"265":null,"266":"Th3_sl33py_4rtist","267":"thevilestplume","268":"Obnoxiousnessbot","269":null,"270":"finnjakefionnacake","271":"Chance-Dealer6319","272":"Critical_Ad_2191","273":"Believer109","274":null,"275":"zmasterv","276":"bakingisscience","277":null,"278":null,"279":"InnocentPerv93","280":"Andalib_Odulate","281":null,"282":"Salrit","283":"Critical_Ad_2191","284":null,"285":"TriggurWarning","286":"Critical_Ad_2191","287":"donotholdyourbreath","288":"Believer109","289":"YoureUpNova","290":"cindybubbles","291":"broji04","292":"Ilp771","293":"The9ofU","294":"Shadowkits","295":null,"296":null,"297":"OddGuidance907","298":"Drayko2001","299":null,"300":"Andalib_Odulate","301":null,"302":"Orginal_Ricardo","303":"MySockHurts","304":"gaudog","305":"MentallyIrregular"},"created_utc":{"0":1634447610.0,"1":1634419977.0,"2":1634405851.0,"3":1634404610.0,"4":1634397087.0,"5":1634393075.0,"6":1634387998.0,"7":1634363583.0,"8":1634359623.0,"9":1634327281.0,"10":1634324533.0,"11":1634321083.0,"12":1634309375.0,"13":1634293658.0,"14":1634267220.0,"15":1634265626.0,"16":1634262861.0,"17":1634261070.0,"18":1634256352.0,"19":1634239666.0,"20":1634233694.0,"21":1634229710.0,"22":1634226273.0,"23":1634220899.0,"24":1634220155.0,"25":1634187847.0,"26":1634181030.0,"27":1634147420.0,"28":1634144432.0,"29":1634142605.0,"30":1634140569.0,"31":1634135726.0,"32":1634113654.0,"33":1634110907.0,"34":1634103108.0,"35":1634098412.0,"36":1634087395.0,"37":1634079114.0,"38":1634077862.0,"39":1634069745.0,"40":1634067980.0,"41":1634053212.0,"42":1634049879.0,"43":1634036670.0,"44":1634036107.0,"45":1634012259.0,"46":1634011560.0,"47":1633992291.0,"48":1633989237.0,"49":1633988509.0,"50":1633983984.0,"51":1633969505.0,"52":1633968338.0,"53":1633967724.0,"54":1633967653.0,"55":1633962218.0,"56":1633947854.0,"57":1633930884.0,"58":1633921254.0,"59":1633911078.0,"60":1633901217.0,"61":1633880399.0,"62":1633857539.0,"63":1633853074.0,"64":1633834063.0,"65":1633823728.0,"66":1633814277.0,"67":1633802774.0,"68":1633794491.0,"69":1633791288.0,"70":1633789531.0,"71":1633778889.0,"72":1633762498.0,"73":1633745413.0,"74":1633740495.0,"75":1633731622.0,"76":1633707190.0,"77":1633707148.0,"78":1633680848.0,"79":1633674837.0,"80":1633652514.0,"81":1633643667.0,"82":1633642286.0,"83":1633632255.0,"84":1633627586.0,"85":1633609432.0,"86":1633590874.0,"87":1633562373.0,"88":1633559462.0,"89":1633539933.0,"90":1633539127.0,"91":1633538844.0,"92":1633536545.0,"93":1633472959.0,"94":1633458658.0,"95":1633441236.0,"96":1633420628.0,"97":1633399394.0,"98":1633389455.0,"99":1633381845.0,"100":1633374496.0,"101":1633356347.0,"102":1633355619.0,"103":1633352089.0,"104":1633311251.0,"105":1633306775.0,"106":1633305793.0,"107":1633302487.0,"108":1633296413.0,"109":1633296264.0,"110":1633294004.0,"111":1633289561.0,"112":1633278072.0,"113":1633269476.0,"114":1633244071.0,"115":1633236897.0,"116":1633211779.0,"117":1633201630.0,"118":1633199509.0,"119":1633194422.0,"120":1633193118.0,"121":1633190003.0,"122":1633189583.0,"123":1633187465.0,"124":1633186090.0,"125":1633154356.0,"126":1633097351.0,"127":1633096300.0,"128":1633095015.0,"129":1633086960.0,"130":1633084226.0,"131":1633064734.0,"132":1633056682.0,"133":1633047332.0,"134":1633047320.0,"135":1633044857.0,"136":1633035194.0,"137":1633029884.0,"138":1633028881.0,"139":1633018903.0,"140":1632965688.0,"141":1632960565.0,"142":1632922478.0,"143":1632920984.0,"144":1632908649.0,"145":1632883015.0,"146":1632880967.0,"147":1632865061.0,"148":1632858580.0,"149":1632851413.0,"150":1632833148.0,"151":1632833107.0,"152":1632831354.0,"153":1632827161.0,"154":1632825854.0,"155":1632825405.0,"156":1632791566.0,"157":1632784160.0,"158":1632753362.0,"159":1632743991.0,"160":1632716224.0,"161":1632702430.0,"162":1632684541.0,"163":1632680846.0,"164":1632667263.0,"165":1632665809.0,"166":1632661122.0,"167":1632647910.0,"168":1632605209.0,"169":1632599993.0,"170":1632599969.0,"171":1632586533.0,"172":1632565074.0,"173":1632559328.0,"174":1632552514.0,"175":1632547489.0,"176":1632546355.0,"177":1632537719.0,"178":1632533171.0,"179":1632521331.0,"180":1632520671.0,"181":1632518909.0,"182":1632518817.0,"183":1632512700.0,"184":1632511629.0,"185":1632504094.0,"186":1632500679.0,"187":1632493841.0,"188":1632483775.0,"189":1632453388.0,"190":1632452294.0,"191":1632436897.0,"192":1632435233.0,"193":1632416130.0,"194":1632411944.0,"195":1632410346.0,"196":1632408878.0,"197":1632403636.0,"198":1632398304.0,"199":1632392236.0,"200":1632382954.0,"201":1632371372.0,"202":1632367090.0,"203":1632359792.0,"204":1632328097.0,"205":1632314940.0,"206":1632312159.0,"207":1632308319.0,"208":1632285773.0,"209":1632283278.0,"210":1632254548.0,"211":1632253399.0,"212":1632251342.0,"213":1632249368.0,"214":1632242107.0,"215":1632228447.0,"216":1632226072.0,"217":1632217803.0,"218":1632202513.0,"219":1632193591.0,"220":1632188165.0,"221":1632184972.0,"222":1632184627.0,"223":1632179878.0,"224":1632179636.0,"225":1632167453.0,"226":1632161278.0,"227":1632149490.0,"228":1632149437.0,"229":1632148841.0,"230":1632144759.0,"231":1632143977.0,"232":1632134154.0,"233":1632129442.0,"234":1632116363.0,"235":1632105025.0,"236":1632092941.0,"237":1632051244.0,"238":1632050454.0,"239":1632037634.0,"240":1632027447.0,"241":1632019531.0,"242":1631999493.0,"243":1631985580.0,"244":1631963329.0,"245":1631923856.0,"246":1631908652.0,"247":1631900802.0,"248":1631886592.0,"249":1631885761.0,"250":1631884961.0,"251":1631850731.0,"252":1631836988.0,"253":1631835966.0,"254":1631833396.0,"255":1631823344.0,"256":1631821758.0,"257":1631813980.0,"258":1631812568.0,"259":1631801483.0,"260":1631798581.0,"261":1631793911.0,"262":1631770930.0,"263":1631770166.0,"264":1631769451.0,"265":1631762268.0,"266":1631753022.0,"267":1631746010.0,"268":1631745120.0,"269":1631739411.0,"270":1631737648.0,"271":1631735894.0,"272":1631731344.0,"273":1631673821.0,"274":1631665040.0,"275":1631658896.0,"276":1631655425.0,"277":1631645738.0,"278":1631633189.0,"279":1631599449.0,"280":1631593743.0,"281":1631593345.0,"282":1631592434.0,"283":1631590707.0,"284":1631589876.0,"285":1631576296.0,"286":1631547032.0,"287":1631543298.0,"288":1631534458.0,"289":1631532347.0,"290":1631522423.0,"291":1631506349.0,"292":1631501999.0,"293":1631472296.0,"294":1631467792.0,"295":1631458032.0,"296":1631451856.0,"297":1631448470.0,"298":1631447685.0,"299":1631439410.0,"300":1631432021.0,"301":1631411416.0,"302":1631399030.0,"303":1631396703.0,"304":1631389740.0,"305":1631377026.0},"score":{"0":1,"1":4,"2":5,"3":0,"4":0,"5":2,"6":3,"7":0,"8":14,"9":0,"10":0,"11":0,"12":0,"13":0,"14":1,"15":0,"16":0,"17":0,"18":3,"19":0,"20":3,"21":9,"22":0,"23":5,"24":1,"25":10,"26":0,"27":0,"28":0,"29":7,"30":0,"31":0,"32":5,"33":0,"34":6,"35":8,"36":18,"37":11,"38":0,"39":8,"40":7,"41":0,"42":15,"43":1,"44":0,"45":4,"46":3,"47":0,"48":0,"49":4,"50":6,"51":5,"52":3,"53":10,"54":21,"55":3,"56":0,"57":0,"58":8,"59":8,"60":5,"61":0,"62":0,"63":0,"64":7,"65":0,"66":0,"67":0,"68":0,"69":7,"70":22,"71":0,"72":0,"73":7,"74":0,"75":0,"76":0,"77":0,"78":0,"79":21,"80":0,"81":0,"82":0,"83":3,"84":0,"85":0,"86":18,"87":1,"88":0,"89":9,"90":0,"91":5,"92":0,"93":16,"94":0,"95":5,"96":45,"97":5,"98":5,"99":5,"100":5,"101":0,"102":0,"103":2,"104":3,"105":2,"106":0,"107":35,"108":2,"109":5,"110":5,"111":0,"112":0,"113":1,"114":1,"115":15,"116":5,"117":0,"118":0,"119":0,"120":36,"121":17,"122":0,"123":11,"124":1,"125":0,"126":0,"127":3,"128":4,"129":15,"130":3,"131":0,"132":1,"133":2,"134":15,"135":0,"136":0,"137":11,"138":0,"139":0,"140":0,"141":24,"142":118,"143":12,"144":0,"145":11,"146":3,"147":0,"148":0,"149":6,"150":5,"151":14,"152":1,"153":0,"154":10,"155":0,"156":3,"157":16,"158":3,"159":2,"160":5,"161":11,"162":0,"163":2,"164":0,"165":8,"166":17,"167":66,"168":0,"169":0,"170":0,"171":0,"172":0,"173":11,"174":0,"175":4,"176":0,"177":27,"178":0,"179":0,"180":0,"181":12,"182":0,"183":0,"184":0,"185":3,"186":5,"187":30,"188":0,"189":17,"190":0,"191":0,"192":4,"193":0,"194":0,"195":23,"196":0,"197":0,"198":16,"199":32,"200":3,"201":0,"202":5,"203":1,"204":25,"205":0,"206":0,"207":3,"208":9,"209":1,"210":0,"211":14,"212":10,"213":3,"214":1,"215":0,"216":43,"217":0,"218":3,"219":0,"220":10,"221":0,"222":9,"223":0,"224":0,"225":11,"226":0,"227":0,"228":3,"229":0,"230":7,"231":0,"232":0,"233":0,"234":10,"235":0,"236":0,"237":4,"238":6,"239":21,"240":31,"241":3,"242":0,"243":2,"244":0,"245":0,"246":1,"247":3,"248":0,"249":0,"250":56,"251":2,"252":8,"253":10,"254":14,"255":0,"256":0,"257":10,"258":40,"259":0,"260":0,"261":0,"262":3,"263":29,"264":4,"265":1,"266":179,"267":9,"268":4,"269":0,"270":9,"271":0,"272":0,"273":0,"274":0,"275":0,"276":3,"277":1,"278":16,"279":27,"280":8,"281":0,"282":0,"283":0,"284":0,"285":0,"286":0,"287":13,"288":1,"289":4,"290":4,"291":19,"292":6,"293":15,"294":2,"295":7,"296":0,"297":9,"298":0,"299":18,"300":5,"301":1,"302":42,"303":0,"304":8,"305":0},"upvote_ratio":{"0":0.53,"1":0.54,"2":0.61,"3":0.22,"4":0.33,"5":0.63,"6":0.64,"7":0.5,"8":0.7,"9":0.39,"10":0.25,"11":0.35,"12":0.4,"13":0.45,"14":0.6,"15":0.41,"16":0.41,"17":0.45,"18":0.64,"19":0.41,"20":0.56,"21":0.64,"22":0.5,"23":0.59,"24":0.6,"25":0.7,"26":0.35,"27":0.32,"28":0.41,"29":0.64,"30":0.4,"31":0.5,"32":0.56,"33":0.33,"34":0.62,"35":0.67,"36":0.7,"37":0.62,"38":0.36,"39":0.64,"40":0.65,"41":0.44,"42":0.63,"43":0.52,"44":0.35,"45":0.52,"46":0.57,"47":0.47,"48":0.2,"49":0.7,"50":0.59,"51":0.61,"52":0.57,"53":0.6,"54":0.61,"55":0.57,"56":0.38,"57":0.4,"58":0.7,"59":0.66,"60":0.6,"61":0.44,"62":0.44,"63":0.36,"64":0.55,"65":0.27,"66":0.43,"67":0.43,"68":0.5,"69":0.68,"70":0.66,"71":0.47,"72":0.5,"73":0.62,"74":0.37,"75":0.5,"76":0.36,"77":0.44,"78":0.45,"79":0.67,"80":0.29,"81":0.43,"82":0.5,"83":0.55,"84":0.41,"85":0.41,"86":0.67,"87":0.54,"88":0.42,"89":0.67,"90":0.33,"91":0.6,"92":0.5,"93":0.68,"94":0.48,"95":0.58,"96":0.63,"97":0.7,"98":0.59,"99":0.56,"100":0.59,"101":0.41,"102":0.35,"103":0.54,"104":0.6,"105":0.58,"106":0.39,"107":0.66,"108":0.54,"109":0.7,"110":0.59,"111":0.3,"112":0.43,"113":0.51,"114":0.53,"115":0.69,"116":0.67,"117":0.38,"118":0.2,"119":0.27,"120":0.68,"121":0.7,"122":0.33,"123":0.67,"124":0.54,"125":0.5,"126":0.47,"127":0.62,"128":0.6,"129":0.63,"130":0.53,"131":0.42,"132":0.53,"133":0.53,"134":0.69,"135":0.46,"136":0.48,"137":0.68,"138":0.4,"139":0.5,"140":0.44,"141":0.69,"142":0.63,"143":0.7,"144":0.36,"145":0.69,"146":0.59,"147":0.5,"148":0.4,"149":0.64,"150":0.56,"151":0.69,"152":0.53,"153":0.45,"154":0.67,"155":0.36,"156":0.67,"157":0.64,"158":0.6,"159":0.63,"160":0.56,"161":0.69,"162":0.4,"163":0.55,"164":0.44,"165":0.63,"166":0.68,"167":0.66,"168":0.25,"169":0.41,"170":0.43,"171":0.38,"172":0.5,"173":0.55,"174":0.21,"175":0.56,"176":0.32,"177":0.69,"178":0.5,"179":0.33,"180":0.38,"181":0.64,"182":0.38,"183":0.22,"184":0.47,"185":0.57,"186":0.65,"187":0.63,"188":0.4,"189":0.65,"190":0.47,"191":0.4,"192":0.67,"193":0.3,"194":0.38,"195":0.68,"196":0.44,"197":0.44,"198":0.57,"199":0.67,"200":0.55,"201":0.38,"202":0.57,"203":0.54,"204":0.58,"205":0.38,"206":0.45,"207":0.58,"208":0.62,"209":0.54,"210":0.3,"211":0.68,"212":0.66,"213":0.54,"214":0.51,"215":0.43,"216":0.62,"217":0.45,"218":0.56,"219":0.25,"220":0.65,"221":0.42,"222":0.6,"223":0.46,"224":0.5,"225":0.68,"226":0.42,"227":0.38,"228":0.57,"229":0.47,"230":0.61,"231":0.36,"232":0.47,"233":0.48,"234":0.67,"235":0.5,"236":0.42,"237":0.63,"238":0.64,"239":0.61,"240":0.7,"241":0.62,"242":0.4,"243":0.57,"244":0.46,"245":0.47,"246":0.52,"247":0.6,"248":0.48,"249":0.43,"250":0.61,"251":0.56,"252":0.65,"253":0.62,"254":0.65,"255":0.5,"256":0.48,"257":0.66,"258":0.68,"259":0.47,"260":0.5,"261":0.22,"262":0.54,"263":0.69,"264":0.56,"265":0.52,"266":0.7,"267":0.7,"268":0.62,"269":0.33,"270":0.68,"271":0.5,"272":0.47,"273":0.5,"274":0.44,"275":0.43,"276":0.53,"277":0.51,"278":0.6,"279":0.63,"280":0.6,"281":0.38,"282":0.35,"283":0.42,"284":0.33,"285":0.42,"286":0.21,"287":0.63,"288":0.51,"289":0.55,"290":0.63,"291":0.69,"292":0.58,"293":0.67,"294":0.6,"295":0.55,"296":0.46,"297":0.61,"298":0.41,"299":0.66,"300":0.61,"301":0.52,"302":0.62,"303":0.47,"304":0.6,"305":0.46},"num_comments":{"0":11,"1":33,"2":39,"3":18,"4":25,"5":17,"6":5,"7":17,"8":22,"9":45,"10":8,"11":14,"12":5,"13":115,"14":7,"15":18,"16":13,"17":9,"18":38,"19":89,"20":20,"21":168,"22":13,"23":23,"24":6,"25":17,"26":16,"27":6,"28":11,"29":10,"30":6,"31":6,"32":12,"33":60,"34":20,"35":12,"36":37,"37":62,"38":15,"39":13,"40":21,"41":14,"42":52,"43":24,"44":17,"45":82,"46":7,"47":79,"48":10,"49":8,"50":6,"51":18,"52":7,"53":67,"54":78,"55":12,"56":22,"57":5,"58":15,"59":8,"60":8,"61":20,"62":35,"63":5,"64":107,"65":11,"66":30,"67":6,"68":8,"69":12,"70":17,"71":7,"72":7,"73":7,"74":29,"75":8,"76":46,"77":101,"78":15,"79":48,"80":49,"81":9,"82":86,"83":7,"84":37,"85":10,"86":33,"87":33,"88":44,"89":27,"90":11,"91":19,"92":21,"93":26,"94":101,"95":17,"96":209,"97":5,"98":6,"99":79,"100":50,"101":12,"102":34,"103":28,"104":61,"105":11,"106":12,"107":46,"108":17,"109":9,"110":15,"111":14,"112":17,"113":188,"114":11,"115":94,"116":10,"117":14,"118":7,"119":32,"120":61,"121":21,"122":11,"123":8,"124":6,"125":12,"126":10,"127":17,"128":61,"129":36,"130":65,"131":33,"132":36,"133":9,"134":39,"135":29,"136":39,"137":20,"138":115,"139":196,"140":26,"141":86,"142":729,"143":8,"144":22,"145":28,"146":23,"147":5,"148":6,"149":15,"150":38,"151":6,"152":19,"153":121,"154":11,"155":11,"156":10,"157":14,"158":15,"159":9,"160":47,"161":43,"162":33,"163":53,"164":37,"165":19,"166":84,"167":221,"168":29,"169":97,"170":9,"171":25,"172":35,"173":68,"174":5,"175":8,"176":39,"177":28,"178":7,"179":10,"180":22,"181":29,"182":27,"183":8,"184":92,"185":16,"186":11,"187":64,"188":11,"189":42,"190":15,"191":77,"192":14,"193":27,"194":67,"195":57,"196":10,"197":5,"198":630,"199":49,"200":10,"201":9,"202":94,"203":9,"204":186,"205":19,"206":9,"207":24,"208":26,"209":8,"210":24,"211":43,"212":14,"213":71,"214":67,"215":51,"216":58,"217":34,"218":53,"219":8,"220":28,"221":27,"222":33,"223":13,"224":16,"225":12,"226":26,"227":13,"228":14,"229":6,"230":37,"231":62,"232":23,"233":80,"234":5,"235":44,"236":9,"237":53,"238":5,"239":98,"240":48,"241":11,"242":15,"243":11,"244":10,"245":12,"246":124,"247":52,"248":40,"249":29,"250":276,"251":7,"252":43,"253":23,"254":56,"255":15,"256":11,"257":18,"258":94,"259":86,"260":72,"261":5,"262":24,"263":37,"264":98,"265":15,"266":281,"267":11,"268":11,"269":28,"270":12,"271":14,"272":23,"273":54,"274":28,"275":12,"276":81,"277":91,"278":45,"279":45,"280":16,"281":18,"282":7,"283":36,"284":9,"285":66,"286":7,"287":39,"288":55,"289":16,"290":5,"291":20,"292":45,"293":15,"294":6,"295":160,"296":26,"297":26,"298":46,"299":44,"300":9,"301":14,"302":243,"303":88,"304":11,"305":59},"selftext":{"0":"[removed]","1":"if you post here saying you got banned from a certain subreddit for saying a certain opinion . im honestly just not gonna give a fuck about your post it makes you look like a complete idiot the community you got banned from shouldn't be witch hunted . getting intentionally banned from a subreddit is showing that your a complete loser yes some moderation teams are bad but i shouldn't waste my time clicking on a cry baby . most of your opinions are popular anyways this subreddit shouldn't fuel hate of other subreddits .","2":"It's funny how some people think that there is a 'new world order' that wants everyone to be gay or whatever conspiracy theory people come up it. Maybe USA is gearing towards that, maybe even western nation, but definitely not the entire world. If that did happen, countries wouldn't be over taken by the Taliban. Countries wouldn't be upping their punishments on 'liberalism'.   \nI just find the fear of 'liberalism' all very weird. I'm much scared of radical right wing Muslims than I am of the left. Don't get me wrong, left wing authoritarians that want to ban everything are very scary, but I'd say if they are a 99, the extreme conservatives (like Taliban) are a 100.","3":"[removed]","4":"The longer they last, the more bored and irritated you’ll be with the person. Also, you need to sacrifice all other potential love interests. Why would you pass up so many exciting opportunities\n\nIt’s way more satisfying to have an endless lineup of casual lovers. I can’t think of any significant advantage to serious relationships. Why be tied down when you could be with whoever you want whenever you like?","5":"A game should be like Half-Life (linear), Metal Gear Solid (open areas, but linear story), Knights of the Old Republic (partially linear, partially open areas, and a story you can affect), or Elder Scrolls (open world, and open mission structure). \n\nWhat I hate is games that are like Metal Gear Solid 5, or the countless Call of Duty games. They consist of separate missions, and everything reset after each mission. The only two games that ever pulled this off is the original Halo and the 2016 Doom, and that is just because the whole game mechanics of Halo and Doom lends itself to individual missions. Halo and Doom aren't games about planning things well in advance, it's about raw combat.","6":"[removed]","7":"[removed]","8":"I think the first impressions that come to people's mind about the United States being a righteously prudish country are formed more thru media exposure and not actually thru living here. Also, by what metrics is Europe anymore sexually liberal? Porn is literally a black market in Poland, France has already considered limiting public access to nudist resorts, the UK awhile back banned skirts in public schools (didn't successfully get voted in, so its pointless citing that one), what about when Swedes took outrage to this kids' song about genitals themselves, while literally more Americans were actually showing support [see for yourself ](https:\/\/youtu.be\/yo_kW2jp63Q)\n\nIs America still to some degrees sexually repressive? Oh absolutely\n\nBut to what degree is the prudishness really in base American culture and not an influence from the puritans? Who LITERALLY CAME FROM BRITAIN \n\nYeah I remember the nipple outrage in the Super Bowl, I remember when hardcore conservatives back in the 90s wanted to ban porn, along with video games,  I remember when far right puriniticals complained about a gay wedding cake(which I changed my stance on completely)\n\nBut guess what? America, is a land of diversity of thought. This is because we're not a democracy, but a republic (traditionally speaking anyway). Meanwhile how many counties in Europe still don't have gay marriage legalized or reformed into the system? Also, in what country did a rape conviction happen simply because a guy's condom slipped out of during sex? For those [wondering] (https:\/\/www.usatoday.com\/story\/news\/world\/2017\/01\/13\/man-guilty-rape-taking-condom-off-during-sex\/96533796\/)\n\nAlso how many countries in Europe don't need to have a formal dress code with uniforms? I'll wait","9":"[removed]","10":"[removed]","11":"I love how nudists like to say how sex and nudity don't go hand to hand.\n\nYes it does. Why do you think men wear the ring around their penis? Its to stop their penis from getting woody.\n\nThere was a reason why it was made illegal to be naked. Because people get aroused by naked bodies.\n\nCan't no one convince me otherwise.","12":"[removed]","13":"In Christian theology, we are all sinners, bound for hell because of our wicked ways. Thankfully, Jesus died, and for some reason, that means if we accept him as our saviour, our souls are saved. This is true no matter what you've done. You could've spent your life persecuting Christians, murdering, raping, molesting, any of the most evil crimes, but if you ask Jesus Christ for forgiveness and to be your saviour, you're heaven bound by his mercy.\n\nHowever, one thing common in all the variants of Christianity I've seen is that fetuses, incapable of getting baptized or asking for forgiveness, go to heaven if they die, be it by miscarriage or abortion.\n\nBecause of this, we have two simple facts: if you, a non-Christian, get an abortion, you're no less hell-bound than if you didn't, so there's really no effect on where you'll end up, and if you later become Christian, you'll be going to heaven either way. Meanwhile, if you're aborted, you're definitely going to Heaven, while if you're born, there's a high chance, something like 68% if I recall, that you won't be Christian and will end up going to hell.\n\nHence, it's pretty clear: abortion is a net good. You're vastly reducing the fetuses chance of going to Hell and guaranteeing it heaven, at no cost to the mortal soul of the mother. The most objective good would be for a mother to have as many abortions as possible, as this creates the greatest number of souls that get to go to heaven and experience bliss, before eventually asking for forgiveness. Hell, even if God gets annoyed at this loophole and refuses to forgive the woman, one soul going to Hell for the dozens of aborted souls going to heaven far outweighs the cost.\n\nThis is all predicated on Christian theology being correct, of course, and falls away with out it, but it's an interesting argument I've never seen addressed.","14":"[removed]","15":"[removed]","16":"[removed]","17":"[removed]","18":"[removed]","19":"[removed]","20":"He was sent here to fan the flames of culture war, sow distrust in our democracy, and destroy our nation from within. This is my opinion, and I’m not pretending to have conclusive evidence, but here are the reasons why I believe this:\n\nIn 2016, his campaign officials and family members met with Russians in Trump tower for the purpose of exchanging “dirt” on his opponent. Whether anything came of this or not, the parties involved admit that the meeting occurred and didn’t deny what the purpose of the meeting was. It’s unlikely that this is the first time the two sides made contact. This meeting lines up with a pattern of behavior that either directly or indirectly supports the Russian agenda of weakening America from within. \n\n[Throughout 2016, Trump claimed the election would be rigged](https:\/\/www.google.com\/amp\/s\/www.bbc.com\/news\/election-us-2016-37673797.amp)\n\nAfter his victory, he abandoned the election fraud claims and continued to work for Russia from the Oval Office. He supported Russia’s agenda abroad, withdrawing support for Ukraine and the Kurds. He also publicly supported Putin’s agenda and had a much less contentious relationship with Putin than any former president. \n\nWhile in office he criticizes free press. Anytime the media is critical of him, he calls it “fake news”. His campaign against the media is meant push people to listing to and trusting him (the government) for information, rather than the free press which does not have to respond to the government. He also wants to compel right-winged media to tailor their reports to not upset him, causing him to tell his supporters to change the channel. If the media has to concern itself with the president’s opinion before running a story, they are not free press anymore. Russian media responds to the government, American media has always only responded to one thing: money. \n\nThroughout his time in office and the election cycle (which doesn’t truly end for Trump, since he continues to do campaign-style rallies even outside of the normal election cycle) he campaigns on the idea that the other side will destroy the country, and specifically his supporters way of life, if he loses. He tells people they should fear being replaced by immigrants and those who want “diversity”. \n\nAlso throughout 2019 and 2020, he regularly said that even after he wins, he should be allowed a 3rd term because of how “poorly he was treated”. Many people dismissed this as a joke, but there are many supporters who would only vote for him and would definitely support a 3rd term. He wants to remain in office as long as possible. \n\nIn 2020, the election fraud claims came back and when he lost, he claimed the election was stolen from him. He told supporters to gather at the Capitol and convince congress to overturn the election, which is not something the rules allow them to do. All of his attempts to overturn the election from Election Day to January 6th would have been unconstitutional. \n\nNow, he sends out emails to his supporters saying that if we don’t “solve” the 2020 election fraud, republicans won’t vote in 2022 or 2024. This is a message to his supporters that there’s no reason to partake in American democracy, and a message to Republican politicians that if they don’t support his election fraud campaign, he will turn against them. He is also isolating members of the Republican Party who don’t believe the election was stolen, creating a party of people who don’t trust anyone in government or media besides him. \n\nHe is currently holding “save America” rallies, entirely focused on the “issue” of solving the stolen 2020 election. All of his actions push us closer and closer to civil war. There are millions of people on the “right” who believe our country is already lost and democracy is broken, but that’s simply not true at this point. If we allowed him to have his way and Congress\/Mike Pence unconstitutionally overturn the results of the election, their fears would have come true. \n\nThe Cold War never ended, the battleground just changed. Russia is the same government that wants to be their region’s unopposed superpower, and America is still a roach for them that’s impossible to kill with violence or the threat of violence. What’s the best way to destroy the most diverse superpower in the world? Use that diversity against them and make them fight themselves. Re-ignite the flames of the Civil War and the unresolved conflicts between different factions. I’m confident that Trump isn’t the only Russian agent in our government, but he is certainly the most effective. He is by far the most polarizing figure in America today and the disruption he causes is exactly what the Russian government wants.","21":"These people have already tried to overthrow a free and fair election. They’re terrorists. Do we really need to wait for a mass shooting at a polling station? Are they going to target mail carriers carrying mail-in ballots? \n\nThey’re not mentally sound and do not deserve to own something specifically made to kill people.","22":"[removed]","23":"I see it just about every time I am out on the road... a person driving all by themselves wearing a mask. They probably forgot to take it off because it’s literally just a mask and doesn’t inhibit daily life at all. If anything, it shows them to be a good person that cares about the health of others. I just can’t imagine how low your intelligence must be to be mad at someone that cares about others. \n\n\nEdit: wow, I am really surprised by all the rightists here brigading this thread who've all come out of the woodwork to defend the indefensible. It really demonstrates the lunacy you guys will bend over backwards to defend just to hold up your cracking and failing ideology. If you can't concede that actively getting mad about people choosing to wear a mask alone in your car makes you as dumb as bricks, well then it becomes clear that you'll defend literally anything as long as it serves your narrative or agenda. I mean, you guys are trying to paint school teachers and administration as the new modern terrorist, so, I guess i shouldn't expect anything logical or sensible out of you guys anyway. Stay mad in your pathetic tear-stained basement.","24":"[removed]","25":"It's about  keeping a grudge by maintaining a list of infractions against the progressive cult in order to punish him or her at the right moment. Kids who do this are doing exactly what the state wants: spying on their peers, like a good socialist child hero.  \n\nUnfortunately this type of behavior is being encouraged and is becoming increasingly more common. Most people don't write down a literal list, but kids are being trained to keep a mental tally of all their peer's \"social transgressions\" to be filed away for future snitching if one of them strays too far over the line.\n\nKid gets caught using the f-slur on Xbox live? Well here's a dozen of his classmates to rattle off every single \"microaggression\" he's made since kindergarten to prove he has a pattern of \"far-right\" behavior to make sure his life is thoroughly ruined. That'll teach him to step out of line and question the doctrine.","26":"Ive noticed that the men who complain the most about family courts siding with women, are always the same ones who view childrearing & housework as primarily women’s jobs.  They seek out motherly qualities in women, and prefer to be the ones that over see the big picture operations of having a family and focus on providing.  Meanwhile the wife deals with the kids directly.\n\nRecently I was listening to a sort of RP guy complain that divorce courts are sexist because they only ask questions that favor women, like [fo one example] “what’s your kids teachers names” lol.  He also promotes grooming girls from birth to make motherhood their main priority.  This seems to echo the feelings of many RP, tradcon and general manosphere types.  \n\nThis didn’t make sense to me — if you believe women are best equipped for childrearing, why should the courts side in favor of a father who is not even involved in the kids education? For example.\n\nIf I’m a judge, and I have a man in front of me who believes parenting is primarily a woman’s job, I’d be inclined to believe him.\n\nThe logical answer is full custody to the woman.\n\ntl;dr: If you’re traditional, don’t complain about divorce courts siding with women —  it’s only congruent with your previously established values.","27":"[removed]","28":"[removed]","29":"Everyday I see Americans sharing their useless words of ignorance about middle eastern countries they have never been to and never will, they think that they are intitled to an opinion and people should here it. No person from the middle east cares about what a guy from the west that can't even pronounce his country's name got to say about his country or people, plain ignorance. I meant to say westerners in the title but I can't change the title unfortunately.","30":"[removed]","31":"[removed]","32":"No point having a big butt if it's rock hard. Pretty much any type of ass looks better than the type you see on instagram models who rigorously work out their lower half. \n\nI think women have a misconception about what makes a butt attractive, they think bigger = better but it's not that simple. In the same way most guys aren't attracted to women with massive arms and abs, we aren't attracted to muscular butts either. \n\nMy point is that any type of butt, even flat butts, are better than butts of girls who squat a million times a day.","33":"Just came across a post about someone saying there are only two sexes. Well, sure, that's what I would say, that's the view of the non-woke majority, or if not majority then at least enough people for the debate that is going on around it to exist. And the fact that it is so heavily debated kinda disqualifies it, no? Idc if you call everyone who disagrees with you a bigot, something being politically correct doesn't magically make it empirically correct, period. And don't start with intersex people, it's an anomaly and thus it's fair for someone to not consider it a sex, plus you know damn well that's not what OP was referring to.\n\nOr even vaccines. As a fully vaccinated, pro-vax person, seeing a post where somebody says \"vaccines bad\" and it being taken as the person being \"confidently incorrect\", well, I may believe they work, I may believe we have the data to support it, but as soon as there is even a terribly small chance that the vaccines are bad in one sense or another, which I believe there is (some people DO have a bad reaction, even ones I know), just shut up and don't post it there. It is not something that you can easily disprove such as spelling or math. Plus even if vaccines were the undisputed best thing in the world, to me it's the cheapest form of karma whoring out there.\n\nI don't even care if this opinion fits this sub, I guess I just needed to vent.\n\n\ntl;dr - if you honestly believe YOU are right about something, but there is even a small chance you are not, that could make you, well, confidently incorrect\n\n\nEdit: changed \"that's what I believe\" to \"that's what I would say\" as some people correctly pointed out that there are in fact more than two sexes, so please give a bit more attention to the \"it's an anomaly and thus it's fair for someone to not consider it a sex\"\n\nEdit 2: Yes, I AM talking about sex, not gender","34":"[removed]","35":"[removed]","36":"[removed]","37":"If you were to ask a right winger what the left is, they will say liberalism, LGBT, Biden, etc. But In truth, leftists hate liberals and Biden. A leftist isn’t a lazy american college student who votes for democrats, a leftist is a worker who is sick of being taken advantage of. The west has twisted the meaning of leftism to represent liberalism and capitalism. And right wingers believe it! There are no communists in the Democratic Party, but I can’t really blame the right for believing this, the American liberals parade around with symbols of true revolution and twist the meaning behind these to fit a form capitalism that “cares” about minorities.\n\nWhat you see in America calling itself leftism is nothing more than a mask for capitalism to appeal to minorities.","38":"[removed]","39":"Is life truly worse in this century then say, in the 1300? No. Is this decade worse than the previous because of the housing market increase? Yeah, probably. However, it's just strange when people get over dramatic and say that we are at our worse. I'd like to think of it like a graph. We probably maxed out on having the most possible amount of people being able to afford their needs etc maybe in 2000 ish. (But don't quote me on that, I could be wrong)\n\nCan we have room for improvement? Of course. But we still can get worse, and we aren't there yet. In this century, in the western world, we get renters rights. In the past, lords can pretty much do what they want with their 'renters'. \" **Droit du seigneur ('lord's right'), also known as jus primae noctis ('right of the first night')**, was a supposed legal right in medieval Europe, allowing feudal lords to have sexual relations with subordinate women, in particular, on the wedding nights of the women. \"\n\nIn the past, pretty much the 1% were truly the '1%' Now? While your average joe is a miserable wage slave, he\/she can still feed himself. And if he can't,\n\nHonestly, I'd probably\\*\\* rather be a 'homeless' welfare queen in USA then a poor farming peasant in the 1200 or some shit.\n\n\\*\\*Open to changing my mind lol","40":"[removed]","41":"[removed]","42":"[removed]","43":"[removed]","44":"##James\n\nDid you know that Jesus had a brother, named James, who was the first bishop of an early Christian church, and who died by being stoned by a High Priest associated with King Herod?\n\nHow can we be sure of things that happened two thousand years ago?  Well, we have a lot of sources, including Roman historians and early multiple Christian authors.  At least a dozen.\n\nIn fact our problem isn't a lack of information it's too much really - one source says he was stoned, another stoned and beaten , and another just says he was beaten.  There's also some confusion because there was multiple people named James.  But on the main points, there is widespread agreement.\n\n\n##Jesus \n\nOn to Jesus.  Of course, we have the Christian sources - the four Gospels, any of which would be considered primary source material.  Then we have the Roman historians, Tacitus and Josephus.  These aren't just random guys - Tacitus was a Governor, Senator, and even a Consul, and Josephus worked for Emperor Titus.\n\nBoth Tacitus and Josephus are in agreement on the main points - Jesus Christ taught and founded Christianity,  was condemned by Herod (Pontius Pilate), and crucified by the Romans.  Josephus also confirms the baptism of Jesus (by John the Baptist). Bottom line is that you can doubt some of the details, but you can't doubt that Jesus existed unless you deliberately apply an impossible high standard to him, specifically.\n\n##Resurrection\n\nOk, fair enough, you're thinking, so Jesus was a real guy who was baptized, started a new religion, and was crucified.  But there's no evidence that he performed miracles, or was resurrected, right?  RIGHT?\n\nHaving multiple eyewitness accounts of a historical event that was witnessed by dozens or even hundreds of people is a historians dream, and that's exactly where we are on the resurrection.  According to the gospels, the tomb was empty, and Jesus made as many as five appearances to his family members, disciples, and even a crowd of people.  And according to Josephus, yes Jesus did rise from the dead, so that's third-party (non-Christian) confirmation.\n\nIf it wasn't the resurrection, nobody would doubt it's authenticity..  But what do you do with a historical record of something that you believe is impossible?  Only you can answer this question for yourself.  Personally though, I am glad to see that the world still holds a little mystery.\n\n##sources\n\nhttps:\/\/en.wikipedia.org\/wiki\/Historicity_of_Jesus\nhttps:\/\/en.wikipedia.org\/wiki\/James,_brother_of_Jesus\nhttps:\/\/en.wikipedia.org\/wiki\/Josephus_on_Jesus\nhttps:\/\/en.wikipedia.org\/wiki\/Tacitus_on_Christ\nhttps:\/\/en.wikipedia.org\/wiki\/Historicity_and_origin_of_the_resurrection_of_Jesus","45":" \n\nYes yes condoms break, abortion pills don't work sometimes, blah blah all forms of reasons why contraception fails\n\nHow about you just refuse to have sex? -.- then you only have a right to argue for abortion for rape\/incest.\n\nIf you want to argue that sex is a \"necessity or a right\" then all the virgins\/Foreveralone would like a word with you\n\nPersonally I am against the ban but I'm just irritated at how the above hardly comes up in arguments on Facebook\/reddit posts.","46":"[removed]","47":"[removed]","48":"[removed]","49":"I was walking behind someone the other day and saw something that blew my mind: Instead of a  person wearing their fanny pack bag facing in front of them, they wore their fanny pack BEHIND THEM.  Suddenly, it  all made sense now, we've been doing it all wrong!  FANNY PACK SHOULD BE WORN FACING YOUR **FANNY**!  It's not called a wiener pack, it's not called a beaver pack, it's a ***fanny*** pack.","50":"[removed]","51":"[deleted]","52":"[deleted]","53":"A popular alt right meme is to pretend like men should be able to “financially abort” a child, as if that’s somehow the same thing as an actual abortion. Of course this already happens; it’s called child support and a lot of men just don’t pay it and suffer no repercussions. \n\nBut, if we’re going to let men father children and then cowardly peace out, then it’s only fair for women to be able to do the same. Whether it means free abortions available at any stage or free doctor’s visits, birth care and child care until the child is 18, it’s the logical end point of these trolls who cry over men having a small chunk of their pay going towards the consequences of their actions.","54":"Scrolling this sub for five minutes I found enough rape-apollogists, xenophobes, misogynists and right wing crybabies for a lifetime. Y'all just tryna collect here cause this is an echo-chamber for y'all. Y'all just don't wanna have to defend your point, because these points suck. \n\nMost of the posts here can be watered down to essentially \"Right Wing Good, Left Wing evil\" and it's just funny.","55":"I would envision a mobile application where before the start of consensual sexual activity OR before the start of an agreed upon 'sexual' period (1 day to 1 year), the couple\/FWB would virtually sign the same document on their respective phones and record a short video (30+ seconds across the room) to prove no compulsion was used. The video and the signed document then goes to a secure encrypted cloud server to prevent tampering.\n\nIf the woman became pregnant, and then if:\n\n(a) The man wanted the child AGAINST the mother's wishes, she can have an abortion as usual, **no** questions asked.\n\n(b) The woman wanted the child AGAINST the father's wishes, he can withdraw financial support (as stipulated in the virtual agreement) so the mother will support the child on her own OR she can abort.\n\n(c) Both want the child, then normal pregnancy contiues to term.\n\nI think this satisfies the entire issue because it gives both the man and the woman a CHOICE to opt out of parenthood, and it also gives a woman two choices in (b) so she can carry to term on her own choice (because SHE took the desicion) or she can abort.\n\nWhat do y'all think about it?","56":"How is that for unpopular? \n\nWe should halt all air travel permanently. Stop traveling by air. In fact, we should encourage human beings to not travel much at all. If they do they should travel by train or by car. \n\n**The only people who use air travel are rich people**. No poor person can afford to jet set around the world. Air travel is why we have a pandemic....spread by the rich while taking their little trips and coughing all over each other. **Air travel fuels pandemics and spreads disease.**\n\nNothing good comes from air travel. It was a nice novelty when it first picked up....a great way to go see another country...but **times have changed and visiting other countries is old ffashioned and  unsafe.** Time to move on.\n\nLastly, all the greenies and wokies should support this since A, it really only affects rich people, and B, it would eliminate the CO2 emissions from all these planes. If you've ever said you think people should buy EVs or that you care about \"climate change\" then you should be angry about how much pollution these aircraft produce completely unnecessarily: only so that the rich can hop around the globe coughing all over each other.\n\nEdit: so glad this is so unpopular. If it makes you feel self-conscious about being rich you're welcome.","57":"Right and wrong are just opinions. This doesn't mean that we humans will have an anything goes mentality. Of course not. We can still say that it is an opinion but acknowledge that the opinion is shared by many. Many share the opinion that we should avoid killing each other and killing is morally wrong in most cases. \n\nNow why is it important to acknowledge that it is an opinion? Because simply saying that this or that is right or wrong with no substance will not convince people to change. \n\nNow let's look at rights. When people say things like 'what right do you have to do this thing I don't agree on,' heck maybe its genocide...'. Well saying this is ridiculous and laughable. It shows you don't know how to fight back. Do you think Stalin or Mao or Hitler would care if you asked 'what right do you have' \n\nSo let's suppose someone proposed something really fucked up, like all men should wear dick symbols on their head and women must wear vagina hats. Then you come and say well right do you have. The dictator will just say might makes right \n\nNow let's look at rights like human rights or legal rightS. Its my right to own a gun' yes, but always be vigilante rights are given by humans. There is just simply nothing inherent about it. saying access to health care is a human right would still make others go 'so what'.","58":"[removed]","59":"I got banned from r\/twoXchromosomes because I commented on a post.  The racist bitch yelled at some black guy in the park because as a privileged white bitch she hates the fact that black men can use the same public park as her.  I pointed out that she's a racist bitch, and I got banned. r\/twoXchromosomes is a racist subreddit.\n\nLook, you disgusting bitch, just because you're afraid of every black man you see in a park doesn't give you the right to yell at them.","60":" \n\nYou might wonder how that is an unpopular opinion, but the amount of people who take part in Victim-blaming is just insane. The main offenders are misogynistic men and self-proclaimed nice guys towards women, but I've seen such behaviour such behaviour by women and men with no strong prejudices, and against both women and men.\n\nEven if the victim had every single resource possible to avoid getting into an abusive\/adulterous relationship, it would still not make their partner's actions right, nor it would reduce the harm done to them. And the arguments from victim-blamers are just ignorant, eg.\n\n\"She\/He got together with an abuser\/cheater instead of nice guy\/girl (*like me* optional)\"\n\nAbusers and other human-sewage often have decent social lifes and a level of superficial charm, AKA **they are THE nice guys\/girls**. If every abusive person had that tattoed on their forehead then we would be talking, but the world is not like that. Besides that, wake up to life, no one is going to get together with an unattractive, uninteresting, asocial loner only because they are 100% certified not an asshole (yet).\n\n\"She\/He ignored the red flags\"\n\nAbuse is insidious and gradual, and cheating is discovered. Combine that with the uniqueness of each relationship, and **there are no red flags**.\n\nI could go on, but I think made my thoughts clear.\n\n(This was originally posted in r\/unpopularopinion, but got removed because mods gay)","61":"[removed]","62":"[removed]","63":"","64":"I don't want these people to be nurses, doctors, police officers, etc. This is an excellent example of darwinism. The people who are too afraid of a shot will run straight to the same medical professionals after contracting covid. Begging for help on their deathbed.\n\nThey are clearly incompetent. They are clearly void of common sense. We are weeding out the idiots. You have to be really stupid to lose your job over a vaccine. Especially after taking vaccines all of your life. It's just this one particular vaccine people are so up in arms about. \n\nFuck em I say. Let them be jobless. Let them reap what they sow","65":"[removed]","66":"[removed]","67":"Doesn't matter what mind of relationship. Friends, family, lovers. If my boyfriend asked his friend to hit on me to see if I react, that's totally fine. I don't so that, but I do other tests. New people I meet, I ask them questions, and if they respond a certain way, it can make of break. I just don't see the problem.","68":"During 2016, most people who followed the hot 100 and pop radio seemed to think most of it sucked but looking back on it, it looks to me like the year end hot 100 was decent and the songs that got played on pop radio and charted on the hot 100 weekly were mostly good or even great. It was such a good year that even something as bad as, \"M.I.L.F.S\" by Fergie(a song that did chart)has this awesome moment in it when the song changes into sounding like one of those high energy gospel songs and she starts belting at the top of her lungs. I actually really enjoyed the trends of dark synth-pop and brooding emo minimalism. I think they work well and this is one of the best non-lyrical trap songs of all time: [https:\/\/www.youtube.com\/watch?v=ProbPpO\\_8oo](https:\/\/www.youtube.com\/watch?v=ProbPpO_8oo)","69":"How's that for unpopular?\n\nI'm not encouraging vigilante justice btw. I do not engage in this, personally. \n\nHowever, as an observer it is my opinion that traditional court-based \"justice\" is not satisfying to a population or observer. It is long, drawn out, and results in little societal benefit when weighed against the cost to taxpayers of keeping criminals in jail. \n\nMeanwhile vigilante justice is swift and free to the taxpayer and satisfying as shit normally. I saw a video on public freakout of a pedophile getting the shit kicked out of him by a victim's family. This is far better Justice to me than the courts sticking him on some list and he getting to walk around near kids again.\n\nWhile I do support trials and juries and fairness under the law, it is not a satisfying way to administer justice.","70":"I don’t see why anyone would want to listen to his music. He sounds like a girl, every song is extremely irritating and filled with auto tune, and all his songs are just the same meaningless pop bullshit. I bet if so showed all the Justin Bieber fans some real music, like Eminem or Slipknot, their heads would explode. It is honestly really sad that on the society we live in Baby, by Justin Bieber has over 2 billion views.","71":"As the US goverment went broke  some time ago. Not sure how the debt raising went but i bet its overpoliticised since the nation is heavily balkanised.\n\n&#x200B;\n\nI can suggest looking into using Pound Sterling or Japaneese Yen as more stable reserve currencies candidates. They are strong, existed for quite alot of time and they are recognised worldwide.","72":"[removed]","73":"I just saw this TikTok this girl made joking about how her dad always wanted a son but ended up with 5 daughters. There were a bunch of comments that were \"poor man\" or some variation, and then a bunch of replies going \"oMG Don'T HAvE KIDs iF yOU ThiNk tHat!\" This is just dumb.\n\nThe reason people say this isn't that a man having daughters is a curse or something, it's just that it means he won't be able to relate to his kids as much since a son would be more similar to him. I doubt any man with daughters only is seriously resentful of them or loves them less than he would a son, it's just a case of it would be minorly lonely\/annoying to be the only man in the house sometimes and that there's something mildly humorous about that. It would be the same with a woman that only has sons.\n\nI personally hope I will have a son in the future, but that doesn't mean it would be a problem for me if I end up only having daughters.","74":"[deleted]","75":"[removed]","76":"[removed]","77":"[removed]","78":"[removed]","79":"I've been kissed 4 times. 2 times out of 4 they just grabbed my face. The third did it while I was sleeping and I don't even know who he was\n\nThe fourth asked me for consent before he kissed me, and it honest to god made my heart melt. I never enjoyed kissing before my kiss with him. Though we are not together any more that kiss is one for the books. It was the first time a man considered what I wanted and not just what he wanted.\n\nI think everyone should ask consent. The world would be a better place.","80":"[removed]","81":"[removed]","82":"[removed]","83":"[removed]","84":"[removed]","85":"[removed]","86":"\nnow before y’all nail me to the cross let me just say i’ve always been and still am a huge dave chappelle fan. i begged my dad as a kid to get me the chappelle show box set for christmas and still rewatch it to this day. i still rewatch his older specials but the last 4 netflix specials have been nothing but cancel culture and gay\/trans people. he constantly complains that he can’t make offensive jokes anymore and he’s being chastised for it, but still gets paid millions for any standup he does and let me be clear; you can still make “offense” jokes, but if your punchline relies solely on offending people then it’s not funny. punch down then up. i don’t understand why he is so concerned about cancel culture when he’s still regarded as the “GOAT”and to my knowledge, wasn’t ever even cancelled to begin with. for instance in his latest special he complained that people canceled Da Baby over his comments about gay people but not him shooting someone in walmart. Da Baby claimed self defense in the shooting, what he did on stage lambasting gay people was just unprovoked and vile. \n\nlike with anything, as time passes, society evolves and society has evolved past the LGBTQ+ community being punchlines just like we’ve evolved past black and other POC being punchlines. his jokes just don’t really cater to the current climate of what’s funny anymore and he refuses to let shit go and come up with better material \n\nalso spoiler; at the end he talks about his *one* trans friend but he exploits her story and suicide as his gotcha moment in attempt to show he isn’t transphobic while even calling himself a transphobe.\n\nhis old friend and co writer Neil Brennan on his podcast even says dave is a drama queen when it comes to stuff like this. \n\nto be honest; his comedy just seems repetitive and lazy now. like he’s the bully who is shocked when someone fights back. he said this last special would be his last and i really hope it isn’t but i hope ig and when he comes back his material won’t rely solely on gay people and cancel culture.","87":"It's just strange to me when government adds on increases in mortgage rates or whatever people are like 'I have no choice but to increase my rent, it's not my fault'. In my opinion, if you rely on renters to pay your mortgage, it's just bad planning. \n\nI as a minimum wage worker will probably never own a house. That's fine. I'm never gonna buy a house then. \n\nToo many landlords act entitled, especially when it's their second or third home. \n\nI also don't care if the market crashes. Why? Because if you already own your home, you should be living in it. It's just strange to say that you bought a house waiting to sell it off. I mean, its your house, do whatever you want, I just don't see it as a good strategy to see it as a good investment rather than a place to stay.","88":"[removed]","89":"Edit: posted here because r\/unpopularopinion deleted it\n\nI've seen a lot of comments around (here on Reddit) stating something to the effect of 'Capitalism is at fault for all the bad things'.\n\nThere is nothing wrong with Capitalism. It's not broken, it's not malicious, and it isn't at fault for your bad spending habits.\n\nCapitalism at its core is based on the idea of economic freedom. Freedom is not a regulation nor a solution. It is the natural state of any economy before rules and regulations are applied. Capitalism allows room for prosperity for anyone, and poverty for anyone. It envelops both the good and the bad.\n\nIn my opinion, you all should be hating on Communism and Corporatism. Corporations strongly resemble Communist states in that they aggregate resources under singular, draconic control, and have very little or impersonal regard for their members and employees. Everything is done with the interest of the Company (under the pretense of everyone benefitting) in mind. That's a Communist state.\n\nUnder Capitalism, anything can happen. You could thrive, or you could fall. It's up to you and chance. It's not the fault of Capitalism if you let corporations buy all the land and houses, and then rent them out at an extortionate premium. If you don't like it, don't sell.\n\nCapitalism allows for those things, but it also allows for you to legislate local (state level) laws on land ownership, as well as setting the value of the property low and using Eminent Domain to buy it all back for pennies on the dollar.\n\nYou can't blame economic tyranny on economic freedom.","90":" \n\nI was watching this video that was from a while back of a woman on a NJ Transit train who was sitting in one seat,  and her Louis Vuitton was parked in the seat next to her. \n\nPeople  were giving her a hard time because she wasn't allowing anyone to sit  next to her. She kept on saying \"I want my personal space, I don't want  you sitting next to me.\"\n\nApparently this minor debacle was enough  to cause the conductor to stop the train so transit police can escort  her off the train.\n\nI'm sorry, but this annoys me like hell. I've  seen posts on Muttr by someone who believes the same way she does and he  gets hell for it too. Sorry, but I have something to say:\n\n1. When  it comes to open seats on trains, everyone keeps on trying to say \"if  you want to put your bag in a seat, pay for two seats\" or the  ever-infamous \"I paid for a ticket, I'm entitled to a seat.\"\n\nSorry,  but the \"I paid for a ticket\" argument is stupid. EVERYONE paid for a  ticket. The only thing it entitles you to is to be transported from one  station to the next. That's it, no more no less.\n\n2. There are  other seats available, always.  I suggest you try somewhere else instead  of DEMANDING that one person let you sit next to them. As rude as she  sounded, she's right. If she doesn't want someone sitting next to her,  she has every right to say no. She's entitled to her personal space, and  the fact that \"it's public transportation\" is not relevant. \n\n3.  Why did the person recording it even see it fit to record to begin with?  Doesn't she have anything better to do aside from shaming someone for  not thinking the way she thinks? This is America. People have choices,  and just because someone chooses to do something that isn't what you  want them to do doesn't mean you get to embarrass them for it.\n\n**Louder for those in the back:**\n\n***If you pay for a ticket, you are not entitled to a seat.***\n\n***Paying for a ticket entitles you and your possessions on hand to be transported from one station to another.*** \n\n***Your ticket doesn't entitle you a seat, it doesn't even entitle you to get off at your intended destination station. It entitles you and your stuff to be transported. No more, no less.***","91":"[removed]","92":"[removed]","93":"Despite unpopularity in their polar opposite sides, they have made unpopular decisions that will be remembered. Trump's Examples are \n1)His Reliance on open Diplomacy over secret Diplomacy to deal with many world Problems including North Korea which is a shift from previous situations,\n2) He ignited Public Discourse of American Domestic Politics which is a change from the quiet Hibernation of Public political discourse with both public and politicians not showing any empathy towards eachother.\n3) Created Space Force and helped privatisation of space\n\nJoe Biden's Examples are\n1) AUKUS, which is a major deal and showing Indication of Signs that US is moving towards an Anglosphere Union Slash Alliance over NATO \n2) China is being challenged after a while\n3) Science is being emphasized and University tuition might become less costly \n4) Healthcare is getting funded like it should","94":"Great idea guys, hear me out. Mandated vasectomies for all men over 18, fuck it let’s make it 16.\n\nThen we don’t need to worry about abortions. We can freeze the sperm and if you eventually want a kid you can turkey baster your baby mama. Boom, now no one is forced into parenthood. We can even throw in a few free IVFs in case it takes a few tries. Now if you want to get your vasectomy reversed you need to get married under god’s eye of course, we wouldn’t want to be improper.\n\nI hope you don’t mind if we just take a vote on this real quick.","95":"Like goddamn, don't you people get sick of the same fights every day? You're not changing minds, you're definitely not looking smart, so what the fuck? Almost every day I see some iteration of this on here:\n\n\"Hur hur hur women and minorities are bad and reddit's TOS policy is an attack on my rights I think\"\n\n\"Umm, actually, diversity is our strength you insufferable  wormbrain\" or some other dumbass \"rare\" insult. \n\nLike yeah, I don't think political opinions should be banned here, but at least give us something new and original.","96":"[removed]","97":"I don't like him, he complains, a lot, he always complains, You may interpret this as hypocrisy, but, have You ever seen, a video game developer, complaining about his own game development company, besides manipulators, and people who want to give a bad reputation, to a company?\n\nI mean, who the hell complains about Nintendo, I mean, like a guy, who works at Nintendo, the company which gave him, Kirby, and Smash Bros?  I don't know, You stopped making your job well, since the release of Smash 4, embrace both sides, what about the Sonic franchise, do you really think that other random franchises, like Arms, Persona, Bayonetta are more important than one of the most revolutionary and most important kids game franchises, that everyone knows?  Mario Maker, can even embrace the competitive side, Wait no, the whole AUDIENCE of Mario, with kaizo levels and casual stages.  You can't even decide, if the Game, is supposed to be for fun or for glory, is the removal of these modes, a symbolism for something?  That is a good question, for something.....?  Why you can't listen to your fans?  Wait, those were in Smash 4, those are a neckbeard's favorite game, for making, memes, bad ones, questionables ones, and grotesque ones. Pointless drama, arguing over obvious things, another fanbase invading another fanbase, just, for making themselves superior, and I don't know, find a better guy for handling the job, because of all the points that I've said, also don't You think that he was involved in something, a while back, make him fired, or something.\n\n\nIt's not your fanservice, it's not your fans, it's not Nintendo's fault, that they interfered in you, or your Wife.  It's just You...              Just You.  Man, what else I have to say.  All of those years, just wasted away, because of a shitty, glorified ,repulsive asshole, and an another sociopathic, manipulative fanbase.","98":"Mostly because 80% of people who talk about the subject on both sides hasn't studied about its history or economic model. If it fails, it's socialism, if it's suceeding, it's capitalism, how convenient.\n\nPeople are hypocrites when talking about politics. I guess that part isn't that unpopular.","99":"Lately, the way men on this sub equate their wallets to women’s bodies makes me think you guys don’t realize women pay for things… like all the time.\n\nI don’t remember actively wanting to buy pads and tampons but such is life. Birth control, that costs money too. \n\nAnd you need to consistently buy that shit until you’re like 50, so yay. \n\nNot to mention women get paid less than men for the same job and women’s products on average cost more. \n\nAt least women aren’t like expected to pay child support for a mistake they made… oh wait… women are expected to be the primary caregivers in this society. Almost forgot.","100":"I'm sure they are nice\/convenient for some people and that's great for them...more choices the better, but I will always stick to  my gasoline internal combustion engines....for my lawnmower, my string trimmer, my vehicles, everything. \n\nI don't mind the maintenance like changing oil at all, it's really easy. To me there are absolutely no advantages to the electric products.","101":"Everybody at my college listens to rap music and at times I can't stand it. I don't even know where to begin with it. First, the lyrics are atrocious, they are filled with words like \"bitch\" and the n-word. Also the messages in the songs are all about disrespecting women and glorifying criminal activity. When it comes to sound, all the beats sound the same and the rappers themselves just mumble over them and you can't understand them","102":"There’s no question Big Oil owns America and most politicians. Fighting that control by purchasing and driving all-electric is just common sense.\n\nOil will continue to become scarcer and scarcer, pushing the price higher and higher. Why commit to something like that?\n\nHuman-led climate change only continues to get worse. Limiting greenhouse gas emissions is, again, common sense. \n\nRemember that I said *NEW* car. The best thing for the environment at this time is buying a used fuel-efficient car.","103":"*If* the US does care about democracy as it preaches, India deserves a lot of criticism. From [raiding human rights and advocacy organisations](https:\/\/www.nytimes.com\/2020\/09\/29\/world\/asia\/india-amnesty-international.amp.html) to [arresting journalists](https:\/\/www.bbc.com\/news\/world-asia-india-55906345.amp), protestors, and dissidents, India’s decline into electoral autocracy is well-documented, with organisation after [organisation publishing reports](https:\/\/www.v-dem.net\/en\/news\/democratic-backsliding-india-worlds-largest-democracy\/) warning about this. \n\n\nOf course, China is the much bigger evil here, and it’s hegemony needs to be countered, but India’s decline into electoral autocracy should also warrant strong criticism if the US wants them as a democratic regional ally.","104":"A lot of people will downvote automatically, and it is your right to do so, however I do believe that at the most, we should remind ourselves what downvoting is for, which is to downvote posts that don’t contribute to the conversation. I personally think this is an controversial post, majority of Reddit, unless you are on r\/Prolife, if you post a post that suggests you are pro-life you will be downvoted automatically, and they will usually pull out straw-men. \n\nEven though I am pro-life, clearly pro-choice people are free to share their opinions. I am not against that. It’s just that, instead I often hear straw-men and misinformation about the human embryo, I’ve heard claims that when the embryo is at 7-8 weeks of pregnant, (the weeks that majority of women have abortions), that the unborn child is only a cluster of cells. Which is definitely false, because majority of women don’t even know their pregnant when the embryo is an unicellular organism. \n\nhttps:\/\/www.ehd.org\/dev_article_unit7.php\n\nThat we are only pro-birth and are only that way because we are sexist and want to punish women for their decision to have sex. \n\nMajority of women don’t even know their pregnant for half of the embryonic period, hence the outrage over the Texas Heartbeat Bill, which bans abortion after about 6 weeks of pregnancy, or so I’ve heard. There’s been a lot of misinformation about the bill, which is why I urge you, no matter what side you are on to read the bill yourself to know what the bill is against and what it isn’t. Which for those who are interested, is easily accessible online.\n\nhttps:\/\/capitol.texas.gov\/tlodocs\/87R\/billtext\/pdf\/SB00008H.pdf\n\nIt also seems that even the news shows bias against the pro-life position and favors the other sides view, even though they claim to be unbiased.\n\nhttps:\/\/groups.csail.mit.edu\/mac\/users\/rauch\/nvp\/articles\/media\/media.html\n\nFor basic summary, I’m frustrated by some of the discourse I see from people on the other side. I often hear claims that 7-8\nweeks are only clusters of cells, that pro-life people are only that because they are religious, because they are sexist, even racist. Even when I was pro-choice, I found myself disagreeing with a good bit of what I found online, because I thought they weren’t  very good arguments from the pro-choice side, and were just straw-men. Not only that, but the blatant misinformation from both sides. \n\n\nThis was not meant to generalize all pro-choice individuals, there are many who can come up with good arguments such as the bodily autonomy argument and the personhood argument.","105":"[removed]","106":"She could have retired during the first-seven years of the Obama admin and basically guaranteed her seat was taken by another like-minded judge, helping to protect her legacy and women's rights as she saw them. Instead, all those battles she fought and won may be overturned. Not all at once, but over time, starting with Roe v Wade.\n\nNow, she has been replaced by a much younger far-Right judge who may be in that seat for the next 30 to 40 years before there is even a *chance* to put another person like RBG back in that seat.\n\nYa done fucked up, Ruth","107":"Anyone with any sense understands nuclear subs are far better given the circumstances and the theater of potential war with China in the Pacific.  The missions these subs will be on will require them to remain hidden for extended periods of time, not coming to the surface regularly like diesel subs must do.  A simpleton understands this military reality, so I know you do too.  So this isn't about the subs, is it?\n\nTrump gave you fucking people in the EU a chance to modernize your militaries and get with the fucking program of pivoting to Asia, and what did you do?  You basically told him to go fuck himself.  So now we're leaving you to your own defenses against a pathetic Russia while we deal with a far greater threat to the world.\n\nYou all could have been a part of the grand alliance that is forming in the Pacific to guarantee freedom of navigation and trade and contain China's expansionary aspirations, but you failed, miserably, and we may all suffer the consequences collectively because of your short-sightedness and selfishness.\n\nSo once again, the anglosphere will bear the brunt of making the world safe for you to conduct free trade, and I hope you go fuck yourselves, at least until you wake up and realize what a missed opportunity this is.  \n\nSo just sit back, grab a hot cocoa with your security blanket, and enjoy the free ride you bums while team America saves the fucking day, once again...","108":"[removed]","109":"Just a quick glance, a lot of provinces servers are paid the same as general minimum wage. Way back when, I remember even when our wages were not the same (might have changes from province to province, but even Google it seems only Quebec servers are the only ones paid less) when in was paid less I was paid only one dollar less. That is easily made up. Let's say in a small restaurant I was the only server. In eight hours I just need 8 dollars in tips to make up for the lost dollar. \nThat's pretty much just one customer per hour tipping me a dollar. But that isnt realistic. In one hour in a small restaurant we still get at least 3 customers\n\n\nThere just simply isn't any argument that servers should be tipped unless you demand all minimum wage workers get tips or ask minimum wage to be raised\n\nAlso, I was a server. When I was a server i still found it unreasonable when my fellow servers got mad at non tippers. Even with non tippers, I made about 50$ more than, even including minimum wage, on just one shift. yeah 50 isn't a lot compared to an engineer or whatever but compare that to all the shifts i cover that adds up. Plus minimum wage cashiers aren't so lucky","110":"[removed]","111":"[removed]","112":"[removed]","113":"[removed]","114":"[removed]","115":"I am a gun enthusiast and collector. I often hear people say that shooting guns feels good, or relieves stress. It does the opposite for me. Shooting guns induces a mild amount of stress on me. I don't think it is particularly fun or unfun either way. It certainly doesn't make me feel powerful either, it makes me feel humbled. I don't understand how people can say guns relieve stress but I do understand how it can make them feel powerful. It just doesn't do it for me.","116":"[removed]","117":"[removed]","118":"[removed]","119":"[removed]","120":"Single mom households became more popular during the time yall were growing up & its like most boy mothers just let their sons either raise themselves, or were spoiled beyond believe. No in between. Y’all weren’t taught how to be a decent partner or father, or barely a decent citizen. Y’all won’t wanna have that conversation though bc a lot of the moms manipulated their sons w covert incest.","121":"Funeral processions are archaic. This is NOT 1941 anymore. If people don't know where the damn grave site is, they can use GPS on their phone. They're not going to miss anything. Tailgating a hearse should NOT be an invitation to ignore traffic laws. Planting people is stupid and archaic to begin with. Cremation should be mandatory in the 21st century. All these hippies want to save the planet. How bout we stop wasting land on fucking cemeteries?  \n\nSaw a rant about someone fucking up some dude's funeral procession and got annoyed. As I'm banned from \/rant for bitching about the karma requirement to post when I first made this account, I'll just respond this way.","122":"[removed]","123":"Even if it's bad for your taste doesn't mean it's bad for me and i might actually like it heck i somewhat like Star Wars episode 7,8 and 9, Movies should be first and foremost ENJOYABLE and politics and everything else should be the second thing you should worry about, although if the movie is more about the plot or the message it is trying to get across then that is an exception.","124":"[removed]","125":"If you are being forced to pay any amount of money under the threat of violence and incarceration, it is theft.\n\nI have heard somewhat compelling arguments that taxes can be a necessary evil to fund national defence but no amount of rationalization or ‘I pay my taxes happily’ can change the fact that if you do not pay your taxes for long enough, the state will find you and incarcerate you.","126":"Oh you thought you had a purpose? You thought your absurd military budget was to protect YOU? Jeez... \n\nIts for us. America is nothing but a military base and a movie studio to us. SORRY! Keep flipping burgers though, economy relies on it, you're all fat asses after all.\n\nHows it feel knowing your only purpose is to protect us more important people?","127":"It is very hard to explain, especially when English is your 3rd language, but i will try. Just because free of will and mind is the foolish illusion. All information about world, politic and international relations that people have is from news who owned or profited by some of people and who ruling by people that have their own views. Neutral media can't exist just because they must think about  what news should be covering and about what to talk. But this is only a little problem comparing to the fact that all our opinions is from our environment. Nearly all people that was raised during times of kings were monarchists (and even when they not it is only was because of some revolutionary leaders) , nearly all people that was raised during Soviet Union were communists, nearly all people that lived in Germany of 1932-1945 years were fascists.  Your opinions is not your opinions, it is product of your environment. But exist a small amount of free minds (i think this is not more than 1% of people) who have their own and independent view about the world and who is primarily force of changes in the world. And no, i am not believing that i obe of those people, and be fair, with a near the 100% you are also not on of those people. Even when your opinion is not mainstream it is with high chance just a product of your charachter, not the mind, you can have a instinctive love to rebellion because you love to think you are smart or \"not like other people\". Or you just hate people(fascism), jealous for rich(communism), fear of changes(conservatism), like to think you are bringing good and freedom to this world(liberalism) etc. No matter what are you believing right now, nearly 100% this is not from your rational mind, but from feelings and environments. People are dumb and can't see many of things and only a few of us can, and we will never verify is this you free minded. And the more you think about this, or see near the you, the more easy and good you becoming to understand all this.","128":"[removed]","129":"First off I’ll say that school and work are both tough but going to school is deffinetly tougher. Let’s start with the biggest pro of work, payment. If you have a job chances are you’re getting paid. You of course do learn stuff at school but often the information isn’t that important and maybe only comes in handy once or twice while a paycheck can keep you alive. Well you finally made it home, time to relax right? No guess what you have homework. Homework is essentially like working overtime except you don’t get paid a bonus. In fact if you don’t do your homework your grades will be lowered. Overall it seems like going to work is just generally nicer than going to school.","130":"Just look up their history\n\nThey used the KKK as their muscle thugs. Also Jim Crow was a democrat.\n\nGeorge C. Rable, But There Was No Peace: The Role of Violence in the Politics of Reconstruction (2007)\n\nThey opposed abolishing slavery, were against letting Africans vote and were against the 1964 civil rights acts.\n\nhttps:\/\/www.vox.com\/2014\/12\/8\/7328755\/maps-democratic-party\n\nMany people in the democratic party seems to admire Margaret sanger\n\nThis is what she had to say about people at the bottom, slavs, jews, latins and africans.\n\nhttps:\/\/www.quotetab.com\/margaret-sanger-quotes-about-weed","131":"[removed]","132":"[removed]","133":"There’s loads of Taliban simps who boot lick authoritarian regimes and Islamic Terrorists. I see loads of people there unironically saying Saudi Arabia is a better country to live in. Loads of misogyny as well. Especially against white women. I regularly see people blame women for all problems with society and say they shouldn’t vote. Auth Right is almost never made fun of there and 90% of memes “cringe leftist vs cool right wing extremist”. If you post anything left wing there you get downvoted and insulted in the comments. Meanwhile if you say anything about the right ESPECIALLY Auth right you can smell the salt in the comments. 90% of the “lib lefts” there are obvious right wingers masquerading. The “liberals” there are like, not liberal or left wing on anything. They also constantly ridicule their own quadrant in a way that makes them really suspicious. Lib rights also seem barely lib right too. And like I said the sun is super hostile and hateful towards women especially if the women in question are white or western. Really the sub is a cesspool of pro authoritarian garbage in general. I’d say a good 70% of the sun is Auths and the other 30% is too suppressed by the PCM hive mind to do anything.","134":"This ain't a rights thing but just a logic thing. If private companies are the ones making all the cool weapons and guns then why can't the public own them? I should be allowed to drive my tank as I wish and be free to hunt down the cartel and blow them to smithereens if they ever try to encroach on my ranch.\n\nYou might be tempted to ask - what if some wacko goes on a rampage? well good thing I'm in my tank to shoot them down.","135":"It's an excuse to go out and socialize much like how most degenerates go out and drink. Religious people get high by worshipping much like how drug addicts get high from narcotics. I disapprove of both lifestyle - and if God was real he'll curse you out for praying and kneeling all day. I personally believe that God is an atheist. If I asked him if he'll believe in something without any evidence he'll laugh at my face and then laugh at the fanatics who worship him.","136":"[removed]","137":"[removed]","138":"[removed]","139":"Recently, a bill banning the teaching of \"CRT\" was passed in Wisconsin. Looking through the terms and concepts that are banned, it's clear they have gone full mask off and shown it was never about CRT. Terms banned include: Diversity, equity, inclusion, multiculturalism, cultural awareness and anti-racism. Teachers cannot teach about inclusion. This is an extremely clear example of government overreach to suppress speech in the classroom, with terms so vague and wide reaching that can be applied to the most basic concepts.","140":"[removed]","141":"[removed]","142":"Coming from a meat-eater who had two quarter pounders yesterday. \n\n(And I am talking about factory farms please do not mention native peoples hunting for their food I do not care it’s a completely different situation) \n\nThey are right. There is literally no way you can argue against them. How could you possibly think that forcing animals to reproduce by the millions (maybe even billions), injecting them with antibiotics, forcing them to live in the most disgusting, restrictive spaces imaginable, just to slaughter them. Over. And over again. \n\nThis is worse than genocide, because with genocide at least the suffering eventually ends. Instead these animals are breed to be tortured, raped, and killed so the cycle repeats itself. \n\nThe only real argument I’ve seen is “well they’re animals, they’re dumb, who cares?”. So what are you saying about intelligence? Are we just now morally allowed to enslave and do what we want with people and things dumber than us? \n\nAnd then after that the only thing they have left is “well it tastes good haha I’m gonna eat a steak now, are you triggered?”. Because there is no argument. \n\nI understand it’s hard to change, because it’s been culturally engrained in us from birth to eat meat. Hell I’ve been eaten meat like 7 times this week. But you have to acknowledge that it is not ethically defensible in any way shape or form.","143":"The idea of supporting economic globalization and the improvement of global climate health are incompatible notions. Globalism by its very nature, as a product of it's far reach and impact, is one of the most significant factors polluting the oceans, the air, the land and environmental systems. You cannot, with any intellectual honesty, say you support globalism while also claiming you want to improve issues with climate change and environmental degradation. However, despite this, it is very common today to run across people who claim they want to improve the environment, but then at the same time advocate for unrestrained globalism. Sorry, you can't have your cake and eat it too.","144":"First of all sorry for bad English. I'm Italian and, you know, not so good English skills.\n\nThis though that I have has formed seeing how ignorant and uncultured are most of the elderly people in my country. They can't elaborate a personal way of thinking that isn't \"imposed\" by someone else.\nFor example:\nSalvini is the leader of Lega, one of the top parties in Italy. _\"Boomers\"_ follows him just because their minds are too lazy to elaborate what he's actually saying.\n10 years ago Salvini was supporting Padanian secession and he said that Italy is a shithole of a country, that southern Italians are fucking pigs and things like that. Nowadays he's a ultranationalist who loves southern Italy and that says that people from Africa are fucking pigs and stuff like that. Basically he's followed and he got lot of consent because he know what people want and he says what people want.\n\nSalvini isn't the only party leader to do this. Also PD (Italian democratic party), M5S (populists), Fratelli d'Italia (ultra right wing) and Forza Italia (Right market liberals) are fucking shitty parties that decieve ignorant people to follow them just because they know what to tell to electors.\n\nI saw lot of young people (18-30) that fucking hate this system. 7 out of 10 people that are under 30 don't vote anymore.\nThey're fucking tired of those parties that exist only because _\"boomers\"_ vote them.\n\nWe can't have a fucking good party that says the truth and that want what is truly good for Italy.\n\nNowadays Italian politics can be summarized in:\n\n\"Left\"wing: Lmao those Right-wing fuckers are dumb as hell, they're fascists.\n\nRightwing: Lmao those Left-wing fuckers are so fucking stupid, they're commies.\n\nItaly don't have a true Left-wing anymore, Even PD (top \"left\"wing party) it's a fucking joke. They're considered _LeFt_ because they support LGBT rights. Nothing more. That's all.\n\nWe don't have a good Socialist\/Communist party since the current ones always do things just to have 2-3 seats in the parliament. They care about the seats not the people.\nWe don't have a good liberal party since the current one is a fucking joke that cares only about free market and dont give a shit about civil rights.\nWe don't have a good rightwing conservative party since the current ones only cares to spread shit about immigrants and to exploit that sort of \"Boomer's-Nostalgia\" that most of over60 have.\n\nOur political system is fucked up because parties only point to recieve votes from ignorant, dumb, lazyminds _\"boomers\"_ that can't understand what kind of shit they're voting.\n\nIn Italy, the elderly are the largest demographic category and the most ignorant. Less than 50% of them have a highschool degree and school before highschool only teaches you how to write, basic math and 0 to none literature.\n\nI'm not surprised to see my country rolling down to the bottom of the abyss if we give to those dumbfucks that can't even speak properly the right to vote.\n\nVote it's not only a right, it's also a responsibility. You're fucking asked to decide the future of a country. Don't get surprised if populists are winning. They talk to the stomach of ignorant people that electorally worth as much as you. And I don't think that's a good thing.","145":"(This text is incoherent rambling intended to fill the minimum character requirement. Don't read it.)\n\n&#x200B;\n\nI don't know bros. I look around and see a generation of lost men and women dissatisfied with life. Having no belonging or purpose. The previous generations questioned the old traditional values that were the foundations propping up their civilizations for 1000s of years and started chipping away at them. They arrogantly tore down all the ancient wisdom that had been learned through painstaking trial & error and built new golden idols in their place. They squandered what was handed to them and we are now living with the consequences: Degeneracy, moral nihilism, loss of purpose. Longing for an idealized lifestyle of picturesque 50s conservatism is punk rock as fuck now. We're all gonna make it.","146":"[removed]","147":"[removed]","148":"[removed]","149":"I don't understand why so many people can prefer these drinks to pretty much anything else. If I'm having sugar-water, at least a glass of cranberry juice doesn't taste like liquid birthday cake or candy. Or just drink water.\n\nNot to mention the fact that these beverages take massive use of subsidies to the point where they're cheaper than almost any alternatives. This, paired with their highly addictive nature, [are highly linked to obesity.](https:\/\/pubmed.ncbi.nlm.nih.gov\/19768858\/)\n\nAlthough I'm not a proponent of banning something because it can be abused, we are long overdue for a major societal push to consider Coke and Pepsi in the same vein as tobacco and alcohol - something dangerous if abused. There needs to be proper education in schools, and parents simply should not be giving caffeinated, addictive, and sugar laden drinks to their young children. It's borderline abuse.","150":"I make an effort to stay informed on the opinions of those on the left and the right. One of the ways I do this is by watching content creators on youtube from all across the political sphere. When I do this, I try to find the most reasonable who can put together the best arguments to represent different viewpoints.\n\nThere are a couple problems. For one, the overtun window keeps shifting further and further right. It's a key, and very effective, part of the fascist’s strategy. This means that more and more people, without their actual views changing at all, are being labelled left leaning when they were previously considered right leaning.\n\nThe second problem is the one alluded to in the title, and it's pretty closely related to the first. People keep being pushed out of right wing social groups for having opinions that even slightly differ from the group, or for incredibly petty stuff that either has nothing to do with politics or is informed by their right wing views. Stuff’s crazy.\n\nFor example, when righties accuse me of being left wing for watching people like Young Turks, I point out how I also watch people like Neo-Nazis and QAnon. Now don't get me wrong, all of these people believe a lot of crazy and incredibly stupid stuff, but they at least make fully formed arguments for their beliefs (less so with QAnon, but he's the best evangelical politics guy I've found so I can't ditch him).\n\nHowever, Liz Cheney has been canceled for not falling for the Big Lie, and it's only a matter of time before Mitt Romney gets cancelled for being a pedo or some stuff. Now people are calling Liz forking Deep State and the only people these days who are considered right wing are the clinically insane people on YouTube like PragerU.\n\nAnd that's kind of the point. By shunning anyone but the most extreme, they push the overtun window further and further which makes normies thing the extreme views are more normal, so they adopt them more.\n\nI consider myself a centrist. I have very strong views on most major political topics, but they don't align with either the left or the right. Sometimes I agree with things that are strictly right wing ideas, and sometimes I agree with things that are strictly left wing. But having said that, the right really is toxic as hell. The left always seems to be the more understanding and reasonable side. I'm not going to just start agreeing with them because they're nice, but it is worth pointing out.","151":"So whenever we are going to listen to music in school, 90% of the boys want to listen to rap and hip hop only. And they are not really accepting other people’s taste of music, now I’m not saying that all the people who like hip hop and rap music are like the boys in my school though.\nSo the first reason why I’m not a big fan of hip hop and rap is because the people I know who like it are like not approving of other music.\nThe second reason why I don’t like that kind of music is that they talk about like money and guns and like hot girls and it gets so repetitive, and there are so many bad words! Like I know it’s not kids bop or something but like there are a LOT of swear words.\nLike I’m not a teachers pet or something but like that many swear words isn’t even funny or entertaining. If you read to this point I just want to thank you. Bye.","152":"[removed]","153":"Fathers used to have a right of life and death over their children- society rightfully got rid of such barbaric cruelty, sadly mother's right of life and death over her innocent child still remains in place and  is even supported by the majority. Human life begins at the point of fertilization(which is a scientific fact) and therefore if we do not want to divide humans into those deserving to live and those who do not we must stop using such dehumanizing and dangerous rhetoric- if we don't accept killing a born child by his mother, we shouldn''t accept killing an unborn either. Choice regarding your body is making a tattoo or selling your kidney for example, not killing another, when there is absolutely no necessity to do so.","154":"[deleted]","155":"[removed]","156":"[removed]","157":"Queen Kong would be a giant female orangutan (instead of a Gorilla) voiced by Leslie Jones, Hemsworth (doesn't matter which one, they could take turns every other scene) will be the gentleman in distress, and the main lead will be Elliott Page who plays a bigender fluid environmentalist.\n\nThis movie would be an instant smash hit in Hollywood which loves: female reboots, female empowerment, slight changes to classic movies to make them \"modern\", the Hemsworths, and LGTBQV+ things. I have cracked the formula.","158":"[removed]","159":"All right non political opinion here:\n\n&#x200B;\n\nI watched all star wars visions episodes thanks to a friend who shared me an account. And I must say it is very good. I came to this with bad expectations, that it would be worse.\n\n&#x200B;\n\nBut no. The studios that were hired by Disney made masterpieces. True gems in star wars world compared to what's canon recently..\n\n&#x200B;\n\nThey should canonise Visions and decanonise Sequels.  But that's my opinion.","160":"[removed]","161":"The average voter is uneducated, unwilling, or unable to properly research the opinions and policies of the people they vote for.\n\nYou can see the viral videos of people asking citizens to point to Syria or Afghanistan or even *Europe and the Middle East* on a map, and they point to the bottom of Africa.\n\nPeople who couldn’t pass 9th grade science class are now suddenly experts in viruses and epidemiology. \n\nDemocracy works insofar that people know what they are voting for. It seems like most people are incapable of this, so we should ensure that they have at least a cursory understanding of the facts before they vote.\n\nA democratic country run by idiots is a weak country, even if it is democratic. Voting should be restricted to those who have an educated take on different current affairs and political systems.\n\nWe have a duty to take care of these people and to take care of our peers. Letting them vote hurts themselves and us, at the same time. It would be a moral good to restrict that, making the nation a stronger and more capable place.\n\nThe license requirements should be created by experts in the individual fields - political philosophy, environmental science, computer scientists, etc.\n\nIt should be reapplied for once every 10 years to keep up with the changing regulatory and political environment.\n\nIt’s time to make sure that the people who are running the country - the democratic populace - are actually up to the task.\n\nI am not an expert policy writer, so the specifics might have to be adjusted for real world usage. But the motivating thesis stays the same.","162":"[deleted]","163":"[removed]","164":"Sin City? Sounds more like Shit City to me now. Vegas always looked so cool and different, but that doesn't seem the case anymore. \n\n* One of the only places in the country still enforcing mask mandates. \n* It's always been portrayed as a city that never sleeps, but now a lot of places have shorter hours. \n* How long has prostitution been legal in Nevada? Still not legal in Vegas though (Clark County). FUCKING WHY? and why doesn't anyone fight that in the courts? It's the same basic women's rights argument that keeps abortion legal. \"Women have the right to do what they want with their bodies.\" Obviously, that should include selling access to the fun parts. RIGHT? \n* Why isn't anyone even lobbying to lower the gambling\/drinking age out there all these years? Either you're an adult at 18 or you're not. You'd think they'd be all over that shit by now, especially after the hit the casinos took with lockdowns etc. Don't say it's a federal law, so is weed, and states are taking it upon themselves to legalize that (which I totally agree with).","165":"While some blame can go to the 'rich' or the 'ruling' or 'privileged' class, most of the blame should be on the parents. If you are poor, ok, that sucks. But having a kid just makes you much more poor. More mouths = more money. Sorry you are a dumbass, but if you voluntarily had one, your extra poverty is kind of on you. Get your finances in a row before you have kids. If you say 'well I'll never be able to have kids then' well sucks, but it's like I'll never be able to afford my own private island, am I oppressed now? I don't think you are owed a baby, frankly.  The kid being born should blame their parents for being idiots.","166":"To clarify my side I’m vaccinated and have been voting Democrat because I think it’s the best choice. I still think that sub is trash. \n\nSomeone one Facebook dies. Their family is horrified and saddened. Same day on reddit front page there are a bunch of people celebrating because your loved one died who they don’t even know. Why the hell is this even allowed. \n\nGuy who heard the vaccine was bad so didn’t get vaccinated and tried to warn others. He really cared about other people but got confused along the way. He had to stop volunteering at the soup clinic because he got covid. Time to get some karma because he died. \n\nLike what? I can’t even comprehend this.","167":"Oh and when I say seethe, I mean who cares if your shit ass country pays you to disagree. You know its true. Your ass wants to shop at our malls. Eat our greasy food. Dance like Footloose and Dirty Dancing. Wear our jeans. You fuckers wish you were us. But you're not.\n\nSeethe bitches! Get yourselves a fucking Constitution. A Bill of Rights. And arm yourselves until they, those who govern you, start getting scared.\n\n#you know I'm right","168":"[removed]","169":"The level of entitlement and myopic stupidity that has been going on for longer than a year just proves that most Americans are mentally incapable of being in charge of their own lives. \n\nYou would think that with a worldwide pandemic going on no one would be dumb enough to argue about health mandates like putting on a mask or getting vaccinate in an effort to get everything back to normal ASAP so we can go back to our lives, but nope…. Not in America where everyone assumes that everything is a conspiracy. \n\nIf you think you should be allowed an exemption from vaccination for anything other than a LEGITIMATE health concern then you deserve to have your precious “civil liberties” stripped from you because clearly you’re too stupid to be allowed to use them properly.","170":"At least high school was free and easy. You go into debt in college just to be a number lost in the crowd. It feels a lot more lonely especially when academics are so much harder. I miss high school so much to the point where I would do anything to go back there.","171":"Getting banned from a subreddit or getting suspended from Reddit is not \"censorship\" for the simple fact that ***censorship*** is when the ***GOVERNMENT*** tells you what you can't say.  For instance if the government were coming to your house and arresting you because you posted something they didn't like that would be censorship but even then there's exceptions.  For example if you posted a threat of violence they could come over and investigate.  Or if you were running Ponzi scams.\n\nNow, Reddit being a private corporation, they legally own both the servers and the code that runs reddit.  When you sign up to use Reddit as a service, you are entering into a legally binding contract by which you agree to abide by the Terms of Service in exchange for use of the the servers and the code.  Just as you're free to stop posting at any time, or free to delete your account at any time, Reddit as a private corporation has the right to decide what goes up on there server's and can also terminate a relationship at any time by deleting your account or banning you.\n\nForcing people to put things up that they don't want is something that is done by petty little socialist\/communist dictators.  Similar to how in North Korea every family has to have a picture of Kim Jong Un in they're house whether they want one or not.  In the free market then you have Reddit has the right as a corporation to decide how best to use their resources.  \n\nThose who disagree should find a different platform where they can express their views.","172":"Google generally does a great job at aggragating information and if you need to look through 6 pages of Google search results to find something that confirms your beliefs it probably means you were incorrect. In addition, I think Wikipedia is a perfectly fine source to pull from and it doesn't deserve to be dismissed outright.","173":"Yes yes you're anti vax yes yes you're being shunned by other subs yes yes you don't like science and (my opinion) yes yes you're selfish idiots who want to watch society burn just because you feel you're entitled to.\n\nBut that's not my point. My point is that you believe you're waaaaay too important to just reply to the countless posts here about antivax being unpopular. That what you think you have to say is too important to just be another comment among other similar comments like yours...as a result? Your special message that you think is too important to just be a comment has become another useless post here in this sub making it ironically popular.\n\n\nYes your \"unique\" and \"unpopular\" opinion is very much common and popular here so instead of creating another post, why don't you reply to all the other similar posts?\n\nOr do you feel waaay too special for that?","174":"It wreck the normies and made their lives hellish. Showed people what happens when you live pay check to pay check and don't save money. Showed that you shouldn't take things for granted, things can change your life overnight, enjoy things while you can.\n\nIt was fun seeing people hoard toilet papers and sanitizers. Instead of things that would actually help them survive society breaking into anarchy like canned foods, medicine and weapons.\n\nBeing able to work and study from home were also a plus thanks to covid.\n\nPeople always complained about overpopulation, yet when covid came around, they advocated to things that would prevent the spread of it. The economic harm done by lockdowns around the world will cause more harm than covid ever would. Things would be better if they had just carried on as normal and let people die of covid. Sweden never had any lockdown, the result? 15000 deaths out of a population of 10 million. 0.15% population loss is clearly not worth any lockdown.\n\nWhen conservatives protested lockdown people were up in arms and whine about it spreading the virus. When BLM and Antifa started their protests, the media and people seems to be quiet about mass gathering being bad.\n\nThe only thing to regret about covid is not having invested in toilet paper stocks.","175":"[removed]","176":"[removed]","177":"Okay, full disclosure, I love my current girlfriend. I'm actually about to ask her to marry me in a few months (I need to buy the ring first). So, this post has nothing to do with my current situation.\n\nNow that this is out the way, I had my fair share of failed relationships. And, to be honest, before my current girlfriend... I never actually felt \"in love\" in the proper definition of the term. \n\nDo I regret it? Fuck, no. I enjoyed all the sex, the cuddles, the parties, the drugs\/alcohol experiences I shared with every girls I had as a partner since I was a teenager. And I don't feel like being with someone just for the good sex is wrong in any way.\n\nOf course, sex is 100000 times better when you are in love, nothing to say against it. BUT... there is nothing wrong about not actually loving your partner, especially if you are young. Just enjoy life, not like if you have several shots at it (not with your conscience anyway).","178":"[removed]","179":"[removed]","180":"[removed]","181":"Screw that. I want NO ONE to “RuLe” me. The only authority I recognize is god. I do not want machines or other countries controlling me and telling us what to do on our own soil. I am not a sheep. No AI will make my descisions for me. I will resist and I will rebel. Similarly, I will not accept “overlords” from other overseas either. My country will not be colonized. I will NEVER be subservient to you.","182":"[removed]","183":"[removed]","184":"[deleted]","185":"[removed]","186":"Cyprus is culturally Middle Eastern, the people are originally of Levantine descent, and became Greek-speaking and Orthodox Christian through Hellenization.\n\nThe Levant as a whole was Greek-speaking and Christian just before the Arab conquest, and Cyprus is a remnant of this. They are literally pre-Arab Levantine people.\n\n“Middle Eastern” does not just mean Arabic-speaking and Muslim, though that is the majority today. If Cyprus is a European nation then why not any other nation that is located outside of Europe and speaks a European language (Angola is not part of Portugal for instance, nor considered Europe).","187":"[deleted]","188":"In the context of #metoo activism, I’d like to believe that people are becoming more aware that “consent” refers to penetrative sex but also to a LOT of other things in life, in and out of the bedroom. For example, the belief that if a woman says “no” to a date with a man, he should believe her the first time, and not try to change her mind.\n\nAs a lesbian, you will always reject a man’s offer of a date or sex, right?\n\nSo why can’t you accept that hetero women have the right to reject you because you are a woman? \n\nIt is a sexual boundary, no less legitimate than yours.\n\nTelling a woman that she SHOULD date women, when you know she doesn’t want to, is powerfully anti-consent. \n\nWould you want to be in a sexual relationship with someone who you know is not attracted to you, and moreover, who you know is attracted only to men? Surely not - so why inflict that experience on other lesbians? Do you think they deserve to be used in this way?\n\nBeing a hetero woman and choosing abstinence is one thing, but it’s not feminist to tell women that they have to live in a way that’s actively inauthentic. In the same way that lesbians don’t need to be “fixed” by men, hetero women do not need fixing, and their sexual orientation will not change no matter how much unwanted sex they engage in (also known as rape).\n\nPenny White made a YouTube video discussing her experience with this. She said that “lesbians don’t want you to try [to become lesbian].” I hope this is true of most of them. So many on the internet insist that you can’t be a real feminist if you don’t date or have sex with women, and it’s a harmful lie. Don’t shame women for being hetero. Don’t pressure them into sex that they don’t want. Don’t pretend that rape is inevitable if you date men, and therefore all women raped by their boyfriends\/husbands deserved it. Don’t pretend that all men rape. Don’t pretend that women are not violent psychopaths who can always be trusted not to rape. Sixty percent of women in same-sex relationships report being abused by their partner, compared to thirty-five percent of women who date men, so why lie? You never know whether the woman you’re trying to brainwash is a survivor of same-sex rape, like me. The last thing we need is to be told that our trauma didn’t happen.","189":"Rape is so wide spread - 1\/4 girls and 1\/6 boys will experience sexual violence as children.\n\nAlso if you are a woman, chances are it's not if you will be raped, but rather when.\n\nSo many people (Easily found on reddit) downplay rape as if it's like someone burning your house down. It's fucking not - it's more like someone burning your life down, your self-esteem down, your feeling of safety down, your future down, and so on. People just can't get it through their thick af skulls that rape is probably the worst thing you can do to another living being. And that is coming from someone who was homeless, nearly killed (Held over a balcony and was threatened to be dropped), and horribly abused every which way as a child.\n\nI had my brother give me a knife, pointed it at his chest and told me \"If you hate me that badly, kill me\" and then years later killed himself (he was 16, I was 12). And that is being tickled compared to the pain of being raped.\n\nHell scrolling down here you see a very popular opinion that falsely accusing rape is worse than actual rape. Fucking *what?*","190":"    We have a solution to global warning, revert before the industrial revolution, stop using your phones, your cars, your heaters, your conditioners, your manufacturered goods. Get a horse and buggy, learn to plow, learn to sow, learher working, and live on your own. Seriously.\n\nRevert back to the pre 1800s and the age pf cotton gins and human life will continue and the earth will survive. We'll also be less comfortable in some ways, but hey laborers back then didnt work to hours on a clock, they worked by the job. If ya wanted to have a beer with mates, take a break from shoemaking.\n\n\nIs this a position I Seriously agree with? Ehh not really hence why im using a expensive phone right now, but sometimes I think it'd be nice to be a ignorant farmer in 1790, too busy plowing fields to worry about the fate of the world or some country in the middleeast.","191":"r\/genzedong for the link. It contains a specific point of view that some people myself included like. It shows that there are multiple perspectives in the world. It has strict moderation so trolls don’t exist there. It supports denism that is unpopular in Amerikkka and it shows solidarity with all communist countries. Even some that I don’t like.","192":"[removed]","193":"[removed]","194":"[removed]","195":"This will be the most controversial post and view Reddit will have. But to be honest, throughout my research and gathering of this process... I am willing to accept every outcome headed my way.\n\nAfter looking around at r\/HermanCainAward, especially with it's growth (whether by the recent articles or not), as a fond person of researching I decided to tackle the claims the people make that say that sub is bad because it celebrates death. This is accompanied by them stating that it breaks the rules of Reddit. Mainly Rule 1. So in order to tackle these claims, I present to you this post.\n\nFirst let's go over, **Rule 1**\n\n>Remember the human. Reddit is a place for creating community and belonging, not for attacking marginalized or vulnerable groups of people. Everyone has a right to use Reddit free of harassment, bullying, and threats of violence. ***Communities and users that incite violence or that promote hate based on identity or vulnerability will be banned.***\n\n[Inciting violence](https:\/\/www.reddithelp.com\/hc\/en-us\/articles\/360043513151) and [the hate sections](https:\/\/www.reddithelp.com\/hc\/en-us\/articles\/360045715951) have hyperlinks in them so they can provide examples in terms of context.\n\nThis is what people who dislike the sub form their basis on breaking ToS. This rule thanks to it's last section on both grounds. So now let's dissect them one by one.\n\nFirst, **inciting violence**. To incite by definition [thanks to webster](https:\/\/www.merriam-webster.com\/dictionary\/incite#:~:text=transitive%20verb,up%20%3A%20spur%20on%20%3A%20urge%20on), it is to encourage, urge, or stir up. Is the sub encouraging Anti-Vaxxers to die? No, absolutely not. The majority of the posts are post screen caps which critique anti-vaxxers and showcase how COVID disinformation kills. The posts with the caps are catalogued in chronological order, starting from people believing in disinformation about COVID to either their demise or their realization. How is basing something off of a poster showcasing another persons history \"inciting violence\"?\n\nThis is the easiest to debunk. How easy? Is the OP of the post voicing their opinion of them? No. It's just their history. The fact they have no thoughts about the person and that they are showcasing the person's life is not encouraging violence. If that's the case, most history subs would be banned\n\nIf you still don't believe me, go into any of the posts and look at the criteria I posed. As in look back at that same webster definition and see if it applies to comments.\n\nPlus consider the second rule of that sub, which is \"don't root for nominees to be awarded\". If that comment is inciting, the mods will report it and take it down because that's wishing death, promoting it, which is against Reddit's rules. They know that comments that promote death can get banned, plus [considering the nature that this sub doesn't want to exist but because of them are anyway](https:\/\/www.reddit.com\/r\/HermanCainAward\/comments\/psyp4w\/for_those_who_say_the_hca_are_immoral_lets_see\/), it's right for them to do to enforce that rule.\n\nNext, **hate based on identity**. How Reddit identifies hate by identity falls under these categories and I quote;\n\n>based on their actual and perceived race, color, religion, national origin, ethnicity, immigration status, gender, gender identity, sexual orientation, pregnancy, or disability. These include victims of a major violent event and their families. \n\nThis other bad faith argumentation of the sub is on the grounds of their own political identity, because apparently it is now a political side. This is tricky to dissect. While one could argue political identity being a part of the many examples of hate on identity, I argue against that.\n\nIf we want to go further into this let's look at the possible counter-argument, [did you know that companies can deny you because of your political beliefs?](https:\/\/www.forbes.com\/sites\/tomspiggle\/2021\/02\/24\/is-political-discrimination-in-the-workplace-legal\/?sh=7778d88c68dd) [This extends more to Title VII of the Civil Rights Act of 1964.](https:\/\/www.eeoc.gov\/statutes\/title-vii-civil-rights-act-1964) This would be a no-shit moment if you've been banned in political subs where your ideals are different from the majority but this is reality. That is not the case with here.\n\nWhy not? If I am honest, while I can make a case that a company denying a person thanks to their political views is discrimination, in a case like this subreddit and other related areas to it, it's very different.\n\nOne is a job that require humans to work for to ensure their livelihood, the other is just a club with no purpose. One is about working for change for your right to paycheck, the other is goofing off. You see? One is client to client for their needs, the other is just not about the needs and is only one-party.\n\nThat sub is that other. It's not providing needs to other people out of necessity. Jobs vs subs are very different.\n\nAlso for the main meat to connect this; political identity's change over time as we grow and develop new takes on situations, one idea today could be a bad one later. Political affiliations swing from human to human as we get older or we get exposed to new identity's. To put it bluntly, the things Reddit listed such as race, identity, gender, sex, disability are all things we can't change. Political affiliation we can change. So why discriminate when we can change affiliations?\n\nThe virus has no political sides, this virus took the left and the right, even some anti-vaxxers are left wings too but very very rarely is that the case. Even if the majority is the opposition, it's not hate because you can change it. If you can't change it and that's your personality\/life\/body, it's hate. That's in layman's terms Reddit provided.\n\nTL;DR: That sub **does not** violate Reddit ToS. The incitement is not there, and the hatred is non-existent. That sub is all a PSA about how disinformation in today's society can kill by showcasing a person's life. Call it a memorial, call it a scared straight message, but it isn't a place to dance at deaths.\n\nAlso I find it ironic that for people on Reddit who hate this sub (mainly some on the opposition) are also Free Speech Warriors. It's funny really, you claim to support Free Speech but be willing to ban this sub... That's funny.","196":"[deleted]","197":"Everyone likes to shit on fortnite but I have a blast playing it. I love the concept of battle royale, it makes me take the match seriously. \n\nIts like hunger games with guns. I get immersed in every round. It's an open world, survival fps game and I think that's awesome. \n\nShit on it all you like, but there's no denying it changed the course of fps games forever.\n\nP.s minecraft is better tho","198":"I think vegans get a lot of hate. Sometimes, it's for some crazy shit PETA is doing, but for the vast majority of times, it's clear people just enjoy getting annoyed or angry at vegans easier. It's never made sense to me. Veganism isn't a choice that effects other people. If anything, given veganism has less of an environmental impact, it's considerably better for those around you to be vegan.\n\nYet, the anger persists. Why? Well, it's pretty simple. People feel insecure, because they're aware that meat-eating is the ethically worse option. Meat-eating is unhealthier, it hurts the environment and it leads to all that disgusting, sadistic shit that we put animals through. And, let's be honest... at this point, we're all aware of that fact. The evidence is so overwhelming that anyone who denies veganism is better is just doing some premium coping, and it's honestly so pathetic.\n\nIf you want to eat meat, feel free. People make bad choices all the time, that's human nature. I don't particularly care either way. It's the weakness I see in a lot of meat-eaters that annoys me. The inability to just be strong and stand by the choices you make, rather than having to lie and pretend you're not picking the worse option. It's like a smoker trying to still argue \"Smoking actually helps, look at this study from the 1860s!\" Honestly, it's embarrassing.\n\nOh, and not that it's relevant to the opinion, but I'm not a vegan. Meat is absolutely delicious, especially in a nice BBQ. I'm about to eat some pulled pork in a sandwich right now. I recognize veganism as the better option, but so is not smoking when I drink, and I don't do that either. We're all only human.","199":"[removed]","200":"[removed]","201":"[removed]","202":"I see a lot of people including some \"leftists\" that think that the left is trying to cancel anyone who makes an offensive joke, and I don't think that's the case anymore. Don't get me wrong, some people think that making 1 offensive joke makes you a nazi, but most leftists don't believe that. They think that making a offensive joke on a public forum, like twitter, can\n\n 1: turn people into believing nazism or racist ideologies\n\n 2: makes nazis or racists feel safe\n\n3: can offend random people scrolling\n\nMaking an offensive joke around friends is fine. No one wants to cancel that. Making a jew joke around friends ain't gonna turn them into nazis, or make them feel safe to be a nazi because they aren't nazis. The joke also probably wouldn't offend your friends. I don't want to cancel offensive jokes on public forums, I just want people to know that the left doesn't want to cancel jokes on public forums because they are offended by it. It's way more nuanced than that.","203":"I would much rather listen to lyrics in which a guy talks about the multiple reasons why he appreciates his girlfriend or wife then listen to a song about how much some guy wants a girl to \"shake it\" for him or one about a girl that exclusively talks about how hot the guy singing thinks she is in a overly sleazy way. Likability matters in music and it does make songs like \"She's With Me\" by High Valley enjoyable\n\nI get that country fans generally think that all pop country is offensive garbage so I'm not expecting anyone to agree with me that this stuff is good. But do you agree that the increase in likability helps?","204":"Being afraid of an FDA vaccine is a new level of stupid and throwing away a job because of it reaches yet another level. Replacing those imbeciles with someone who understands the world around them and doesn’t fall for propaganda will lead to a smarter workforce and a strengthened confidence in those workers. \n\nThis will also lead to an easing of unemployment benefits, as those who weren’t working can find jobs and those who quit aren’t eligible for said benefits.\n\nEDIT: I guess all the downvotes mean this opinion is popular here!","205":"The west has become decadent and degenerate. We are obsessed with IDpol, abortions and all the other distractions\n\nIndia and China do not concern themselves with such trivialities \n\nThey will lead humanity into a new age of techno-capitalism\n\nLong live our Sino-Indian overlords. We, your humble thralls, worship you!","206":"[removed]","207":"[removed]","208":"I cherish democracy and plose note that I myself am no buerocrat, I'm an ordinary citizen. Most ordinary citizens are assshit stupid, seriously spend a few minutes on Twitter and you'll agree with me. The entire reason we're a republic and not a democracy is to account for the fact people are stupid. If we allowed people to vote directly on policies, our country would collapse In a decade. I dont care for the argument that \"Oh but so and so Is voting on a law that most of his voters don't like\" he was voted in to use his congressional vote intelligently, secondary to that he was voted in to represent his populous but that shouldn't come before his duty to be intelligent with his vote. \n\nIf the citizens are unhappy with how their politician used their vote, they are free to vote someone else in.","209":"[removed]","210":"Not a conspiracy theorist. \n\nNot saying there is some cabal plucking the strings trying to make a one world government. But it’s just inevitable. \n\nSince 1920 and the League of Nations this idea has been thrown around. Today we have the United Nations, and although today it doesn’t really do much besides some aid work, the foundation for a one world government is already here.\n\n\nIf you think that it’s impossible because the world is too divided, look at the European Union. 80 years ago Europe was still a war zone, with all the little countries fighting for dominance. Today, all of Western Europe essentially functions as one nation, to great benefit of its members. Yeah, the UK left, and it’s been a disaster. England trying to play empire again like it’s 1912. The UK will have no choice but to go back to the EU soon.\n\nThe only thing needed for transition to a one world government is a world changing crisis. Something much bigger than covid. Either another world war or climate change. But I doubt any major nations will go to war because of nuclear weapons, but climate change is inevitable and already happening.\n\nSo this could potentially happen this century if things get bad enough, but it’s almost certain to happen in the next century.","211":"I've always seen these two opinions treated incredibly differently. Racism is seen as wrong and immoral... but discrimination based on nationality is common place. Almost everyone seems to agree it's fine.\n\nPretty simply, the reason racism is bad is because you're discriminating against someone for a characteristic of their birth that they did not choose and that has no effect on their character. Another characteristic that fits that exact same field? Nationality.\n\nPeople would have an outcry if a patient was denied service because he was white or black, but the notion that illegal immigrants not only don't deserve healthcare, but should have their kids taken away and be kicked out of the country is commonplace. There's a debate over how inhumane the discrimination should be, but near everyone agrees it's justified.\n\nI see people get offended by this opinion, and it's certainly very unpopular. But honestly? Not once have I ever seen an actual argument, let alone a rational one, for this discrimination.\n\nHonestly, I'm sure that in the future, we'll look back on this as a barbaric practice that we're glad we abolished.","212":"“Sticks and stones may break my bones but words will never hurt me”. Well now we have adults who think that words should be classified as assault with terms like “misgendering” and “deadnaming”. Instead of just getting over things they don’t like hearing, they want the world to stop saying them.\n\n“The ends don’t justify the means”. Now we have people that use whatever justification they need to in order to get the result they want. It doesn’t matter if it involves theft, discrimination, or forcing drugs on people, as long as it helps “the greater good”. \n\nThese same people need to read the children’s book “if you give a mouse a cookie”. The biggest problem with progressivism is that there is no goal, it’s just constant change. You can’t appease them as anytime they get what they want they just push for the next thing. Every achievement is just a stepping stone to demand the next thing.","213":"Natural immunity has been proven to be better and longer lasting than the vaccines because the immune system is exposed to the virus in its entirety and not just a very small piece of the virus (as with the vaccines). If the virus mutates and the spike protein is what is mutated, vaccinated individuals will technically be unvaccinated again (thus requiring boosters) and those with natural immunity will fight the virus much more efficiently because their immune systems have been exposed to *all* of the virus. It's scientifically called \"[active immunity](https:\/\/www.cdc.gov\/vaccines\/vac-gen\/immunity-types.htm)\" and the science community has agreed since the beginning of time that it offers almost life-long protection.\n\nNone of these mandates\/vaccine passports make sense with what we know about this virus and the vaccines. People who are pro-vaccine mandate are spreading literal misinformation from Jan 2021 to further defend the mandates when all of that has changed.\n\nWe yelled \"follow the science\" but I think most of us got lost along the way.\n\nHere are some sources to support my claims:\n\n[https:\/\/www.medrxiv.org\/content\/10.1101\/2021.06.01.21258176v3](https:\/\/www.medrxiv.org\/content\/10.1101\/2021.06.01.21258176v3)\n\n[https:\/\/www.medrxiv.org\/content\/10.1101\/2021.08.24.21262415v1](https:\/\/www.medrxiv.org\/content\/10.1101\/2021.08.24.21262415v1)\n\n[https:\/\/medicine.wustl.edu\/news\/good-news-mild-covid-19-induces-lasting-antibody-protection\/](https:\/\/medicine.wustl.edu\/news\/good-news-mild-covid-19-induces-lasting-antibody-protection\/)\n\n[https:\/\/video.foxnews.com\/v\/6267860705001#sp=show-clips](https:\/\/video.foxnews.com\/v\/6267860705001#sp=show-clips)","214":"[removed]","215":"[removed]","216":"Everything I hear about NZ makes me think it's worse than a third world country. \n\nThe leader of NZ is a totalitarian dictator who confiscated law abiding citizens' firearms as punishment for one psycho's actions. She has handled the coovid like a true dictator as well, with lockdown quarantines patrolled by armed police officers forcing people into their homes like dogs in cages.\n\nAfghanistan seems like a hellhole too but at least you're allowed to own a gun and go outside without the state's permission...if you're male I guess. :-(","217":"Every conservative narrative and rally cry is based around reacting to whatever the democratic platform is. They don't present any goals of their own, they don't have a unique vision for the country (at least not one that they are willing to define for us) everything they say revolves around \"you better vote for me because the left wants to do X\". I wish they would stop talking about what the left wants to do and tell all of us what it is that *they* want to do.","218":"Added: I am NOT saying the weak or victims deserve disrespect (much less the less polite synonyms thereof).  I believe the exact opposite. The strong, smart, brave, and competent have a duty to help those less fortunate than themselves. Putting them under pressure rarely works as a way to help such people stand on their own feet, notwithstanding inspirational motivation stories. In fact, it's more likely to make them less effectual, due to raising the price for so-called self-improvement (I say so-called because my idea of self-improvement is moral and ethical, of which money, power, sex appeal, popularity, glory-getting, community status and prestige is no substitute). With that said, I'll go on to my reasons I don't take either those phrases seriously, and even say that victim-blaming is immoral in and of itself.\n\n&#x200B;\n\n\\-  Confuses *inability* to stop or reverse a bad thing with *willfully allowing* a bad thing happen (\"letting\", a usual synonym for allowing, is also victim-blaming)\n\n\\- Fails to see that sometimes lack of bad intent *does* excuse undesirable outcomes, even if other times it's no \"Get Out Of Jail Free\" card.\n\n\\- Shifts responsibility on people least able to handle the difficulty,  thereby putting an unreasonable burden on the person (How can you be responsible for something if you're unable to deal with it?)\n\n\\- Sees responsibility itself more in terms of *favorable results*, rather than taking an unsuccessful action against the bad thing.\n\n\\- Ignores the unique details of the person's life experience that caused him or her to take either no or insufficient action to stop the bad thing, This includes repeated experiences of even worse treatment or scorn for actually trying and failing than if they didn't try at all (which, let's face it, is not exactly a rare reaction from onlookers).\n\n\\-Shoehorns the average person's abilities and talents into the victim, thus making a false comparison.\n\n\\- Irrationally shames victimhood itself when the victim clearly lacked intent to do a bad thing to anyone. This implies the blamer has either crude understandings of free will or vastly underestimates either (a) the bad consequences of a failed effort to stop a bad thing\n\nAnd these are why I find \"Toughen Up!\", \"Don't be stupid!\" as supposed motivators or otherwise \"cures\" for another person's shortcommings a joke.  Only detailed sympathetic back and forth conversations can even begin to alleviate any supposed problem. Unfortunately, that also means that the mainstream also has to open its mind to the prospect that they are the ones mistaken and\/or the victim is justified in their victimhood.","219":"[removed]","220":"[removed]","221":"First off I am a guy so...\n\nReading comments on Facebook and Twitter of people saying \"We don't know the whole story\" or \"She admitted to scratching him\" or \"Police were justified in releasing him because of due process\" and other stupid excuses about why her fiancé might be or is innocent.\n\nIt's sick he clearly killed her or left her in a situation to be killed. Why did he have her van? Be cause he left her (dead or alive) out in the wilderness. Why is he evading police and fleeing (if he is still alive) because he knows he's guilty.\n\nThe police didn't take her concerns seriously when they were pulled over. She told them she was worried he was going to abandon her at the location they were going to and that she would be dead. The local police just let him go back with her.\n\nThe media keeps showing pictures of her happy with her Fiancé as if he wasn't just the person who killed her.\n\nMen have the privilege's of not needing to worry about not being believed or not being given the benefit of the doubt or even made to look good when they murder or rape women.\n\nIf you have an opinion about this story other then he is responsible for her death then you're a disgusting human being.","222":"[removed]","223":"The right loves to talk about how the real unvaccinated Covid threat comes from illegal aliens.  However most of the Haitian refugees came to the border by way of Chile and Chile has one of the highest vaccination rates.  The Haitian refugees are actually MORE likely to be vaxxed than the yt Texans across the border who are turning public safety into a political issue.","224":"[removed]","225":"[deleted]","226":"[removed]","227":"Before you call me a CCP shill no, I’m pro-American and I hope we win the second Cold War. BUT people are acting way too bigoted and vicious towards China. They aren’t a “personal” enemy the same way the Islamic state or Soviet Union were. They don’t seek to erase our way of life like Cold War era Communists nor are they frothing with genocidal hatred towards us like Islamic Terrorists. They’re just on the opposite team. Cool down.","228":"now i know what you guys are going to say. \"the mcu is so big its not unpopular\". well hear me out first and you might get why i think my particular opinion is actually unpopular.\n\nyou see, i think that the marvel movies are actually really solid films. like the acting ,the cinematography, the directing and how they are all writen to fit in with eachother. really complicated stuff that hasnt really been done before on this scale. i know a lot of people watch these movies, but i dont think they really \"get it\" on the scale i do. for example, the other day i was in a public restroom at the urinal. i was starting up some small talk with the guy next to me. \"you seen the trailer for the new spiderman?\" i said. \"tom hollands looking real good in it!\" the guy sorta just looked around awkwardly and was then like \"uhh yeah\". i doubt he even saw the trailer. in fact, he couldnt even tell me who directed the tobey maguire spiderman movies. any true mcu fan would know they were directed by Sam Raimi. you see, the general populace doesnt appreciate marvel films like i do. i also tried talking to my grandfather about the new Shang Chi film, but he didnt even know what it was. i showed him the trailer and he just got into this weird jingoistic rant about chinese people. so not only is the general populace not a marvel fan, theyre also extremely racist.\n\ni know most reddit users see the MCU as bad and \"consoomery\" or whatever but im just here to say that they are actually kinda good and people need to give it a chance.","229":"It's weird how people complain about celebrity worship. 'Oh no, are we really getting our morals from Cardi B?' We aren't. If you want to, that's your choice. I don't. Very few people do. If you are concerned people take their morals from Cardi B, so what? And I can say I'm concerned you take morals from your mom. Or your teacher. Taking morals from someone isn't bad. You can argue it's bad to take morals from bad people. Ok, but it has nothing to do with them being celebrity then. \n\nI just find it strange why people think it affects them so much. I've never ran into anyone telling me to do something because 'Cardi B' said so. I'm just not seeing the 'problem' with 'celebrity worship' Let idiots be idiots as long as they don't enact laws about it.","230":"There's tends to be two views regarding Lenin - either that he was a \"man of the people\" (clearly wasn't) or that he was a dictator.\n\nWhat people often forget about the Russian Revolution was that there was multiple factions of socialism and not all them were dictatorial like Lenin, nor Marxist.\n\nSome actually believed and advocated for a democratic system, yet Lenin and his cronies overthrew them.\n\nPeople associate socialism with Marxism and Lenin, yet forget about all these prior factions before Lenin.\n\nI have always wondered what socialism would be like today if the more democratic forces within the revolution actual won over Lenin's faction.\n\nThere was a genuine chance we could have seen a much more benign and humane socialism, one where there could have been a better alternative to the capitalist systems we have today.\n\nThey still allowed private property, not to the degree of mega corporations but they did genuinely have more respect for human rights.\n\nYet people on both sides associate socialism with Marx and Lenin, and I personally think there is something tragic about this. Lenin was a dictator, and he deserves no praise for his humanity, but socialism as an idea and system of governance could have been a genuine alternative and a good thing... If it wasn't for Lenin","231":"[removed]","232":"[removed]","233":"[removed]","234":"[deleted]","235":"I understand where they’re coming from. It’s stupid, but I get it. But they’re making a choice and they should not clog up hospitals because of that choice. So it only makes sense that should they catch Covid-19 and need intensive care, people with conditions that cannot be stopped by a vaccine or people who have the virus but cannot get the vaccine for valid medical reasons should be prioritized.","236":"I just post, \n\n\"Came here to say this\" on the first comment.  I don't even read the comment.  I don't even read the fucking post.  I go to r\/popular, sort by rising and just post the reddit conformity pornography.  Sometimes it gets up voted.  Sometimes it gets down voted.  \n\nWhy do you people hate freedom?  Why do you orgasm so hard over conformity?  You people are all perverts.","237":"*cannot abstain\n\nIf we say that people are horny and simply cannot control themselves, it would then extend to assault. Which is why it doesn't make sense. People can control whether or not they choose to violate another person, then even if the other is consenting, you can still choose to not have sex with them. \n\nNow, it doesn't matter if abortion is legal, however, if it is illegal, you have no one to blame but yourself if you consented to having sex and  if you find yourself with an unwanted pregnancy.","238":"Shouldn't because obviously we can not hog tie people and sterilize them against their will, nor should we. \n\nHowever, I believe most parents are bad and unethical parents. My standard is asking them the question if they would want the life they give their children. Most say no. The people in poverty say they hate poverty and pity their children, or want a better life for them. Yet they still had the kid. If you consented to having a kid, then you are at fault. \n\nNow that's one group. Another group includes those with mental health issues. Or heritable genetics\n\nAs someone who is poor and with mental issues, I would hate to be raised by me. \n\nYet somehow its taboo to say that people who are in the poverty line are not good parents. \nYour kid should never go to bed hungry. If you had a kid by consent, you should never had put the kid in that position, I see that as hypocritical.","239":"[deleted]","240":"Any person can sue someone who they suspect had an abortion and collect $10,000. Same goes for anyone involved in the process of her getting an abortion. An Uber driver that drives her to the hospital where she has the abortion could be sued by any private citizen. That’s complete madness and doesn’t make sense in the US legal system. To collect damages in court, the suing party has to have been *damaged* in some way. If abortion is *murder*, then it should only be settled in criminal court. \n\nIt’s completely backwards.","241":"The one thing I personally think of whenever social media is once again under the analytic judgment of articles is that it's not toxic on it's own. I've been online for a long time to really understand this fully than most who're too prideful that they go around, boastfully declaring how they've deleted their Facebook, their Instagram, their Twitter .etc\n\nAnd the fact of the matter is - no one really cares. You're fluffing your ego and self-esteem a little, while also being the beacon as to how you're part of the problem I'm talking about.\n\nYou see, Mark Zuckerberg may have had a point in that recounted quote people love to display whenever the topic of him or FB comes up. The quote where he calls people dumbasses for trusting him. I think that rings true for a lot of the behavior that people do online. They invest so much trust and hand off responsibility to all of the online services to handle things *for them*. It's honestly like being that dumb mother who popped 3 kids and wants people to watch them overnight so she can go out and get wasted. It's exactly like that.\n\nAnd still, over the years, people have demonstrated that it's their bad faith and bad intent online is what's been making the atmosphere of social media toxic. But why blame yourself, when it's easier to just brand yet another thing as toxic?\n\nI'll never argue with anyone about social media being bloated, because it seriously is. But I'll die on the hill that social media isn't that toxic as people say. Social Media is an engine and it needed a fuel tank to run. The toxic people are what's been helping to run it and served as endless amounts of fuel.","242":"I don't know where this trend originates from or what occasion it's meant for, by occasionally, I'd see some image of someone or advertisement for what appears to be beverages served out of an ordinary looking glass jar with an absent screw top lid.  From my limited impression, this looks really trashy, like trailer trashy. It's like the type of choice a person would choose if they couldn't afford a cup and decided to use a leftover pickle jar for consuming their drink.  I don't know if this is a hipster thing or a southern thing but it just looks like freaking trash.","243":"[removed]","244":"[removed]","245":"Every tragedy that has stemmed from a great divide within a society consisted of two groups: the oppressed and the oppressors. The oppressors were the majority (either in number or in power) and oftentimes had their nation's government encouraging, or backing them up. The oppressed were the minority and were often censored, condemned, shunned, mistreated, and outcasted with little to no governmental backing.\n\nIf you are standing on the majority side, you are on the wrong side of history.","246":"If you say this isnt unpopular LOOK AT EVERY POST I MADE ON THIS SUB!!!\n\nSafe to say many dont take kindly to an unpopular opinion ON A SUB ABOUT UNPOPULAR OPINIONS!!!\n\nIf your gonna insult someone for an unpopular opinion maybe unpopular opinion subs arent for you.\n\nAnd the downvoting does nothing but silence the person.\n\nCalling them a troll proves you dont know what an unpopular opinion is.","247":"I’m seeing more and more things get labeled as toxic in an attempt to demonize them. Something being “toxic” doesn’t make it bad. A lot of people enjoy things you might call toxic.\n\nVideo games are a good example. A lot of people enjoy talking shit while playing games and it used to be accepted. Now more and more rules get made to prevent it because easily offended pussies joined the community and then complained that it was toxic. They had the ability to mute the mic but instead demanded that everyone be “nicer”. \n\nMasculinity is another example. What used to be seen as normal male behavior now gets labelled as toxic, mostly by women. Not only do a lot of males enjoy that behavior, the idea that women get a say in what’s considered acceptable masculinity is insane. \n\nThere’s plenty of other examples like the workplace or social media. All places that used to accept “toxic” behavior because most people enjoyed it. Now rules and laws have been made in an effort to protect the feelings of those easily offended.","248":"I was convinced by a person who saw a post to post this on CMV but I held off on it considering they had their fresh Friday theme, and I want it to give it a try. So this is a good alternative.\n\nYou know how in the US where we live it's two parties? I say fuck this American Tribalism Bullshit. No one is thinking straight in the world of politics. Hell, no one debates anymore in a way that drives discussion. People have been putting your own party in front instead of putting your country front. And for what purpose? To own someone, to own the libs or conservatives in this world? When they tried to do something that they care about, they have done nothing, did jackshit, and when they do it, it’s just to get validation and not REAL change.\n\nI have been living here for my entire GODDAMN life, I have multiple people who have a lot of political ideas with many solutions but are forced into an us-vs-them thanks to the “left” and “right” mentality that killed what I believe is essential to Democracy, CIVIL fucking DISCOURSE. We all have many ideas with many solutions but because of them, we get shit talked and one side has one solution that we have to agree on not realizing there are multiple ideas out there. I understand the two-party system and to be honest, both sides have policies that differ in certain aspects.\n\nAnd my whole thesis is basically because we are so individualized in every way, we have a lot of ideas at our disposal, but with two sides, we don't utilize every idea, if both ideas from both sides are trash, why can't we make another one? It's the same us-them mentality that drives it, eliminating independent thought and ideas.\n\nThere are no sides. And judging from the state of human rights in America, the real enemies are the ones taking any humans rights away regardless of gender, sex, race, ethnic, etc. There are claims that human rights are being stripped thanks to Republican Party. They are not one sided, I’ve seen both sides limit and take away human rights on both ends of the spectrum. And before you piss your pants and say this is centrist talk, yeah fucking right, “centrism” is a dumb buzzword to eliminate the idea of independent political thinkers who have solutions that are wildly different from both sides.\n\nAlso the amount of hypocrisy, GOOD GOD, it’s even MORE proof we run on party over country. Most of these \"sides\" only care about these issues if it benefits their party, cases in point:\n\nThose free speech warriors; Like banning TikTok over no proof and all misinformation all because its user base criticized the right and those warriors tried to slander the company then promote GETTR who actively censors the left ([including this group who debunks the TikTok misinfomation](https:\/\/gettr.com\/post\/p2evef)).\n\nThose Blue Lives Matter who stormed the capitol gunning down the police that they themselves “love so much”. Holy fuck, even the police killed one and these people made that person the hero while pissing over George Floyd to shill police love when they also shill the “hero” who got gunned down by police. I think her name was... Ashli Babbitt?\n\nAnd these two are just the beginning!\n\nHell I don’t think they gave a shit about China or Russia or now with Afghanistan and the Taliban, they just use it as a buzzword for validation but do NOTHING to solve the issue. For instance: As much as everyone on Reddit “hates” China, THE SIDES HAVEN’T DONE SHIT. Why don’t they just make a change by protesting over there and promote country over party by realizing that party’s do jack and making the US known there?\n\nYep I said it, those are keyboard warriors. I guess all these party’s can do is comment China and Russia Bad and be all talk and no bite. Pussies is the better term.\n\nYes. Them bad. But are they doing something about it besides posting a comment on reddit for feeling validation? No. Posting it to promote your party by being a slacktivist? Yes. The sides care about their issues if it benefits them, and not everyone. They care about themselves. That's what these sides do! It's a ploy to destroy civil discourse and democracy!\n\nYes, it is all that it is, performative slacktivism! They NEVER gave a FUCK about any issue, they just promote it and IGNORE it to promote your PARTY. Hell even then, these guys will spew misinformation no matter the side to promote your ideology.\n\nThey care about CLOUT and CLOUT alone to fuel the division instead of CHANGE.\n\nSpeaking of which...\n\nI understand we have a lot of questions about the law, but FUCK we have a lot of case laws set in place that they ignore under the guise of “fake news” and “propaganda”. Critical thinking and research is dead, these \"sides\" want to be reinforced. And that’s the worst part, each sides ideology has multiple influences for both parties and you have to pick the side who has the most ideologies that you want to see change. It’s lesser of the two evils and it promotes THIS. This toxic team battle that ends up killing rational, civil, and respectful discussion that you fuckers, no matter the side, think it’s for the fucking “greater good”.\n\nThere is no LEFT and there is no RIGHT. The true enemy is the politicians killing your human rights. We should come together to fight the evils. And care for the things you love.","249":"[removed]","250":"My dad needed emergency care because of a burn on his chest and arms, but there was no proper bed available, so we had to take the shitty home are option, which increases recovery time by 2 weeks.\n\nYou know why there were no beds? Cause of fucking unvaxxed smart asses. In every hospital we applied to for a bed, they only had 1-3 vaxxed patients, and the rest of the beds and care units were filled with unvaxxed ones. And the vaxxed ones didn’t even come because of Covid. \n\nThis basically is all the information I need to form the opinion in the title. Unvaxxed people should be given lowest priority, and TBH, I think hospitals should have the right to boot them off of beds, if a vaxxed person needs any care at all.\n\nNote I live in the UAE\n\nAlso mom is a pediatrician, thats why we know data about the vaxxed, she has friends who talk about this","251":"[removed]","252":"[removed]","253":"More than 15 studies have demonstrated the power of immunity acquired by previously having the virus. A 700,000-person study from Israel two weeks ago found that those who had experienced prior infections were 27 times less likely to get a second symptomatic covid infection than those who were vaccinated. This affirmed a June Cleveland Clinic study of health-care workers (who are often exposed to the virus), in which none who had previously tested positive for the coronavirus got reinfected. The study authors concluded that “individuals who have had SARS-CoV-2 infection are unlikely to benefit from covid-19 vaccination.” And in May, a Washington University study found that even a mild covid infection resulted in long-lasting immunity.\n\n- [Washington Post](https:\/\/www.washingtonpost.com\/outlook\/2021\/09\/15\/natural-immunity-vaccine-mandate\/)","254":" Saying that you \"did your own research\" usually means you spent 10 minutes reading a sketchy article you found linked on social media. Or worse, a series of images with text.\n\nThe very idea that basic bitch people like you and me are even capable of doing \"research\" into the viability of a vaccine is absurd. I absolutely did NOT do any research into the vaccine before I got it. Because the appropriate professional bodies did that already.\n\nDo you do \"research\" on every bridge before you cross it? How about \"researching\" the ingredients of that Mountain Dew?\n\nBasically, just be more fucking humble and defer to the professionals. You and I are not experts and we DON'T know what's best for us.\n\n(This of course doesn't apply to you if you actually are one of those experts. In which case, keep up the good work.)","255":"[removed]","256":"[removed]","257":"i get it a majority of the users on this platform are american but can we have some opinions on here that arent just america this and america that .  i just want to browse this subreddit looking for actual unique opinions that isnt just X- American President should of been impeached . i want some unique opinions that arent america related in anyway .","258":"I know a lot of people tend to react poorly to even the concept of others being fat, and I definitely agree. Obesity is a serious problem in the First World, and it's something we're going to need to deal with. I'm not saying that we should treat obesity as a positive, nor should we encourage it. \n\nHowever, we need to teach fat people to love themselves, and their bodies, so that they can improve upon them. After all, one can love something while acknowledging it has faults, and if anything, loving something is going to make you much more likely to dedicate the effort to fix those faults.\n\nWe can see that with how damaging the inverse, fat shaming, is. It's been proven time after time to be ineffective, because shame makes people eat. [Source 1](https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/25212272), [Source 2](https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/23894586), [Source 3](https:\/\/journals.plos.org\/plosone\/article?id=10.1371\/journal.pone.0070048), [Source 4](https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/21760636), [Source 5](https:\/\/www.sciencedirect.com\/science\/article\/pii\/S0022103113002047), [Source 6](https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/24997407). Anyone who suggests this as a solution is either just really stupid, or doesn't care about actually helping and just wants to try make themselves feel better for their own weaknesses.\n\nThe solution isn't to make fat people hate their bodies. We need to teach fat people to love their bodies. Not to think their bodies are perfect, mind you, but to see that their bodies are something worthy of love and something that should be improved upon. People need to be pushed towards change in a positive way that doesn't just make them feel like crap and eat more.\n\nThis is far from the only problem, of course. There's a lot of other factors in play here, like how fatty foods are often cheaper, how corporations can obscure what is and isn't healthy and, of course, people just being stupid and not taking into account how they're destroying their bodies.\n\nBut the evidence is in. Shaming doesn't work, and we need to take the other road.","259":"The rest shouldn't be taxed it should be forced to spend on anything I don't care boat's, paintings, charity, back into someone's business... I don't care it should just get pumped back into the economy \n\nAnd the same tax rate would help so everyone is in the same boat so everyone gets the same effect when taxes are higher\/lower \n\nI also think fines shouldn't be fixed amounts but rather fixed percentages (let's say 2% of a monthly paycheck for speeding)...","260":"Honestly, I got vaccinated... But kinda lately, considering how most of the population was already vaccinated in my area. But, if you would have paid me, I would have got it faster.\n\nWith all the pro-vaxxers snowflakes around wishing death on unvaccinated people, I think it's just fair game to give them a monetary compensation. They don't want to get the vaccine because they don't trust this experimental vaccine. I felt like playing Russian roulette by taking it, and I'm still not convinced that I made the right move.\n\nSo, I don't, give an unvaccinated person a few thousands dollars IF YOU WANT (self-entitled as you are) people to get vaccinated because you still live in the delusional wonderland where if everyone gets vaccinated we would be already done with the pandemic... It's only fair that we take money from your pocket to pay those who refuse to get vaccinated.\n\nAlso, saying that unvaccinated people should have a lower priority to receive medical care is psychotic. They have a well deserved priority to get the care since they are more at risk.\n\nAnd, I can't say it enough, whether people get vaccinated or not IS NONE OF YOUR BUSINESS. PERIOD.","261":"[removed]","262":"There's been an influx of primarily conservative American individuals using this sub as a platform to bitch and moan  about individuals who don't agree with them. It's uninteresting and gets old very quickly. Maybe starting (if it doesn't exist already) a sub called r\/trueunpopularpoliticalopinion might be a proper solution.","263":"I don't like eating food, any food, and get no enjoyment out of it. Almost nothing ever tastes \"good\" to me, not even things most people love like sugary food or snack food, or expensive and fancy food from restaurants. I only eat to avoid getting hunger pains. I don't have an eating disorder or anything like that, I'm not underweight or overweight or anything, I just don't like eating food.","264":"[removed]","265":"[removed]","266":"In today's society,  modern women are the most privileged, hand held, babysat group of humans.\n\nBeing a woman today, is like playing life on easy mode. Lets go over some of their, exclusive perks.\n\n1: they are always trusted and believed, even if they lie.\n\n2: never suspected of any wrongdoing.\n\n3: its socially acceptable for a woman to abuse others.\n\n4: COURT. Enough said.\n\n5: They are always the first to leave in an emergency and last to sacrifice.\n\n6: can share their feelings openly without ridicule.\n\nMeanwhile, men have nothing.\n\nEdit: Thanks for the awards! Yall are too kind!\n\n\nAnd i also forgot a few, so im going to quote another freindly redditor.\n\n1. FGM is illegal and the preparator is charged with sexual assault because underage cannot consent while MGM is the exact same thing but that's allowed.\n\n2. In many countries, men from age 18 have to go to mandatory military service on the cost of losing their academic years.\n\n3. Affirmative action in all institutions excludes men. In 2010, Sweden banned affirmative action because they found that now men are in less strength in colleges, men were able to use affirmative action to get in prestigious universities.\n\n4. Men are excluded from the definition of law on rape.","267":"Sorry not sorry! I find them way to crunchy and the flavor is just off. Thankfully my boo loves them (like most other people) and he trades me all the breadsticks for them. \n\nI’m pretty sure my taste buds are working. Maybe it is because I don’t like Rye bread either? I’m coming to find when I share this opinion most people think something is wrong with me.","268":"Who cares? It’s on the other side of the world. As long as they don’t go after us (which they won’t) it’s not a big deal. I’m more concerned with kids being Confucianized, and if we ignore and block out China that won’t happen. Let’s go back into isolationism and mind our own business. China won’t weaken our military and if we cut off our economies they won’t weaken our economy either. Like I said, just prevent the kids from being confucianized, which is the only threat being posed. Other than that it’s not a big deal. Let’s forget about them.","269":"[removed]","270":"This is no judgment on either those who use steroids or those who are overweight. It's a specific phenomenon that I've seen tons of Instagram\/Tik Tok fitness models and influencers get up to over the years.\n\nNote that I don't mean it's *bad* for any of these models or trainers to help others lose weight, or explain what it does to your body to be overweight. But I've seen far too many of these guys and girls who are on steroids openly criticizing, judging, or mocking people who are overweight, especially those who are happily so, or positioning themselves or their lifestyles as healthy and the proper alternative or \"better than\" those who are fat.\n\nIf you stick needles into your body in order to obtain a supraphysiological physique, and portray that physique to the world as one that is desirable and enviable, you have no right to judge someone who is fat for any of the choices they make.","271":"[removed]","272":"I heard of someone who literally spends 80 hours per week studying, always stays in the library, always talks to the professors, and always works hard, yet flunked out of college. That is America. America's education system is rigorous and hard. America did not become the leader in tech by having an easy education system.","273":"[removed]","274":"[removed]","275":"[removed]","276":"And you know what, that’s fair. We’ve all done shit were not proud of at a time in our lives when we didn’t know any better or thought we were justified. You should be anxious, it’s a good indicator that you may need to take a look at your own actions. \n\nWhat does it say about men’s behaviour when most women have been sexually harassed or assaulted at some point in their lives? It means there are men out there engaging in that activity, so the anxiety and worry makes sense.\n\nSo all this “falsely accused” talk is just the runaround, an avoidance at talking about the real issues which is consent. \n\nDoes this mean no man is innocent? Of course not, there are men out there who have never commit any crime. \n\nDoes this mean there’s never been a woman to accuse someone of something they didn’t do? Nope, crazy ass awful people exist in the world. They will try to fuck your shit up regardless of whatever social gender norms there are. Regardless of how equally we treat men and women in society you still need to protect yourself and people will still hurt you.\n\nEdit: should I assume the lack of upvotes means this is popular lol?","277":"Having a large number of minorities in the cast of a movie, having strong women who don't have feminine characteristics or having a liberal political message in a movie doesn't automatically make it bad on a technical level. For example, \"Sorry To Bother You\" was very woke but it was also a great movie. The Aladdin(2019) movie does fit the definition of woke due to it removing the racism from the original movie and tripling down on the feminist themes of the original but it does this so well that a lot of anti-woke people didn't even perceive it as woke and it actually had a pretty fun script and amazing visuals. I also thought that Antebellum(2020) was pretty solid. It had its boring moments but it was good overall.\n\nAlso, Avatar: The Last Airbender(the TV show)is proof that if your talented enough, you can make anti woke people love something woke.\n\nEdit: I'm not saying it's never forced(Mortal Kombat(2021), for example) but it doesn't make entire movies terrible, usually","278":"[removed]","279":"Seriously, stop with this bullshit propaganda that the environment is some “living, breathing entity”, as if it were a person. The environment has no morals, no thoughts, no feelings, and consists of millions if separate, different systems that effect each other, and that’s IT. It is not a person, it is not a divine being.\n\nStop making it seem like there’s any sort of morality with the environment. What’s even worse is when scientists do this shit, as it immediately shows they have an agenda to push.\n\nIt annoys me to no end.","280":"Simply create a federal voter ID card that register's every citizen over 18 to vote. People show it when they vote in person or they write it on the envelope (sealed in another envelope) with other information. You send every adult citizen with an address a mail in ballot and have drop box at every school.\n\nThose who don't have an address because they are homeless could call a hotline to send it to the nearest post office for pick up.\n\nConservatives don't want easy secure voting they want complicated voting to prevent their urban dwelling opposition from getting ID they don't use as much like drivers license because city.","281":"[removed]","282":"[removed]","283":"Have you even been to college? I can tell you it is fucking HARD AS HELL. To actually pass and fully understand the material requires constantly pulling all-nighters and being stressed out all the time. Calling all of that shit students have to go to as brainwashing or daycare is just deplorable. It is the equivalent of calling the military an adult version of boy scouts. It is just flat out wrong and disgusting.","284":"[removed]","285":"There is no other group with more disposable income in America.  These couples often have combined incomes over $400,000, and they use it on frivolously shit, like huge houses they will never fill with the laughter of children or absurd vacations.  These people refuse to give back to society and raise the next generation of professionals, so they should be disproportionately punished for not doing so.\n\nI call it the childless tax, and it's past time for these selfish, hedonistic individuals to be bent over a table by uncle sam.  And before you say it, but what about the infertile?  That's their problem.  They can adopt a child if they want, but if they don't get at least one then they're done.  I'd take about 50% of their income away and throw a wealth tax on them as well.","286":"Failure does not lead to success. Do you seriously believe someone who murdered someone and ends up on death row is going to succeed in life? Of course not. That may be an extreme example, but people do say not all books have cover against the advice of not judging a book by its cover. Even then, in the hypercompetitive world in this day and age where companies can easily dispose you and have industries blacklist you, you do not want to make any mistakes. There are a ton of people who made tiny mistakes on their job and effectively became unemployable for the rest of their life.","287":"If you support the notion that it's OK to have safe spaces for women because they fear men, then it should be OK to use the reasoning that white people want their own spaces for fear of the minority thugs. Neither is OK, for the record. Both do happen. And both are not OK.\n\nSecondly, many don't like the idea of segregated stuff such as boys scouts or women's league etc and are totally OK with women playing in boys clubs. That's fine by me. However, you can't in the same breath then say we need women's spaces and no man can come in.","288":"Where is \/u\/Chessen113? When I first came here he had created a small community of outsiders just looking to share actually unpopular opinions. \n\nEveryone sees the subreddit trending in the wrong direction. It's all the work of one power mod who infiltrated and apparently took over the whole sub and now runs it like a dictator and whenever anyone questions where these stupid rules come from he claims admins keep in constant contact with him personally via direct message about the state of this 22k person sub.\n\nAnyone else not buying that bullshit anymore?\n\nEdit: Seems like this is pretty unpopular. You're all welcome. The unpopularity is on display even while the power mod abuses his privileges by pinning his own [lame] response. XD","289":"I don't get the hate. I don't get why anime as a whole is seen as cringey. Anime is diverse, all anime is is animated shows and movies from Japan.\n\nSome animes are cringey as fuck, and the \"weebs\" who marry their cum-crusted waifu are also cringe, but anime as a whole? Every single person who watches anime is cringe? No, that's absurd.\n\nSome anime shows are fucking masterpieces. If you have an open mind and aren't scared to like things other peope don't like, go watch Death Note. It will blow your mind. It's written better than most mainstream TV shows I know, its plot is so well thoughtout and keeps you engaged at all times, there isn't a single dull episode. It's one of those shows that makes you want to wipe your memory, just for the chance to watch it for the first time again.\n\nAnime isn't cringe, it can be awesome. I am convinced anyone who hates anime as a whole is just jumping on the bandwagon and too scared to like something the mainstream doesn't like. Stop trying to fit it, like what you like. It's embarrassing.","290":"The proof is in The Darwin Awards. It’s hard not to laugh at people who undo their safety harnesses on roller coaster rides to get air time, fuck each other while operating a plane or ride on top of cars while drunk. \n\nYes, they died. Yes, the fact that they died is sad and people are grieving. But the way they died has at least got you to chuckle a little, right?","291":"You can despise trump and think his opinions were wrong, immoral or even downright evil. But you're just strait up lying if you say he had an unlikable personality  and was refreshing for a politician. Seriously If you were able to completely ignore your own personal opinions (which to be clear is impossible) and judge his press conferences and speeches soully on the way he presented himself, you would almost certainly find him likable. This doesn't mean he's necessarily a good person, he is narcissistic, his messaging was often poor, he was even a asshole at times to people who didn't deserve it. But based purely on the way he presented himself and his personality, he was absolutely enjoyable.\n\nIf Donald trump was a Democrat and repeated all their talking points, I don't doubt for a second that they would have adored him. They would of talked about how he's so energetic and passionate. They would have (correctly) pointed out how refreshing he was for a politician and held him up as a great communicator.","292":"**Edit:** for those of you who don't know, **a Vasectomy is not a castration. Men who had vasectomies still have balls, they just can't have kids.**\n\nThis counters many of the common counter-arguments against financial abortions, for example:\n\n>If we allow men to financially abort, this will be abused and men won't have to take any precautions against pregnancy\n\nThis proposal would still make sure that they still have something to lose, while still giving them actual options that don't involve ruining their life\n\n>There would be an epidemic of single mothers\n\nThis proposal would limit this because 1) they would have an incentive to take precautions as explained in the previous point, and 2) if someone is irresponsible, this would limit the number of pregnancies they could cause\n\n>Financial abortions are unfair because signing a paper isn't comparable to a medical procedure\n\nUnder this, a medical procedure IS required for men as well\n\n>Financial abortions allow them to abandon a child and then have a second one later. This is extremely unfair to the first child\n\nThis concern would not apply in the majority of cases, because they would basically be opting out of fatherhood entirely, unless they happen to already have kids or they choose to adopt\n\n>iF yOu dOn'T wAnNa pAy cHiLD sUPpoRt tHeN dON't haAve sEx\n\nIf you don't wanna get pregnant then don't have sex. Let's ban abortions then. See why this doesn't work?","293":"It's getting dull to see shit that is almost always racist can we please restrict them to a day idiots on this sub seem to think their is some sort of race war that effects people on a day to day basis, noone fucking cares about your shit takes on race relations please it's dull","294":"I've tried to make a post on here twice now, both times it got deemed \"Against Reddit's Content Policy\" despite being perfectly in line with both that and with this Subreddit's individual rules. Hell, despite not being able to say it in here for obvious reasons, it's more in line with those than an entire post I've made on here before, that *wasn't* censored even once.  \n\n\nThe post is entirely about the lack of attention that mental illnesses\/disabilities get nowadays compared to the significant amount of attention that others get, yet even mentioning the specific topics that get more attention immediately gets the post censored.  \n\n\nSo to all the people on there who think the moderators aren't censoring anyone, even though I used to agree that there was either no censorship or only censorship that was deserved, clearly we're all wrong on that one. To those who already know about the censorship, I guess I'm one of you now...","295":"[removed]","296":"The Right to Privacy is embedded in the penumbra of the 4th amendment, according to William O Douglass.  \n\nThis is a hardcore conservative idea.  First, you have to accept that people have a right to privacy from their government.  You don't believe that do you, Leftists?  Privacy, the right to be left alone, is a conservative ideal.  It's the heart of the modern conservative\/libertarian movement.  \n\nSecond, the Supreme Court is the most conservative branch of government.  The SCOTUS operates under stare decisis, which is the most conservative doctrine in human history.  It means (in an intentionally hyperbolic and flippant way) that an opinion is right because it is old.  We continue to have abortion because Roe v. Wade is old, and therefore, right.  This is inherently and profoundly conservative.  The word conservative means to keep things the same, i.e. to conserve the status quo. \n\n\nI didn't realize that reddit was such a rightwing, conservative website.","297":"If a man who is not knowledgeable about a topic is condescending to a woman who is actually educated on it and positions himself as the true expert, ON THE BASIS THAT SHE IS A WOMAN, this is mansplaining. Especially if the topic at hand relates to women-centric issues such as abortion. \n\nAny time that a man challenges a woman’s idea, or tells her she is incorrect, outside of this does not qualify. A woman can be completely wrong and uneducated on a topic and if a man in her proximity has the knowledge and ability to correct her, he should, exactly as if the roles were reversed, because spreading false information even unknowingly leads to a less informed society. \n\nToo many people want to use this term to avoid acknowledging they’re wrong even when the actual behavior is just politely correcting someone and I find it manipulative AF.","298":"I don't think no matter how many tax payers there are, you can't sustain a free public healthcare system for 331,000,000+ Americans and growing. \n\nEven then, there would be a massive waiting list and medical supplies would have to most likely be rationed and controlled by the government. People talk about a capitalist government being dystopian, but being in a society where the government can choose who should and shouldn't get treatment seems pretty dystopic to me.","299":"[removed]","300":"Any girl I date in the future who want's to get married will have to reside to getting it done in 10 minutes at the local court house.\n\nI'm fine with the idea of an expensive honeymoon but I fucking refuse to waste time money and nerves on the overrated party where dozens of people you barely interact with show up for a momentous event.\n\nI don't ever need dozens or hundreds of people getting into my business. I'd much rather have both marriage and birth of my children be done secretly and then casually mention they happened to people after the fact then they won't be able to give advice or ask about when's the wedding.","301":"[removed]","302":"This might be popular in a broad sense but it is very unpopular in many circles. Id also argue while vaccines are popular, I do not know if a vaccine mandate is popular.\n\nI do not support the government finding every American citizen, going to their house and giving them a shot. But I do support school, government employment and company wide vaccine mandates. \n\nIn general, I do not care what you do with your own body. If you want to inject yourself with heroin go right ahead. The problem is, insane conspiracists are not putting their own lives at risk, they are putting everyone’s life at risk. In America, you have a lot of freedoms but with that freedom exists a responsibility not to harm your fellow citizens. That’s why you can’t drive drunk or smoke indoors. \n\nI do not want your unvaccinated kids going to school and infecting my kid. Even if he doesn’t die but gets a long lasting covid side effect, that would be crushing. \n\nNot to mention, unvaccinated people are helping create new variants which can be more transmittable, more deadly, or more resistant to the vaccine. \n\nYou have freedom in America, but with every freedom comes responsibility.\n\nEdit: this is definitely unpopular especially in this sub based on the responses","303":"[removed]","304":"I'm not a financial genius or anything but I'd bet if you threw your money into an index fund while you're young like the SP500 and leave it alone for a couple decades, history has shown you'll end up richer than you were from when you started.  Yes this is called an investment.  It's so easy you could get a monkey to throw darts to pick a bunch of stocks and make money off it after a couple decades.  People who hate Wall Street hate it because they aren't using it to make money, or have bet on speculative yolo stock gambles. Because Wall Street can make money for everybody. The rich and poor and in-between.","305":"[removed]"},"comments":{"0":"<praw.models.comment_forest.CommentForest object at 0x0000017716FA0C50>","1":"<praw.models.comment_forest.CommentForest object at 0x0000017717103898>","2":"<praw.models.comment_forest.CommentForest object at 0x0000017716CA2518>","3":"<praw.models.comment_forest.CommentForest object at 0x0000017716DA9320>","4":"<praw.models.comment_forest.CommentForest object at 0x0000017716E18DA0>","5":"<praw.models.comment_forest.CommentForest object at 0x0000017716DB8D68>","6":"<praw.models.comment_forest.CommentForest object at 0x0000017716C7B710>","7":"<praw.models.comment_forest.CommentForest object at 0x0000017716D3B5C0>","8":"<praw.models.comment_forest.CommentForest object at 0x0000017716CBD5F8>","9":"<praw.models.comment_forest.CommentForest object at 0x0000017716EE78D0>","10":"<praw.models.comment_forest.CommentForest object at 0x0000017716C497B8>","11":"<praw.models.comment_forest.CommentForest object at 0x0000017716C224E0>","12":"<praw.models.comment_forest.CommentForest object at 0x00000177167A4438>","13":"<praw.models.comment_forest.CommentForest object at 0x0000017716956860>","14":"<praw.models.comment_forest.CommentForest object at 0x00000177167A4828>","15":"<praw.models.comment_forest.CommentForest object at 0x000001771696B780>","16":"<praw.models.comment_forest.CommentForest object at 0x000001771697B4A8>","17":"<praw.models.comment_forest.CommentForest object at 0x00000177167ACA58>","18":"<praw.models.comment_forest.CommentForest object at 0x00000177167B9DD8>","19":"<praw.models.comment_forest.CommentForest object at 0x0000017716699A20>","20":"<praw.models.comment_forest.CommentForest object at 0x00000177168F7F98>","21":"<praw.models.comment_forest.CommentForest object at 0x0000017716660A58>","22":"<praw.models.comment_forest.CommentForest object at 0x000001771699A438>","23":"<praw.models.comment_forest.CommentForest object at 0x0000017716706F98>","24":"<praw.models.comment_forest.CommentForest object at 0x00000177166E9320>","25":"<praw.models.comment_forest.CommentForest object at 0x000001771661CA90>","26":"<praw.models.comment_forest.CommentForest object at 0x00000177168A0940>","27":"<praw.models.comment_forest.CommentForest object at 0x000001771390E518>","28":"<praw.models.comment_forest.CommentForest object at 0x00000177133AB5F8>","29":"<praw.models.comment_forest.CommentForest object at 0x000001771656BB38>","30":"<praw.models.comment_forest.CommentForest object at 0x0000017713387940>","31":"<praw.models.comment_forest.CommentForest object at 0x000001771684C080>","32":"<praw.models.comment_forest.CommentForest object at 0x000001771194FC18>","33":"<praw.models.comment_forest.CommentForest object at 0x000001770BD1D550>","34":"<praw.models.comment_forest.CommentForest object at 0x000001770BE5B2B0>","35":"<praw.models.comment_forest.CommentForest object at 0x000001776D7AD5F8>","36":"<praw.models.comment_forest.CommentForest object at 0x000001770C049908>","37":"<praw.models.comment_forest.CommentForest object at 0x000001770BCBCBE0>","38":"<praw.models.comment_forest.CommentForest object at 0x000001770BD5DC88>","39":"<praw.models.comment_forest.CommentForest object at 0x000001770BCFEF28>","40":"<praw.models.comment_forest.CommentForest object at 0x000001770C0BED30>","41":"<praw.models.comment_forest.CommentForest object at 0x000001770A68EFD0>","42":"<praw.models.comment_forest.CommentForest object at 0x000001770A5B1DD8>","43":"<praw.models.comment_forest.CommentForest object at 0x000001770B8192E8>","44":"<praw.models.comment_forest.CommentForest object at 0x0000017718F49048>","45":"<praw.models.comment_forest.CommentForest object at 0x000001770A6F06A0>","46":"<praw.models.comment_forest.CommentForest object at 0x0000017709C89278>","47":"<praw.models.comment_forest.CommentForest object at 0x0000017718989780>","48":"<praw.models.comment_forest.CommentForest object at 0x000001771A2BCB38>","49":"<praw.models.comment_forest.CommentForest object at 0x0000017716599898>","50":"<praw.models.comment_forest.CommentForest object at 0x000001770C3C0A90>","51":"<praw.models.comment_forest.CommentForest object at 0x00000177117E7EB8>","52":"<praw.models.comment_forest.CommentForest object at 0x0000017716599208>","53":"<praw.models.comment_forest.CommentForest object at 0x000001771879C240>","54":"<praw.models.comment_forest.CommentForest object at 0x0000017716788DD8>","55":"<praw.models.comment_forest.CommentForest object at 0x0000017718B43240>","56":"<praw.models.comment_forest.CommentForest object at 0x0000017713091550>","57":"<praw.models.comment_forest.CommentForest object at 0x00000177117FCBE0>","58":"<praw.models.comment_forest.CommentForest object at 0x000001771308EBE0>","59":"<praw.models.comment_forest.CommentForest object at 0x000001771308EA58>","60":"<praw.models.comment_forest.CommentForest object at 0x000001771754B240>","61":"<praw.models.comment_forest.CommentForest object at 0x00000177168A1048>","62":"<praw.models.comment_forest.CommentForest object at 0x000001771689A208>","63":"<praw.models.comment_forest.CommentForest object at 0x00000177168B9978>","64":"<praw.models.comment_forest.CommentForest object at 0x00000177186766D8>","65":"<praw.models.comment_forest.CommentForest object at 0x0000017718664978>","66":"<praw.models.comment_forest.CommentForest object at 0x00000177172B22B0>","67":"<praw.models.comment_forest.CommentForest object at 0x000001771711DA58>","68":"<praw.models.comment_forest.CommentForest object at 0x00000177165D76D8>","69":"<praw.models.comment_forest.CommentForest object at 0x000001771C486CC0>","70":"<praw.models.comment_forest.CommentForest object at 0x000001771C492DD8>","71":"<praw.models.comment_forest.CommentForest object at 0x000001771C48BEF0>","72":"<praw.models.comment_forest.CommentForest object at 0x000001771C4B5080>","73":"<praw.models.comment_forest.CommentForest object at 0x000001771C4AF320>","74":"<praw.models.comment_forest.CommentForest object at 0x000001771660EC18>","75":"<praw.models.comment_forest.CommentForest object at 0x000001771C48B400>","76":"<praw.models.comment_forest.CommentForest object at 0x000001771C5F4CF8>","77":"<praw.models.comment_forest.CommentForest object at 0x000001771C635CC0>","78":"<praw.models.comment_forest.CommentForest object at 0x000001771C5B8BE0>","79":"<praw.models.comment_forest.CommentForest object at 0x000001771C4BE6A0>","80":"<praw.models.comment_forest.CommentForest object at 0x000001771C722048>","81":"<praw.models.comment_forest.CommentForest object at 0x000001771C73B400>","82":"<praw.models.comment_forest.CommentForest object at 0x000001771C76A518>","83":"<praw.models.comment_forest.CommentForest object at 0x000001771C753F28>","84":"<praw.models.comment_forest.CommentForest object at 0x000001771C76FD68>","85":"<praw.models.comment_forest.CommentForest object at 0x000001771C720BA8>","86":"<praw.models.comment_forest.CommentForest object at 0x000001771C7AF9E8>","87":"<praw.models.comment_forest.CommentForest object at 0x000001771C7C3C18>","88":"<praw.models.comment_forest.CommentForest object at 0x000001771C82FEF0>","89":"<praw.models.comment_forest.CommentForest object at 0x000001771C883470>","90":"<praw.models.comment_forest.CommentForest object at 0x000001771C8D8358>","91":"<praw.models.comment_forest.CommentForest object at 0x000001771C806898>","92":"<praw.models.comment_forest.CommentForest object at 0x000001771C9476A0>","93":"<praw.models.comment_forest.CommentForest object at 0x000001771C9E85C0>","94":"<praw.models.comment_forest.CommentForest object at 0x000001771DA4ED30>","95":"<praw.models.comment_forest.CommentForest object at 0x000001771DA9EC88>","96":"<praw.models.comment_forest.CommentForest object at 0x000001771DB09908>","97":"<praw.models.comment_forest.CommentForest object at 0x000001771DA947B8>","98":"<praw.models.comment_forest.CommentForest object at 0x000001771DAE8860>","99":"<praw.models.comment_forest.CommentForest object at 0x000001771DB86278>","100":"<praw.models.comment_forest.CommentForest object at 0x000001771DA56630>","101":"<praw.models.comment_forest.CommentForest object at 0x000001771DBAE5C0>","102":"<praw.models.comment_forest.CommentForest object at 0x000001771DC070B8>","103":"<praw.models.comment_forest.CommentForest object at 0x000001771DC21940>","104":"<praw.models.comment_forest.CommentForest object at 0x000001771DCF9DA0>","105":"<praw.models.comment_forest.CommentForest object at 0x000001771DCA1668>","106":"<praw.models.comment_forest.CommentForest object at 0x000001771DD17128>","107":"<praw.models.comment_forest.CommentForest object at 0x000001771DD47C88>","108":"<praw.models.comment_forest.CommentForest object at 0x000001771DD1D550>","109":"<praw.models.comment_forest.CommentForest object at 0x000001771DD5FC50>","110":"<praw.models.comment_forest.CommentForest object at 0x000001771DD7B7F0>","111":"<praw.models.comment_forest.CommentForest object at 0x000001771DD80E80>","112":"<praw.models.comment_forest.CommentForest object at 0x000001771DD96198>","113":"<praw.models.comment_forest.CommentForest object at 0x000001771DE67518>","114":"<praw.models.comment_forest.CommentForest object at 0x000001771DE3E898>","115":"<praw.models.comment_forest.CommentForest object at 0x000001771DE8AC18>","116":"<praw.models.comment_forest.CommentForest object at 0x000001771DE80BA8>","117":"<praw.models.comment_forest.CommentForest object at 0x000001771DED8358>","118":"<praw.models.comment_forest.CommentForest object at 0x000001771DEAD5F8>","119":"<praw.models.comment_forest.CommentForest object at 0x000001771DDA2898>","120":"<praw.models.comment_forest.CommentForest object at 0x000001771DE94358>","121":"<praw.models.comment_forest.CommentForest object at 0x000001771DEC2A90>","122":"<praw.models.comment_forest.CommentForest object at 0x000001771DEF8128>","123":"<praw.models.comment_forest.CommentForest object at 0x000001771DF10F28>","124":"<praw.models.comment_forest.CommentForest object at 0x000001771DF07F60>","125":"<praw.models.comment_forest.CommentForest object at 0x000001771DF7FD68>","126":"<praw.models.comment_forest.CommentForest object at 0x000001771DFB5F98>","127":"<praw.models.comment_forest.CommentForest object at 0x000001771E017BA8>","128":"<praw.models.comment_forest.CommentForest object at 0x000001771E093630>","129":"<praw.models.comment_forest.CommentForest object at 0x000001771E0A4A20>","130":"<praw.models.comment_forest.CommentForest object at 0x000001771E0D1828>","131":"<praw.models.comment_forest.CommentForest object at 0x000001771E0E4CF8>","132":"<praw.models.comment_forest.CommentForest object at 0x000001771E0FF908>","133":"<praw.models.comment_forest.CommentForest object at 0x000001771E101240>","134":"<praw.models.comment_forest.CommentForest object at 0x000001771E1985C0>","135":"<praw.models.comment_forest.CommentForest object at 0x000001771E189860>","136":"<praw.models.comment_forest.CommentForest object at 0x000001771E1321D0>","137":"<praw.models.comment_forest.CommentForest object at 0x000001771E1572E8>","138":"<praw.models.comment_forest.CommentForest object at 0x000001771E1C4198>","139":"<praw.models.comment_forest.CommentForest object at 0x000001771E225F28>","140":"<praw.models.comment_forest.CommentForest object at 0x000001771E298978>","141":"<praw.models.comment_forest.CommentForest object at 0x000001771E2CBFD0>","142":"<praw.models.comment_forest.CommentForest object at 0x000001771E5D9390>","143":"<praw.models.comment_forest.CommentForest object at 0x000001771E364A90>","144":"<praw.models.comment_forest.CommentForest object at 0x000001771E2E1048>","145":"<praw.models.comment_forest.CommentForest object at 0x000001771E3F6DD8>","146":"<praw.models.comment_forest.CommentForest object at 0x000001771E60E4A8>","147":"<praw.models.comment_forest.CommentForest object at 0x000001771E608C88>","148":"<praw.models.comment_forest.CommentForest object at 0x000001771E34DA90>","149":"<praw.models.comment_forest.CommentForest object at 0x000001771E63F2B0>","150":"<praw.models.comment_forest.CommentForest object at 0x000001771E68FA90>","151":"<praw.models.comment_forest.CommentForest object at 0x000001771E675160>","152":"<praw.models.comment_forest.CommentForest object at 0x000001771E6A5828>","153":"<praw.models.comment_forest.CommentForest object at 0x000001771E76C7F0>","154":"<praw.models.comment_forest.CommentForest object at 0x000001771E6B9710>","155":"<praw.models.comment_forest.CommentForest object at 0x000001771E6B9588>","156":"<praw.models.comment_forest.CommentForest object at 0x000001771E79C2B0>","157":"<praw.models.comment_forest.CommentForest object at 0x000001771E77C160>","158":"<praw.models.comment_forest.CommentForest object at 0x000001771E870630>","159":"<praw.models.comment_forest.CommentForest object at 0x000001771E8921D0>","160":"<praw.models.comment_forest.CommentForest object at 0x000001771E884D68>","161":"<praw.models.comment_forest.CommentForest object at 0x000001771E7DE0F0>","162":"<praw.models.comment_forest.CommentForest object at 0x000001771E8800B8>","163":"<praw.models.comment_forest.CommentForest object at 0x000001771E94F5C0>","164":"<praw.models.comment_forest.CommentForest object at 0x000001771E9594A8>","165":"<praw.models.comment_forest.CommentForest object at 0x000001771E7D14A8>","166":"<praw.models.comment_forest.CommentForest object at 0x000001771E9DDD68>","167":"<praw.models.comment_forest.CommentForest object at 0x000001771EA6ADD8>","168":"<praw.models.comment_forest.CommentForest object at 0x000001771EAB98D0>","169":"<praw.models.comment_forest.CommentForest object at 0x000001771EB33278>","170":"<praw.models.comment_forest.CommentForest object at 0x000001771EAD8588>","171":"<praw.models.comment_forest.CommentForest object at 0x000001771EB4FD68>","172":"<praw.models.comment_forest.CommentForest object at 0x000001771EB5B240>","173":"<praw.models.comment_forest.CommentForest object at 0x000001771EB073C8>","174":"<praw.models.comment_forest.CommentForest object at 0x000001771EBA9208>","175":"<praw.models.comment_forest.CommentForest object at 0x000001771EB5B7F0>","176":"<praw.models.comment_forest.CommentForest object at 0x000001771E7D6128>","177":"<praw.models.comment_forest.CommentForest object at 0x000001771EB84748>","178":"<praw.models.comment_forest.CommentForest object at 0x000001771EAADDA0>","179":"<praw.models.comment_forest.CommentForest object at 0x000001771EB369E8>","180":"<praw.models.comment_forest.CommentForest object at 0x000001771EBBCD68>","181":"<praw.models.comment_forest.CommentForest object at 0x000001771EBCBE10>","182":"<praw.models.comment_forest.CommentForest object at 0x000001771EBDCCF8>","183":"<praw.models.comment_forest.CommentForest object at 0x000001771EBD2128>","184":"<praw.models.comment_forest.CommentForest object at 0x000001771EBE35F8>","185":"<praw.models.comment_forest.CommentForest object at 0x000001771FBC8908>","186":"<praw.models.comment_forest.CommentForest object at 0x000001771FC376D8>","187":"<praw.models.comment_forest.CommentForest object at 0x000001771FC079B0>","188":"<praw.models.comment_forest.CommentForest object at 0x000001771FBD1630>","189":"<praw.models.comment_forest.CommentForest object at 0x000001771FD29A20>","190":"<praw.models.comment_forest.CommentForest object at 0x000001771FD37DA0>","191":"<praw.models.comment_forest.CommentForest object at 0x000001771FC93E80>","192":"<praw.models.comment_forest.CommentForest object at 0x000001771FD51978>","193":"<praw.models.comment_forest.CommentForest object at 0x000001771FCE5710>","194":"<praw.models.comment_forest.CommentForest object at 0x000001771FDD6400>","195":"<praw.models.comment_forest.CommentForest object at 0x000001771FCDCB38>","196":"<praw.models.comment_forest.CommentForest object at 0x000001771FD61198>","197":"<praw.models.comment_forest.CommentForest object at 0x000001771FCB3D30>","198":"<praw.models.comment_forest.CommentForest object at 0x000001771FE6B278>","199":"<praw.models.comment_forest.CommentForest object at 0x000001771FDF9C18>","200":"<praw.models.comment_forest.CommentForest object at 0x000001771FC60B70>","201":"<praw.models.comment_forest.CommentForest object at 0x000001771FDB8438>","202":"<praw.models.comment_forest.CommentForest object at 0x000001771FEB5E10>","203":"<praw.models.comment_forest.CommentForest object at 0x000001771FE9CF28>","204":"<praw.models.comment_forest.CommentForest object at 0x000001772002E8D0>","205":"<praw.models.comment_forest.CommentForest object at 0x000001771FEE6198>","206":"<praw.models.comment_forest.CommentForest object at 0x0000017720041550>","207":"<praw.models.comment_forest.CommentForest object at 0x0000017720047320>","208":"<praw.models.comment_forest.CommentForest object at 0x00000177200E4978>","209":"<praw.models.comment_forest.CommentForest object at 0x0000017720059EF0>","210":"<praw.models.comment_forest.CommentForest object at 0x000001772013F3C8>","211":"<praw.models.comment_forest.CommentForest object at 0x00000177200C8B00>","212":"<praw.models.comment_forest.CommentForest object at 0x00000177200C4EF0>","213":"<praw.models.comment_forest.CommentForest object at 0x00000177201BD860>","214":"<praw.models.comment_forest.CommentForest object at 0x00000177201DE908>","215":"<praw.models.comment_forest.CommentForest object at 0x00000177202334A8>","216":"<praw.models.comment_forest.CommentForest object at 0x000001772025D0F0>","217":"<praw.models.comment_forest.CommentForest object at 0x000001772026FF28>","218":"<praw.models.comment_forest.CommentForest object at 0x000001772031DBA8>","219":"<praw.models.comment_forest.CommentForest object at 0x00000177202EF780>","220":"<praw.models.comment_forest.CommentForest object at 0x000001772036BBE0>","221":"<praw.models.comment_forest.CommentForest object at 0x00000177203DC048>","222":"<praw.models.comment_forest.CommentForest object at 0x000001772040C128>","223":"<praw.models.comment_forest.CommentForest object at 0x000001772040F780>","224":"<praw.models.comment_forest.CommentForest object at 0x00000177204184A8>","225":"<praw.models.comment_forest.CommentForest object at 0x000001772041BBE0>","226":"<praw.models.comment_forest.CommentForest object at 0x0000017720452160>","227":"<praw.models.comment_forest.CommentForest object at 0x000001772049CE80>","228":"<praw.models.comment_forest.CommentForest object at 0x00000177204C8C50>","229":"<praw.models.comment_forest.CommentForest object at 0x00000177204673C8>","230":"<praw.models.comment_forest.CommentForest object at 0x0000017720516E10>","231":"<praw.models.comment_forest.CommentForest object at 0x0000017720531C50>","232":"<praw.models.comment_forest.CommentForest object at 0x000001772053E1D0>","233":"<praw.models.comment_forest.CommentForest object at 0x0000017720578CF8>","234":"<praw.models.comment_forest.CommentForest object at 0x00000177205650B8>","235":"<praw.models.comment_forest.CommentForest object at 0x0000017720597F60>","236":"<praw.models.comment_forest.CommentForest object at 0x0000017720589978>","237":"<praw.models.comment_forest.CommentForest object at 0x00000177206E1438>","238":"<praw.models.comment_forest.CommentForest object at 0x0000017720543EF0>","239":"<praw.models.comment_forest.CommentForest object at 0x00000177207CA358>","240":"<praw.models.comment_forest.CommentForest object at 0x00000177207E62E8>","241":"<praw.models.comment_forest.CommentForest object at 0x00000177207A77B8>","242":"<praw.models.comment_forest.CommentForest object at 0x00000177207F87B8>","243":"<praw.models.comment_forest.CommentForest object at 0x00000177207F8CF8>","244":"<praw.models.comment_forest.CommentForest object at 0x000001772080EE48>","245":"<praw.models.comment_forest.CommentForest object at 0x000001772087EBA8>","246":"<praw.models.comment_forest.CommentForest object at 0x00000177207924A8>","247":"<praw.models.comment_forest.CommentForest object at 0x000001772089B6D8>","248":"<praw.models.comment_forest.CommentForest object at 0x0000017720845400>","249":"<praw.models.comment_forest.CommentForest object at 0x000001772084B390>","250":"<praw.models.comment_forest.CommentForest object at 0x0000017721983EB8>","251":"<praw.models.comment_forest.CommentForest object at 0x0000017721992978>","252":"<praw.models.comment_forest.CommentForest object at 0x00000177219E1E10>","253":"<praw.models.comment_forest.CommentForest object at 0x00000177219EB400>","254":"<praw.models.comment_forest.CommentForest object at 0x0000017721A05BA8>","255":"<praw.models.comment_forest.CommentForest object at 0x0000017721A28978>","256":"<praw.models.comment_forest.CommentForest object at 0x0000017721A16EB8>","257":"<praw.models.comment_forest.CommentForest object at 0x0000017721A730F0>","258":"<praw.models.comment_forest.CommentForest object at 0x0000017721A2E4E0>","259":"<praw.models.comment_forest.CommentForest object at 0x00000177219EBDD8>","260":"<praw.models.comment_forest.CommentForest object at 0x0000017721B166A0>","261":"<praw.models.comment_forest.CommentForest object at 0x0000017721A34C88>","262":"<praw.models.comment_forest.CommentForest object at 0x0000017721A79208>","263":"<praw.models.comment_forest.CommentForest object at 0x0000017721A9A780>","264":"<praw.models.comment_forest.CommentForest object at 0x0000017721ADF080>","265":"<praw.models.comment_forest.CommentForest object at 0x0000017721A0F780>","266":"<praw.models.comment_forest.CommentForest object at 0x0000017721C258D0>","267":"<praw.models.comment_forest.CommentForest object at 0x0000017721AE4828>","268":"<praw.models.comment_forest.CommentForest object at 0x0000017721BE62B0>","269":"<praw.models.comment_forest.CommentForest object at 0x0000017721BD2048>","270":"<praw.models.comment_forest.CommentForest object at 0x0000017721DE0F98>","271":"<praw.models.comment_forest.CommentForest object at 0x0000017721C4E160>","272":"<praw.models.comment_forest.CommentForest object at 0x0000017721C56940>","273":"<praw.models.comment_forest.CommentForest object at 0x0000017721D540B8>","274":"<praw.models.comment_forest.CommentForest object at 0x0000017721D6DCC0>","275":"<praw.models.comment_forest.CommentForest object at 0x0000017721CF5630>","276":"<praw.models.comment_forest.CommentForest object at 0x0000017721CAB550>","277":"<praw.models.comment_forest.CommentForest object at 0x0000017721CC6CC0>","278":"<praw.models.comment_forest.CommentForest object at 0x0000017721EC70F0>","279":"<praw.models.comment_forest.CommentForest object at 0x0000017721E9EFD0>","280":"<praw.models.comment_forest.CommentForest object at 0x0000017721EA7978>","281":"<praw.models.comment_forest.CommentForest object at 0x0000017721EEC7F0>","282":"<praw.models.comment_forest.CommentForest object at 0x0000017721EAC4A8>","283":"<praw.models.comment_forest.CommentForest object at 0x0000017721F0B3C8>","284":"<praw.models.comment_forest.CommentForest object at 0x0000017721CB5C88>","285":"<praw.models.comment_forest.CommentForest object at 0x0000017721F42518>","286":"<praw.models.comment_forest.CommentForest object at 0x0000017721F7A780>","287":"<praw.models.comment_forest.CommentForest object at 0x0000017722033080>","288":"<praw.models.comment_forest.CommentForest object at 0x0000017721FD3AC8>","289":"<praw.models.comment_forest.CommentForest object at 0x0000017721FF3C18>","290":"<praw.models.comment_forest.CommentForest object at 0x00000177220045F8>","291":"<praw.models.comment_forest.CommentForest object at 0x0000017722100160>","292":"<praw.models.comment_forest.CommentForest object at 0x00000177220F2048>","293":"<praw.models.comment_forest.CommentForest object at 0x000001772217C630>","294":"<praw.models.comment_forest.CommentForest object at 0x0000017722023978>","295":"<praw.models.comment_forest.CommentForest object at 0x00000177222486A0>","296":"<praw.models.comment_forest.CommentForest object at 0x0000017722197E48>","297":"<praw.models.comment_forest.CommentForest object at 0x00000177222625C0>","298":"<praw.models.comment_forest.CommentForest object at 0x00000177221694A8>","299":"<praw.models.comment_forest.CommentForest object at 0x00000177222D6438>","300":"<praw.models.comment_forest.CommentForest object at 0x00000177221C4A20>","301":"<praw.models.comment_forest.CommentForest object at 0x000001772234E668>","302":"<praw.models.comment_forest.CommentForest object at 0x0000017722366080>","303":"<praw.models.comment_forest.CommentForest object at 0x00000177223903C8>","304":"<praw.models.comment_forest.CommentForest object at 0x000001772231C208>","305":"<praw.models.comment_forest.CommentForest object at 0x00000177223A6438>"}}